/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize);
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {

pub const ZEND_LOGO_DATA_URI : & [u8 ; 6083] = b"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAPoAAAAvCAYAAADKH9ehAAAAGXRFWHRTb2Z0d2FyZQBBZG9iZSBJbWFnZVJlYWR5ccllPAAAEWJJREFUeNrsXQl0VNUZvjNJSAgEAxHCGsNitSBFxB1l0boUW1pp3VAUrKLWKgUPUlEB13K0Yq1alaXWuh5EadWK1F0s1gJaoaCgQDRKBBJDVhKSzPR+zPfg5vLevCUzmZnwvnP+k8ybN3fevfff73/vBAJTHxc+khL5kr6T1ODk5nAgTRTWloghFVtEg/zfh2PkSvq9pJGSKiX9SdKittbJoD/PSYkrJD0vKeB4IsNNotfuUtHk/CM+IvijpF9KGiDpGEkLJZ3lC7qPeKKTpD9IWiDpUOfWPCi61ZeLvD2VIhTwp9QlTjK5NsIXdB/xxHmSpvD/OucWPSAyQw2+LfeG1SbXVra1Tqb785xUaNdMel0g7Iu5V1zPv6dJqpD0kKR/+ILuI55o8oeg1bFT0kWSOkraQxK+oPvw0TZR3ZY758foyQXf//ZxUFh0Q/GEfNf9gHkaJ6m7pHJJSyTt9tnXhxtBR2EGlnHCMbZMaHuHzX19JZ0u6VRJh0k6hM+BpMjnklZIelPSNhff3V5StkNlEWBMFm+3LcC+BW3GuZP2GvfmiEiCCMUzxZIKRGSt9zeML/fdGAW9JB3O8c6SlMZ+b5f0qaQiF7EpnieXY1auvZfG7zhSUk8RSS428F7M5xfsh1eAV/vxOzoq16sklZBqbdpo5H2qDPRQXoP3Ki0+20FSFyrZUgt+Rt/7KH2vZb8/t/iMG2Sy/0dI6sbvgHGoV8a3xErQb5Q0iTfHCplkzlkW7w+VNF3ST7QJUzFK0pVkDFiw+yV95uC7r5Z0k3CW2ApwIkrJ9B9IelfSh2SIlqC/pDFUZAVk0rQoMhk2GYswx+AtWvMKPtcyEckW37pPwsIHNAuBniDpYhEpBMmJwvibJL0gIlVh39r0C8UlczkXQ/mM6OtEzuf3RfPVAxUY47f5PStcGKPxpOMldbbxiBptPMavJX1PuQ/P/olyz12S7rD4PLyqBTQ8gyXVSOot6VK+dxR53wyl7POjkv7pkpcwpleJSCHP4eQjM0BB/ZuG4Hl9EO8mQx4ZQ0FfL+k+k+t4wNlULpkO24IGnSzpQklzKPDRAMvZ1eXz9uXfH/Pvx5Ie44C5zYQXUgDPj6LEnMCQ3AFkjjupjGF9/kJmxPw1oiquz+6dalXcCRSmYxwK0kDSRI71azb3Y+6GiMi6P/5ey3F3YpExjxdQoG61uX8gBetkh2OWFkUIVGUT1pS9yosZNu1nkl8uZH+mikhxkx1wz7mkB0WkXsKJFw1ZuSWKotY9wjNJS6mUy41JK5P0c2qCnBgIeQWZvEK7Dnf6WUljTT5TS7d0KwezkJShdWIeGeuKKJo7FktUQylcl0i6RtL/HH4OjP+wB0UTLTGHfubRDWyi1g7SaoZQ495z9w7RpaHKqHEfLeklEyWzk+7dl3TTu1KQCpV7+pBB4IWstFFAgvOpJnTL6DoW0xPbw3k/nIYkW+kbmHeXhUEABklazrBDBdzTDfyuBo5DPq1eoUk7ZbSk70l6n3MZjUdCDpQvMF/rezn7/hX7Xs8wsj/7rsrWdQxnZtrwwENUosJkDDZxTjOUkEH1ds6lzJyDZzGScRsonGNcMCIG+WgRKTRQ8Su2p7uRi/mlKjZKekREChS2KIOcTvfqp3RZDlM+cxnfv8Thc75Pt8kqo92VzNTbxBqcQlceivAdByHDIxbvFTMOLovyHAGGK3qc/jJDoDc4hpjABzBm4UAglBFqEAOqt8mB29ss4uJnNCHfSK/tVZMYEfMykt7Bcco1eDLDHCT8gmzzRdLHZL6wRSgzg6GIgVl8Xj2uhPA+oQn53yTdK2mVMC8NzuJ8zaSyM/ApxyzWCFJRvUQ3eQ29BTNFcRgt+FTl2g30zDZZtD/ZRMifE5ES6Y9MxqAHQ7XZikI9nd97j5p1f83GZTPr6Crt2sOcOB1zTYT8HrqjVRZx4wbSAt47SXn/YsZV9zp4zuvJgNGQRaszmoN1rBY6IH4dHiVHcA5dZd2zeIbPv8ZBkghYTQFTx/h1WvSz6c3kM5ewGG8Prvxc5DZWS2u+dypnM5Y3sIJMXmbxfXW0misZN56oxITnWsyl2fg+6+C+zWTefMWr68RwaYF271htHBZqCsKqL28wB/ACjYShrE9nUjfWmEU33A7woqbR4k5UlNk4yoYOzOHvtGs30KO1QgnlZC2VohGOIGn7WEvW0ZdoMeCHfBgdo8X++m3V+s2wEHKzJMblJom92+ne2SHDwT1gknUispPpJLrrVZqwLxTmy5F5jOdVS72F/b6UwlbrcEytrD00+a8l/ZUM82jEZd8peu8uNYS8JxNWqis5IYqQCy1rPUULh8Y7fOYal3zzmPb6aJN7zlf+32bBV9ESclNE85WUX4j4oNbl/fM1b2eoxX3jyXNqiDTP4Xe8Rm9ItfSjvAr6DM0d+o5MXW/CuHO0a7eZTLYT3KF9LktYZ/WdCI+IkoV+lFZ6l3J9OF14HdM0F3MrhXxFjJmqhh5FBera24XqxaCqL0UosK97Z2ku+yJaEqf4D62ByoROcjZuN78Xaa9zTBSzKvxvC+vlrmgWVPU2h4j4FCO5lZ+vNBnpYHHfOOX/PfR83eApTaGM8CLop5l88WSLWAOu4AiNme5owcBO1xhlLGO/eGAFkyYqrtFe5zKzqU7KBE5o/BAIiv7VJSK7qV4GhEF1XtSk0YseWl6lWYI+cXj6pigJLkH3Vk0qfebxe4q0JGOGSDxCWn/Nchk9qJgMfGKS87LDes1IHeVW0LszgaC6sPMYE5lBt4CzRcuy4lVMLKlWfWwcJ+YpxtcGjtOYfzRjTgNIlv0rnpyCveeHNFSJ/jUlonH/3nNYqyOU28qYhHOLbzVPqFc81JQDKxnQ5twLdmjfmQzlxU6eoZ/mma3y8D3VonlhUr6bElhMwJ81RseSxW+jfOYULdYGAw5s4WBtpeU0ijKwxnp/HCfn70piCNlMFEUU8/WpmnZe1Bq80r96m5yMkIwx9nnNHTWFs114q0ArM1HsiUY7j5/rKFIThdrrzR7agHyoy9vd3Ag64uEfKa+xjIKlLqtTUBB7FWgJrQ9joFl1d2cQ2wzHaeDXa6/ztO9Wx+OT+FrzSAKuV12ptOZp+ljnaVawk8uxDpnMZXYCGB3PXqe5sl7QQ5ubhhQR9B4mQpvjIR+gJgrbOxV0rK/rVUyXmyRWdI2a2YLEhVP3BwmN9sJ9BtQpKkxiSDOrUeUhaeQaPevKzKQ3oIVTSGatcynoRl29sIkh440a8pURNoz00Ab4Ts1obxCps1FKl8k5IpKbcmsgu6nz6ETQC+iSqoKKOPmVJBmYnDjHX4EozB9s7TgwykkyYS13URAHpmstYIloOP/HEi6Wx5a4+DwSpH2V18tTyHUPm3iQeS1s09ai4/0ntVgNRQmzHTRulGwaQNnei3FgHqPcMBEJlXrNioAaE8AcupKBd7ElBu1uTxCzg+dmKB4TahiQNX/OxssAb00Uzdeci4S3FYhEQdfkWCrc1cI2K+2EDhsP1OUxZGUnOWTmcgphV0UgZ4jUR1hLlBiuJfqJpb61CXimOrq8RqiEeu6TU3iMwdzYgWhUnWHDDKr0ptLar6USqmOfYYiGMMTUN/KgziGVTo+pNJHBBfF0zVAQc6N2DUL+tcO2Yc1Rk2ss+yBmOko43yCSCljJXAWA7PD4eAt6MBy2yiNACRvVVN05t40pPLYPsT+zlRDpOLG/Jt8OSGKhmnBpivV7q/Y6JkucVgkyWKb52rVZwl0tvNDi+AzRvKjfK1Dnjvpd1FhPEc1LBVsbqENXN35cFaPY2BIVGdlWYZKqgPPj/RythNtpcNycpoOxwAae0bGwhAkAQg01cfiDWDRqZtHhCqFQ5FAtOXKXh/Yh6Ci2N5YMUDW2SHg/N3scn02N++cnMIZCBdwS9gtApRxqDc6OlzWtSrdc8cJGlzP5fzZDri1tQNixISWL/5fSQvcVzfe/wzXfSG8Kuw03pHB/t5KMik+EYJ1EC1d0zCw6fofqRI2ZJwpvyxN4uPs0q/6UR2szyESobxatf3aa7jvfrT0DGPNpYV3H3CI0BYLGllQdy7TX14rUP/zzDHpuRp0EPLnJvH68Qij/RXnyIyku5Ea+5S3NO7s01q77eMY1qqY8T7Qs+4qtq+o2UWhjZO6HuWhjJBlZXWbAHvbFSTAxqMW+RbuG3VfviAP36tshujINh6Tr3kE0BNMl5x8Qq6+mVTdwrMlzpRrGaGPzVpw9NDNFngjoFZZzRCS/FRPXHRZT31X2MgfYTQYX1WE1moaaQJfKEFTs/camkXnUwt9YtNWPiuc67VmRlb0yiRgS/cAe7is0QXuTAm9kikM2DNc5OkeGRaMU8tq0TJHbUCOtezMeRfITiSv1PLLbGE5gb/NOB/1AuR1KlLETDltidyR4XIPasyEnc6eIbRa9kfNifFeXJOAnVJBiKfFCvobcLKccLHWojHJpIPH3iXQlpoNLrdcH44sucvmQOHHjZ9rDrGdbixVmbk/XGy4mtiKuoQDjmQpFJLs6wuSZvqKmL0ky6zOZLry+420UKUaue5ooyeqy9+iopgM989cp1Dcp16bSU1tOJbyFyjedTID5wOk6OAUFFXUDKFRLkmBM3xH7fzIJwPLsxexDMWP2b8g38DqN45ywCuH0VNuv+XmjwOYCjtUakbg6AkGlNoQGBMB5A9g8hh2g7zFE2U4F35FxfHfmwwbxcz3Yl32C/oAwPwDAS6UXdpOhXPZ27Trc9R/SLTla0zzGoXl2QAexnLVZJB/CZMpV7HthfL4lJIrb54u+tdv3/rCiSbw+k88yM9ZxXgKwlHmZycq13iSr0KeMHmUZw6r1VICrLT4D5fy4wq/5DAvfjaWC9oAd9KxwTNUJynUjL+EqpwSTME1zOWMBuIxmZ7p9RCsNq+NmdxW09I1MdNkJeYZNHsIt0qKEO2Z4kvmHadS+Xqv2cqzc93rpuhdl54tg2DISuJljBW3uZjMHrAPqHOYK6zPIM23G2+14Rts4cyLbdxo3Y667UskOo/W/m/PwRhQBwZFkT2vXzDbTtLMZCyfP1155bbfDrpjKZoYH41bO+d97jmEgMPVxFMF0iHESIkiNtDhKuwV058cw0dBZNP+lFsSU/6VWf0E4P/x+IF2eJnokr4uW/2jAKPYjjRb7Cxef70c3qsCl0im1Gj/Uu2eF6sWo0rUiTQq7zS+pYjywnXYwcyOZfI4mKgHj9N2ttHqbRfSlQXhjw5XXy4S7ZbzOovkxVRsphHp8ia3HlyleZS1zHcvoVrdjuNFdEe7edGHzSbpSria/WZ3+cxYV5DCx/4w7FUfyfTW0WO+i7x2YrzKUXZFw/sut+OxJDGkHUxEZPwgCquQcIgxZR9oXekDQk8FF60bqwocupaIoEz6EmaC3C+0Ro6Wgp4eb2tpPJqN+4xXFXQ3TfUfCc5PDNnLZDpLIV1NADKyjZa87mHgmWX57bYdIfIY3pdCGf43xQUXI62kBn3fZxi4SPC8crIjDQ4yzFAaz/XcPJn7xf03VRzIB5Z7qCbBzPQi5jga2E9bCD+ELug8ficEZCk/Cmj8Ro3aLtLxDR1/QffhIHNRTUZCf+S5G7SJBp2b7G31B9+EjcVAFEInZQ2LU7jiN1zf4gu7DR+KwTvkfO9bGx6BNnEQ8XXmN5cT3fEH34SNxwN4A9dgknIEwyWNbeRTwV7WYHBVwFQfbwKb7vOUjiYAiKVT1PczXqCLD/n5UbuLcNxTKoCgExSFNmsFCHI6iJBQFnUbqqbWPHyFceDAOrC/oPpIN+FVaVLrNUa6dLPbvoEQdO4pd1OUylBVkCutsOkqosbNvwcE6qL6g+0hG3MY4ejots1pT3kE4P9QDdfuLKeDfHswD6gu6j2TF2yQcLoqEGurre9EdP1QTfmxJRdn0NlrvD+jmY69Egz+UQvxfgAEALJ4EcRDa/toAAAAASUVORK5CYII=\0" ;
pub const SAPI_OPTION_NO_CHDIR: u32 = 1;
pub const SAPI_POST_BLOCK_SIZE: u32 = 16384;
pub const SAPI_HEADER_ADD: u32 = 1;
pub const SAPI_HEADER_SENT_SUCCESSFULLY: u32 = 1;
pub const SAPI_HEADER_DO_SEND: u32 = 2;
pub const SAPI_HEADER_SEND_FAILED: u32 = 3;
pub const SAPI_DEFAULT_MIMETYPE: &[u8; 10] = b"text/html\0";
pub const SAPI_DEFAULT_CHARSET: &[u8; 6] = b"UTF-8\0";
pub const SAPI_PHP_VERSION_HEADER: &[u8; 24] = b"X-Powered-By: PHP/8.4.6\0";
pub const ZEND_FIBER_GUARD_PAGES: u32 = 1;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutex_t"][::std::mem::size_of::<_opaque_pthread_mutex_t>() - 64usize];
    ["Alignment of _opaque_pthread_mutex_t"]
        [::std::mem::align_of::<_opaque_pthread_mutex_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutex_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_mutex_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutex_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_mutex_t, __opaque) - 8usize];
};
impl Default for _opaque_pthread_mutex_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type pid_t = __darwin_pid_t;
pub type sigset_t = __darwin_sigset_t;
pub type uid_t = __darwin_uid_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigval {
    pub sival_int: ::std::os::raw::c_int,
    pub sival_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigval"][::std::mem::size_of::<sigval>() - 8usize];
    ["Alignment of sigval"][::std::mem::align_of::<sigval>() - 8usize];
    ["Offset of field: sigval::sival_int"][::std::mem::offset_of!(sigval, sival_int) - 0usize];
    ["Offset of field: sigval::sival_ptr"][::std::mem::offset_of!(sigval, sival_ptr) - 0usize];
};
impl Default for sigval {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __siginfo {
    pub si_signo: ::std::os::raw::c_int,
    pub si_errno: ::std::os::raw::c_int,
    pub si_code: ::std::os::raw::c_int,
    pub si_pid: pid_t,
    pub si_uid: uid_t,
    pub si_status: ::std::os::raw::c_int,
    pub si_addr: *mut ::std::os::raw::c_void,
    pub si_value: sigval,
    pub si_band: ::std::os::raw::c_long,
    pub __pad: [::std::os::raw::c_ulong; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __siginfo"][::std::mem::size_of::<__siginfo>() - 104usize];
    ["Alignment of __siginfo"][::std::mem::align_of::<__siginfo>() - 8usize];
    ["Offset of field: __siginfo::si_signo"][::std::mem::offset_of!(__siginfo, si_signo) - 0usize];
    ["Offset of field: __siginfo::si_errno"][::std::mem::offset_of!(__siginfo, si_errno) - 4usize];
    ["Offset of field: __siginfo::si_code"][::std::mem::offset_of!(__siginfo, si_code) - 8usize];
    ["Offset of field: __siginfo::si_pid"][::std::mem::offset_of!(__siginfo, si_pid) - 12usize];
    ["Offset of field: __siginfo::si_uid"][::std::mem::offset_of!(__siginfo, si_uid) - 16usize];
    ["Offset of field: __siginfo::si_status"]
        [::std::mem::offset_of!(__siginfo, si_status) - 20usize];
    ["Offset of field: __siginfo::si_addr"][::std::mem::offset_of!(__siginfo, si_addr) - 24usize];
    ["Offset of field: __siginfo::si_value"][::std::mem::offset_of!(__siginfo, si_value) - 32usize];
    ["Offset of field: __siginfo::si_band"][::std::mem::offset_of!(__siginfo, si_band) - 40usize];
    ["Offset of field: __siginfo::__pad"][::std::mem::offset_of!(__siginfo, __pad) - 48usize];
};
impl Default for __siginfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type siginfo_t = __siginfo;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __sigaction_u {
    pub __sa_handler: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
    pub __sa_sigaction: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: *mut __siginfo,
            arg3: *mut ::std::os::raw::c_void,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigaction_u"][::std::mem::size_of::<__sigaction_u>() - 8usize];
    ["Alignment of __sigaction_u"][::std::mem::align_of::<__sigaction_u>() - 8usize];
    ["Offset of field: __sigaction_u::__sa_handler"]
        [::std::mem::offset_of!(__sigaction_u, __sa_handler) - 0usize];
    ["Offset of field: __sigaction_u::__sa_sigaction"]
        [::std::mem::offset_of!(__sigaction_u, __sa_sigaction) - 0usize];
};
impl Default for __sigaction_u {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigaction {
    pub __sigaction_u: __sigaction_u,
    pub sa_mask: sigset_t,
    pub sa_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigaction"][::std::mem::size_of::<sigaction>() - 16usize];
    ["Alignment of sigaction"][::std::mem::align_of::<sigaction>() - 8usize];
    ["Offset of field: sigaction::__sigaction_u"]
        [::std::mem::offset_of!(sigaction, __sigaction_u) - 0usize];
    ["Offset of field: sigaction::sa_mask"][::std::mem::offset_of!(sigaction, sa_mask) - 8usize];
    ["Offset of field: sigaction::sa_flags"][::std::mem::offset_of!(sigaction, sa_flags) - 12usize];
};
impl Default for sigaction {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __darwin_time_t,
    pub tv_usec: __darwin_suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
pub type dev_t = __darwin_dev_t;
pub type mode_t = __darwin_mode_t;
pub type blkcnt_t = __darwin_blkcnt_t;
pub type blksize_t = __darwin_blksize_t;
pub type gid_t = __darwin_gid_t;
pub type nlink_t = __uint16_t;
pub type off_t = __darwin_off_t;
pub type time_t = __darwin_time_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __darwin_time_t,
    pub tv_nsec: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type tsrm_intptr_t = isize;
pub type tsrm_uintptr_t = usize;
pub type va_list = __darwin_va_list;
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::std::os::raw::c_uchar,
    pub _size: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sbuf"][::std::mem::size_of::<__sbuf>() - 16usize];
    ["Alignment of __sbuf"][::std::mem::align_of::<__sbuf>() - 8usize];
    ["Offset of field: __sbuf::_base"][::std::mem::offset_of!(__sbuf, _base) - 0usize];
    ["Offset of field: __sbuf::_size"][::std::mem::offset_of!(__sbuf, _size) - 8usize];
};
impl Default for __sbuf {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::std::os::raw::c_uchar,
    pub _r: ::std::os::raw::c_int,
    pub _w: ::std::os::raw::c_int,
    pub _flags: ::std::os::raw::c_short,
    pub _file: ::std::os::raw::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::std::os::raw::c_int,
    pub _cookie: *mut ::std::os::raw::c_void,
    pub _close: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
    pub _read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_char,
            arg3: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _seek: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: fpos_t,
            arg3: ::std::os::raw::c_int,
        ) -> fpos_t,
    >,
    pub _write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_char,
            arg3: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _ub: __sbuf,
    pub _extra: *mut __sFILEX,
    pub _ur: ::std::os::raw::c_int,
    pub _ubuf: [::std::os::raw::c_uchar; 3usize],
    pub _nbuf: [::std::os::raw::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::std::os::raw::c_int,
    pub _offset: fpos_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sFILE"][::std::mem::size_of::<__sFILE>() - 152usize];
    ["Alignment of __sFILE"][::std::mem::align_of::<__sFILE>() - 8usize];
    ["Offset of field: __sFILE::_p"][::std::mem::offset_of!(__sFILE, _p) - 0usize];
    ["Offset of field: __sFILE::_r"][::std::mem::offset_of!(__sFILE, _r) - 8usize];
    ["Offset of field: __sFILE::_w"][::std::mem::offset_of!(__sFILE, _w) - 12usize];
    ["Offset of field: __sFILE::_flags"][::std::mem::offset_of!(__sFILE, _flags) - 16usize];
    ["Offset of field: __sFILE::_file"][::std::mem::offset_of!(__sFILE, _file) - 18usize];
    ["Offset of field: __sFILE::_bf"][::std::mem::offset_of!(__sFILE, _bf) - 24usize];
    ["Offset of field: __sFILE::_lbfsize"][::std::mem::offset_of!(__sFILE, _lbfsize) - 40usize];
    ["Offset of field: __sFILE::_cookie"][::std::mem::offset_of!(__sFILE, _cookie) - 48usize];
    ["Offset of field: __sFILE::_close"][::std::mem::offset_of!(__sFILE, _close) - 56usize];
    ["Offset of field: __sFILE::_read"][::std::mem::offset_of!(__sFILE, _read) - 64usize];
    ["Offset of field: __sFILE::_seek"][::std::mem::offset_of!(__sFILE, _seek) - 72usize];
    ["Offset of field: __sFILE::_write"][::std::mem::offset_of!(__sFILE, _write) - 80usize];
    ["Offset of field: __sFILE::_ub"][::std::mem::offset_of!(__sFILE, _ub) - 88usize];
    ["Offset of field: __sFILE::_extra"][::std::mem::offset_of!(__sFILE, _extra) - 104usize];
    ["Offset of field: __sFILE::_ur"][::std::mem::offset_of!(__sFILE, _ur) - 112usize];
    ["Offset of field: __sFILE::_ubuf"][::std::mem::offset_of!(__sFILE, _ubuf) - 116usize];
    ["Offset of field: __sFILE::_nbuf"][::std::mem::offset_of!(__sFILE, _nbuf) - 119usize];
    ["Offset of field: __sFILE::_lb"][::std::mem::offset_of!(__sFILE, _lb) - 120usize];
    ["Offset of field: __sFILE::_blksize"][::std::mem::offset_of!(__sFILE, _blksize) - 136usize];
    ["Offset of field: __sFILE::_offset"][::std::mem::offset_of!(__sFILE, _offset) - 144usize];
};
impl Default for __sFILE {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type FILE = __sFILE;
pub type max_align_t = f64;
pub type zend_long = i64;
pub type zend_ulong = u64;
pub type zend_off_t = i64;
unsafe extern "C" {
    pub static long_min_digits: [::std::os::raw::c_char; 20usize];
}
pub type zend_max_align_t = max_align_t;
pub type zend_uchar = ::std::os::raw::c_uchar;
pub const ZEND_RESULT_CODE_SUCCESS: ZEND_RESULT_CODE = 0;
pub const ZEND_RESULT_CODE_FAILURE: ZEND_RESULT_CODE = -1;
pub type ZEND_RESULT_CODE = ::std::os::raw::c_int;
pub use self::ZEND_RESULT_CODE as zend_result;
pub type zend_object_handlers = _zend_object_handlers;
pub type zend_class_entry = _zend_class_entry;
pub type zend_function = _zend_function;
pub type zend_execute_data = _zend_execute_data;
pub type zval = _zval_struct;
pub type zend_refcounted = _zend_refcounted;
pub type zend_string = _zend_string;
pub type zend_array = _zend_array;
pub type zend_object = _zend_object;
pub type zend_resource = _zend_resource;
pub type zend_reference = _zend_reference;
pub type zend_ast_ref = _zend_ast_ref;
pub type zend_ast = _zend_ast;
pub type compare_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type swap_func_t = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: *mut ::std::os::raw::c_void),
>;
pub type sort_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
        arg4: compare_func_t,
        arg5: swap_func_t,
    ),
>;
pub type dtor_func_t = ::std::option::Option<unsafe extern "C" fn(pDest: *mut zval)>;
pub type copy_ctor_func_t = ::std::option::Option<unsafe extern "C" fn(pElement: *mut zval)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct zend_type {
    pub ptr: *mut ::std::os::raw::c_void,
    pub type_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of zend_type"][::std::mem::size_of::<zend_type>() - 16usize];
    ["Alignment of zend_type"][::std::mem::align_of::<zend_type>() - 8usize];
    ["Offset of field: zend_type::ptr"][::std::mem::offset_of!(zend_type, ptr) - 0usize];
    ["Offset of field: zend_type::type_mask"]
        [::std::mem::offset_of!(zend_type, type_mask) - 8usize];
};
impl Default for zend_type {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct zend_type_list {
    pub num_types: u32,
    pub types: [zend_type; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of zend_type_list"][::std::mem::size_of::<zend_type_list>() - 24usize];
    ["Alignment of zend_type_list"][::std::mem::align_of::<zend_type_list>() - 8usize];
    ["Offset of field: zend_type_list::num_types"]
        [::std::mem::offset_of!(zend_type_list, num_types) - 0usize];
    ["Offset of field: zend_type_list::types"]
        [::std::mem::offset_of!(zend_type_list, types) - 8usize];
};
impl Default for zend_type_list {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_value {
    pub lval: zend_long,
    pub dval: f64,
    pub counted: *mut zend_refcounted,
    pub str_: *mut zend_string,
    pub arr: *mut zend_array,
    pub obj: *mut zend_object,
    pub res: *mut zend_resource,
    pub ref_: *mut zend_reference,
    pub ast: *mut zend_ast_ref,
    pub zv: *mut zval,
    pub ptr: *mut ::std::os::raw::c_void,
    pub ce: *mut zend_class_entry,
    pub func: *mut zend_function,
    pub ww: _zend_value__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _zend_value__bindgen_ty_1 {
    pub w1: u32,
    pub w2: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_value__bindgen_ty_1"]
        [::std::mem::size_of::<_zend_value__bindgen_ty_1>() - 8usize];
    ["Alignment of _zend_value__bindgen_ty_1"]
        [::std::mem::align_of::<_zend_value__bindgen_ty_1>() - 4usize];
    ["Offset of field: _zend_value__bindgen_ty_1::w1"]
        [::std::mem::offset_of!(_zend_value__bindgen_ty_1, w1) - 0usize];
    ["Offset of field: _zend_value__bindgen_ty_1::w2"]
        [::std::mem::offset_of!(_zend_value__bindgen_ty_1, w2) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_value"][::std::mem::size_of::<_zend_value>() - 8usize];
    ["Alignment of _zend_value"][::std::mem::align_of::<_zend_value>() - 8usize];
    ["Offset of field: _zend_value::lval"][::std::mem::offset_of!(_zend_value, lval) - 0usize];
    ["Offset of field: _zend_value::dval"][::std::mem::offset_of!(_zend_value, dval) - 0usize];
    ["Offset of field: _zend_value::counted"]
        [::std::mem::offset_of!(_zend_value, counted) - 0usize];
    ["Offset of field: _zend_value::str_"][::std::mem::offset_of!(_zend_value, str_) - 0usize];
    ["Offset of field: _zend_value::arr"][::std::mem::offset_of!(_zend_value, arr) - 0usize];
    ["Offset of field: _zend_value::obj"][::std::mem::offset_of!(_zend_value, obj) - 0usize];
    ["Offset of field: _zend_value::res"][::std::mem::offset_of!(_zend_value, res) - 0usize];
    ["Offset of field: _zend_value::ref_"][::std::mem::offset_of!(_zend_value, ref_) - 0usize];
    ["Offset of field: _zend_value::ast"][::std::mem::offset_of!(_zend_value, ast) - 0usize];
    ["Offset of field: _zend_value::zv"][::std::mem::offset_of!(_zend_value, zv) - 0usize];
    ["Offset of field: _zend_value::ptr"][::std::mem::offset_of!(_zend_value, ptr) - 0usize];
    ["Offset of field: _zend_value::ce"][::std::mem::offset_of!(_zend_value, ce) - 0usize];
    ["Offset of field: _zend_value::func"][::std::mem::offset_of!(_zend_value, func) - 0usize];
    ["Offset of field: _zend_value::ww"][::std::mem::offset_of!(_zend_value, ww) - 0usize];
};
impl Default for _zend_value {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_value = _zend_value;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zval_struct {
    pub value: zend_value,
    pub u1: _zval_struct__bindgen_ty_1,
    pub u2: _zval_struct__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zval_struct__bindgen_ty_1 {
    pub type_info: u32,
    pub v: _zval_struct__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zval_struct__bindgen_ty_1__bindgen_ty_1 {
    pub type_: u8,
    pub type_flags: u8,
    pub u: _zval_struct__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zval_struct__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub extra: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zval_struct__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<_zval_struct__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Alignment of _zval_struct__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<_zval_struct__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Offset of field: _zval_struct__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::extra"][::std::mem::offset_of!(
        _zval_struct__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        extra
    ) - 0usize];
};
impl Default for _zval_struct__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zval_struct__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<_zval_struct__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of _zval_struct__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<_zval_struct__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Offset of field: _zval_struct__bindgen_ty_1__bindgen_ty_1::type_"]
        [::std::mem::offset_of!(_zval_struct__bindgen_ty_1__bindgen_ty_1, type_) - 0usize];
    ["Offset of field: _zval_struct__bindgen_ty_1__bindgen_ty_1::type_flags"]
        [::std::mem::offset_of!(_zval_struct__bindgen_ty_1__bindgen_ty_1, type_flags) - 1usize];
    ["Offset of field: _zval_struct__bindgen_ty_1__bindgen_ty_1::u"]
        [::std::mem::offset_of!(_zval_struct__bindgen_ty_1__bindgen_ty_1, u) - 2usize];
};
impl Default for _zval_struct__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zval_struct__bindgen_ty_1"]
        [::std::mem::size_of::<_zval_struct__bindgen_ty_1>() - 4usize];
    ["Alignment of _zval_struct__bindgen_ty_1"]
        [::std::mem::align_of::<_zval_struct__bindgen_ty_1>() - 4usize];
    ["Offset of field: _zval_struct__bindgen_ty_1::type_info"]
        [::std::mem::offset_of!(_zval_struct__bindgen_ty_1, type_info) - 0usize];
    ["Offset of field: _zval_struct__bindgen_ty_1::v"]
        [::std::mem::offset_of!(_zval_struct__bindgen_ty_1, v) - 0usize];
};
impl Default for _zval_struct__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zval_struct__bindgen_ty_2 {
    pub next: u32,
    pub cache_slot: u32,
    pub opline_num: u32,
    pub lineno: u32,
    pub num_args: u32,
    pub fe_pos: u32,
    pub fe_iter_idx: u32,
    pub guard: u32,
    pub constant_flags: u32,
    pub extra: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zval_struct__bindgen_ty_2"]
        [::std::mem::size_of::<_zval_struct__bindgen_ty_2>() - 4usize];
    ["Alignment of _zval_struct__bindgen_ty_2"]
        [::std::mem::align_of::<_zval_struct__bindgen_ty_2>() - 4usize];
    ["Offset of field: _zval_struct__bindgen_ty_2::next"]
        [::std::mem::offset_of!(_zval_struct__bindgen_ty_2, next) - 0usize];
    ["Offset of field: _zval_struct__bindgen_ty_2::cache_slot"]
        [::std::mem::offset_of!(_zval_struct__bindgen_ty_2, cache_slot) - 0usize];
    ["Offset of field: _zval_struct__bindgen_ty_2::opline_num"]
        [::std::mem::offset_of!(_zval_struct__bindgen_ty_2, opline_num) - 0usize];
    ["Offset of field: _zval_struct__bindgen_ty_2::lineno"]
        [::std::mem::offset_of!(_zval_struct__bindgen_ty_2, lineno) - 0usize];
    ["Offset of field: _zval_struct__bindgen_ty_2::num_args"]
        [::std::mem::offset_of!(_zval_struct__bindgen_ty_2, num_args) - 0usize];
    ["Offset of field: _zval_struct__bindgen_ty_2::fe_pos"]
        [::std::mem::offset_of!(_zval_struct__bindgen_ty_2, fe_pos) - 0usize];
    ["Offset of field: _zval_struct__bindgen_ty_2::fe_iter_idx"]
        [::std::mem::offset_of!(_zval_struct__bindgen_ty_2, fe_iter_idx) - 0usize];
    ["Offset of field: _zval_struct__bindgen_ty_2::guard"]
        [::std::mem::offset_of!(_zval_struct__bindgen_ty_2, guard) - 0usize];
    ["Offset of field: _zval_struct__bindgen_ty_2::constant_flags"]
        [::std::mem::offset_of!(_zval_struct__bindgen_ty_2, constant_flags) - 0usize];
    ["Offset of field: _zval_struct__bindgen_ty_2::extra"]
        [::std::mem::offset_of!(_zval_struct__bindgen_ty_2, extra) - 0usize];
};
impl Default for _zval_struct__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zval_struct"][::std::mem::size_of::<_zval_struct>() - 16usize];
    ["Alignment of _zval_struct"][::std::mem::align_of::<_zval_struct>() - 8usize];
    ["Offset of field: _zval_struct::value"][::std::mem::offset_of!(_zval_struct, value) - 0usize];
    ["Offset of field: _zval_struct::u1"][::std::mem::offset_of!(_zval_struct, u1) - 8usize];
    ["Offset of field: _zval_struct::u2"][::std::mem::offset_of!(_zval_struct, u2) - 12usize];
};
impl Default for _zval_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_refcounted_h {
    pub refcount: u32,
    pub u: _zend_refcounted_h__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_refcounted_h__bindgen_ty_1 {
    pub type_info: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_refcounted_h__bindgen_ty_1"]
        [::std::mem::size_of::<_zend_refcounted_h__bindgen_ty_1>() - 4usize];
    ["Alignment of _zend_refcounted_h__bindgen_ty_1"]
        [::std::mem::align_of::<_zend_refcounted_h__bindgen_ty_1>() - 4usize];
    ["Offset of field: _zend_refcounted_h__bindgen_ty_1::type_info"]
        [::std::mem::offset_of!(_zend_refcounted_h__bindgen_ty_1, type_info) - 0usize];
};
impl Default for _zend_refcounted_h__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_refcounted_h"][::std::mem::size_of::<_zend_refcounted_h>() - 8usize];
    ["Alignment of _zend_refcounted_h"][::std::mem::align_of::<_zend_refcounted_h>() - 4usize];
    ["Offset of field: _zend_refcounted_h::refcount"]
        [::std::mem::offset_of!(_zend_refcounted_h, refcount) - 0usize];
    ["Offset of field: _zend_refcounted_h::u"]
        [::std::mem::offset_of!(_zend_refcounted_h, u) - 4usize];
};
impl Default for _zend_refcounted_h {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_refcounted_h = _zend_refcounted_h;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_refcounted {
    pub gc: zend_refcounted_h,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_refcounted"][::std::mem::size_of::<_zend_refcounted>() - 8usize];
    ["Alignment of _zend_refcounted"][::std::mem::align_of::<_zend_refcounted>() - 4usize];
    ["Offset of field: _zend_refcounted::gc"]
        [::std::mem::offset_of!(_zend_refcounted, gc) - 0usize];
};
impl Default for _zend_refcounted {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_string {
    pub gc: zend_refcounted_h,
    pub h: zend_ulong,
    pub len: usize,
    pub val: [::std::os::raw::c_char; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_string"][::std::mem::size_of::<_zend_string>() - 32usize];
    ["Alignment of _zend_string"][::std::mem::align_of::<_zend_string>() - 8usize];
    ["Offset of field: _zend_string::gc"][::std::mem::offset_of!(_zend_string, gc) - 0usize];
    ["Offset of field: _zend_string::h"][::std::mem::offset_of!(_zend_string, h) - 8usize];
    ["Offset of field: _zend_string::len"][::std::mem::offset_of!(_zend_string, len) - 16usize];
    ["Offset of field: _zend_string::val"][::std::mem::offset_of!(_zend_string, val) - 24usize];
};
impl Default for _zend_string {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _Bucket {
    pub val: zval,
    pub h: zend_ulong,
    pub key: *mut zend_string,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _Bucket"][::std::mem::size_of::<_Bucket>() - 32usize];
    ["Alignment of _Bucket"][::std::mem::align_of::<_Bucket>() - 8usize];
    ["Offset of field: _Bucket::val"][::std::mem::offset_of!(_Bucket, val) - 0usize];
    ["Offset of field: _Bucket::h"][::std::mem::offset_of!(_Bucket, h) - 16usize];
    ["Offset of field: _Bucket::key"][::std::mem::offset_of!(_Bucket, key) - 24usize];
};
impl Default for _Bucket {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type Bucket = _Bucket;
pub type HashTable = _zend_array;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_array {
    pub gc: zend_refcounted_h,
    pub u: _zend_array__bindgen_ty_1,
    pub nTableMask: u32,
    pub __bindgen_anon_1: _zend_array__bindgen_ty_2,
    pub nNumUsed: u32,
    pub nNumOfElements: u32,
    pub nTableSize: u32,
    pub nInternalPointer: u32,
    pub nNextFreeElement: zend_long,
    pub pDestructor: dtor_func_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_array__bindgen_ty_1 {
    pub v: _zend_array__bindgen_ty_1__bindgen_ty_1,
    pub flags: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _zend_array__bindgen_ty_1__bindgen_ty_1 {
    pub flags: u8,
    pub _unused: u8,
    pub nIteratorsCount: u8,
    pub _unused2: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_array__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<_zend_array__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of _zend_array__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<_zend_array__bindgen_ty_1__bindgen_ty_1>() - 1usize];
    ["Offset of field: _zend_array__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(_zend_array__bindgen_ty_1__bindgen_ty_1, flags) - 0usize];
    ["Offset of field: _zend_array__bindgen_ty_1__bindgen_ty_1::_unused"]
        [::std::mem::offset_of!(_zend_array__bindgen_ty_1__bindgen_ty_1, _unused) - 1usize];
    ["Offset of field: _zend_array__bindgen_ty_1__bindgen_ty_1::nIteratorsCount"]
        [::std::mem::offset_of!(_zend_array__bindgen_ty_1__bindgen_ty_1, nIteratorsCount) - 2usize];
    ["Offset of field: _zend_array__bindgen_ty_1__bindgen_ty_1::_unused2"]
        [::std::mem::offset_of!(_zend_array__bindgen_ty_1__bindgen_ty_1, _unused2) - 3usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_array__bindgen_ty_1"]
        [::std::mem::size_of::<_zend_array__bindgen_ty_1>() - 4usize];
    ["Alignment of _zend_array__bindgen_ty_1"]
        [::std::mem::align_of::<_zend_array__bindgen_ty_1>() - 4usize];
    ["Offset of field: _zend_array__bindgen_ty_1::v"]
        [::std::mem::offset_of!(_zend_array__bindgen_ty_1, v) - 0usize];
    ["Offset of field: _zend_array__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(_zend_array__bindgen_ty_1, flags) - 0usize];
};
impl Default for _zend_array__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_array__bindgen_ty_2 {
    pub arHash: *mut u32,
    pub arData: *mut Bucket,
    pub arPacked: *mut zval,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_array__bindgen_ty_2"]
        [::std::mem::size_of::<_zend_array__bindgen_ty_2>() - 8usize];
    ["Alignment of _zend_array__bindgen_ty_2"]
        [::std::mem::align_of::<_zend_array__bindgen_ty_2>() - 8usize];
    ["Offset of field: _zend_array__bindgen_ty_2::arHash"]
        [::std::mem::offset_of!(_zend_array__bindgen_ty_2, arHash) - 0usize];
    ["Offset of field: _zend_array__bindgen_ty_2::arData"]
        [::std::mem::offset_of!(_zend_array__bindgen_ty_2, arData) - 0usize];
    ["Offset of field: _zend_array__bindgen_ty_2::arPacked"]
        [::std::mem::offset_of!(_zend_array__bindgen_ty_2, arPacked) - 0usize];
};
impl Default for _zend_array__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_array"][::std::mem::size_of::<_zend_array>() - 56usize];
    ["Alignment of _zend_array"][::std::mem::align_of::<_zend_array>() - 8usize];
    ["Offset of field: _zend_array::gc"][::std::mem::offset_of!(_zend_array, gc) - 0usize];
    ["Offset of field: _zend_array::u"][::std::mem::offset_of!(_zend_array, u) - 8usize];
    ["Offset of field: _zend_array::nTableMask"]
        [::std::mem::offset_of!(_zend_array, nTableMask) - 12usize];
    ["Offset of field: _zend_array::nNumUsed"]
        [::std::mem::offset_of!(_zend_array, nNumUsed) - 24usize];
    ["Offset of field: _zend_array::nNumOfElements"]
        [::std::mem::offset_of!(_zend_array, nNumOfElements) - 28usize];
    ["Offset of field: _zend_array::nTableSize"]
        [::std::mem::offset_of!(_zend_array, nTableSize) - 32usize];
    ["Offset of field: _zend_array::nInternalPointer"]
        [::std::mem::offset_of!(_zend_array, nInternalPointer) - 36usize];
    ["Offset of field: _zend_array::nNextFreeElement"]
        [::std::mem::offset_of!(_zend_array, nNextFreeElement) - 40usize];
    ["Offset of field: _zend_array::pDestructor"]
        [::std::mem::offset_of!(_zend_array, pDestructor) - 48usize];
};
impl Default for _zend_array {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type HashPosition = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _HashTableIterator {
    pub ht: *mut HashTable,
    pub pos: HashPosition,
    pub next_copy: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _HashTableIterator"][::std::mem::size_of::<_HashTableIterator>() - 16usize];
    ["Alignment of _HashTableIterator"][::std::mem::align_of::<_HashTableIterator>() - 8usize];
    ["Offset of field: _HashTableIterator::ht"]
        [::std::mem::offset_of!(_HashTableIterator, ht) - 0usize];
    ["Offset of field: _HashTableIterator::pos"]
        [::std::mem::offset_of!(_HashTableIterator, pos) - 8usize];
    ["Offset of field: _HashTableIterator::next_copy"]
        [::std::mem::offset_of!(_HashTableIterator, next_copy) - 12usize];
};
impl Default for _HashTableIterator {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type HashTableIterator = _HashTableIterator;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_object {
    pub gc: zend_refcounted_h,
    pub handle: u32,
    pub extra_flags: u32,
    pub ce: *mut zend_class_entry,
    pub handlers: *const zend_object_handlers,
    pub properties: *mut HashTable,
    pub properties_table: [zval; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_object"][::std::mem::size_of::<_zend_object>() - 56usize];
    ["Alignment of _zend_object"][::std::mem::align_of::<_zend_object>() - 8usize];
    ["Offset of field: _zend_object::gc"][::std::mem::offset_of!(_zend_object, gc) - 0usize];
    ["Offset of field: _zend_object::handle"]
        [::std::mem::offset_of!(_zend_object, handle) - 8usize];
    ["Offset of field: _zend_object::extra_flags"]
        [::std::mem::offset_of!(_zend_object, extra_flags) - 12usize];
    ["Offset of field: _zend_object::ce"][::std::mem::offset_of!(_zend_object, ce) - 16usize];
    ["Offset of field: _zend_object::handlers"]
        [::std::mem::offset_of!(_zend_object, handlers) - 24usize];
    ["Offset of field: _zend_object::properties"]
        [::std::mem::offset_of!(_zend_object, properties) - 32usize];
    ["Offset of field: _zend_object::properties_table"]
        [::std::mem::offset_of!(_zend_object, properties_table) - 40usize];
};
impl Default for _zend_object {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_resource {
    pub gc: zend_refcounted_h,
    pub handle: zend_long,
    pub type_: ::std::os::raw::c_int,
    pub ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_resource"][::std::mem::size_of::<_zend_resource>() - 32usize];
    ["Alignment of _zend_resource"][::std::mem::align_of::<_zend_resource>() - 8usize];
    ["Offset of field: _zend_resource::gc"][::std::mem::offset_of!(_zend_resource, gc) - 0usize];
    ["Offset of field: _zend_resource::handle"]
        [::std::mem::offset_of!(_zend_resource, handle) - 8usize];
    ["Offset of field: _zend_resource::type_"]
        [::std::mem::offset_of!(_zend_resource, type_) - 16usize];
    ["Offset of field: _zend_resource::ptr"][::std::mem::offset_of!(_zend_resource, ptr) - 24usize];
};
impl Default for _zend_resource {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct zend_property_info_list {
    pub num: usize,
    pub num_allocated: usize,
    pub ptr: [*mut _zend_property_info; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of zend_property_info_list"][::std::mem::size_of::<zend_property_info_list>() - 24usize];
    ["Alignment of zend_property_info_list"]
        [::std::mem::align_of::<zend_property_info_list>() - 8usize];
    ["Offset of field: zend_property_info_list::num"]
        [::std::mem::offset_of!(zend_property_info_list, num) - 0usize];
    ["Offset of field: zend_property_info_list::num_allocated"]
        [::std::mem::offset_of!(zend_property_info_list, num_allocated) - 8usize];
    ["Offset of field: zend_property_info_list::ptr"]
        [::std::mem::offset_of!(zend_property_info_list, ptr) - 16usize];
};
impl Default for zend_property_info_list {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union zend_property_info_source_list {
    pub ptr: *mut _zend_property_info,
    pub list: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of zend_property_info_source_list"]
        [::std::mem::size_of::<zend_property_info_source_list>() - 8usize];
    ["Alignment of zend_property_info_source_list"]
        [::std::mem::align_of::<zend_property_info_source_list>() - 8usize];
    ["Offset of field: zend_property_info_source_list::ptr"]
        [::std::mem::offset_of!(zend_property_info_source_list, ptr) - 0usize];
    ["Offset of field: zend_property_info_source_list::list"]
        [::std::mem::offset_of!(zend_property_info_source_list, list) - 0usize];
};
impl Default for zend_property_info_source_list {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_reference {
    pub gc: zend_refcounted_h,
    pub val: zval,
    pub sources: zend_property_info_source_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_reference"][::std::mem::size_of::<_zend_reference>() - 32usize];
    ["Alignment of _zend_reference"][::std::mem::align_of::<_zend_reference>() - 8usize];
    ["Offset of field: _zend_reference::gc"][::std::mem::offset_of!(_zend_reference, gc) - 0usize];
    ["Offset of field: _zend_reference::val"]
        [::std::mem::offset_of!(_zend_reference, val) - 8usize];
    ["Offset of field: _zend_reference::sources"]
        [::std::mem::offset_of!(_zend_reference, sources) - 24usize];
};
impl Default for _zend_reference {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_ast_ref {
    pub gc: zend_refcounted_h,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_ast_ref"][::std::mem::size_of::<_zend_ast_ref>() - 8usize];
    ["Alignment of _zend_ast_ref"][::std::mem::align_of::<_zend_ast_ref>() - 4usize];
    ["Offset of field: _zend_ast_ref::gc"][::std::mem::offset_of!(_zend_ast_ref, gc) - 0usize];
};
impl Default for _zend_ast_ref {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn zend_map_ptr_reset();
}
unsafe extern "C" {
    pub fn zend_map_ptr_new() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn zend_map_ptr_new_static() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn zend_map_ptr_extend(last: usize);
}
unsafe extern "C" {
    pub fn zend_alloc_ce_cache(type_name: *mut zend_string);
}
unsafe extern "C" {
    pub static mut zend_map_ptr_static_last: usize;
}
unsafe extern "C" {
    pub static mut zend_map_ptr_static_size: usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_leak_info {
    pub addr: *mut ::std::os::raw::c_void,
    pub size: usize,
    pub filename: *const ::std::os::raw::c_char,
    pub orig_filename: *const ::std::os::raw::c_char,
    pub lineno: u32,
    pub orig_lineno: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_leak_info"][::std::mem::size_of::<_zend_leak_info>() - 40usize];
    ["Alignment of _zend_leak_info"][::std::mem::align_of::<_zend_leak_info>() - 8usize];
    ["Offset of field: _zend_leak_info::addr"]
        [::std::mem::offset_of!(_zend_leak_info, addr) - 0usize];
    ["Offset of field: _zend_leak_info::size"]
        [::std::mem::offset_of!(_zend_leak_info, size) - 8usize];
    ["Offset of field: _zend_leak_info::filename"]
        [::std::mem::offset_of!(_zend_leak_info, filename) - 16usize];
    ["Offset of field: _zend_leak_info::orig_filename"]
        [::std::mem::offset_of!(_zend_leak_info, orig_filename) - 24usize];
    ["Offset of field: _zend_leak_info::lineno"]
        [::std::mem::offset_of!(_zend_leak_info, lineno) - 32usize];
    ["Offset of field: _zend_leak_info::orig_lineno"]
        [::std::mem::offset_of!(_zend_leak_info, orig_lineno) - 36usize];
};
impl Default for _zend_leak_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_leak_info = _zend_leak_info;
unsafe extern "C" {
    pub fn zend_strndup(
        s: *const ::std::os::raw::c_char,
        length: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _emalloc(size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _safe_emalloc(nmemb: usize, size: usize, offset: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _safe_malloc(nmemb: usize, size: usize, offset: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _efree(ptr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _ecalloc(nmemb: usize, size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _erealloc(ptr: *mut ::std::os::raw::c_void, size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _erealloc2(
        ptr: *mut ::std::os::raw::c_void,
        size: usize,
        copy_size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _safe_erealloc(
        ptr: *mut ::std::os::raw::c_void,
        nmemb: usize,
        size: usize,
        offset: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _safe_realloc(
        ptr: *mut ::std::os::raw::c_void,
        nmemb: usize,
        size: usize,
        offset: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _estrdup(s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _estrndup(
        s: *const ::std::os::raw::c_char,
        length: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _zend_mem_block_size(ptr: *mut ::std::os::raw::c_void) -> usize;
}
unsafe extern "C" {
    pub fn _emalloc_8() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_16() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_24() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_32() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_40() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_48() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_56() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_64() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_80() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_96() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_112() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_128() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_160() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_192() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_224() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_256() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_320() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_384() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_448() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_512() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_640() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_768() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_896() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_1024() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_1280() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_1536() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_1792() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_2048() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_2560() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_3072() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_large(size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _emalloc_huge(size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _efree_8(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_16(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_24(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_32(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_40(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_48(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_56(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_64(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_80(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_96(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_112(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_128(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_160(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_192(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_224(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_256(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_320(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_384(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_448(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_512(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_640(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_768(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_896(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_1024(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_1280(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_1536(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_1792(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_2048(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_2560(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_3072(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _efree_large(arg1: *mut ::std::os::raw::c_void, size: usize);
}
unsafe extern "C" {
    pub fn _efree_huge(arg1: *mut ::std::os::raw::c_void, size: usize);
}
unsafe extern "C" {
    pub fn __zend_malloc(len: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn __zend_calloc(nmemb: usize, len: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn __zend_realloc(
        p: *mut ::std::os::raw::c_void,
        len: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn __zend_free(p: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn __zend_strdup(s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn zend_set_memory_limit(memory_limit: usize) -> zend_result;
}
unsafe extern "C" {
    pub fn zend_alloc_in_memory_limit_error_reporting() -> bool;
}
unsafe extern "C" {
    pub fn start_memory_manager();
}
unsafe extern "C" {
    pub fn shutdown_memory_manager(silent: bool, full_shutdown: bool);
}
unsafe extern "C" {
    pub fn is_zend_mm() -> bool;
}
unsafe extern "C" {
    pub fn is_zend_ptr(ptr: *const ::std::os::raw::c_void) -> bool;
}
unsafe extern "C" {
    pub fn zend_memory_usage(real_usage: bool) -> usize;
}
unsafe extern "C" {
    pub fn zend_memory_peak_usage(real_usage: bool) -> usize;
}
unsafe extern "C" {
    pub fn zend_memory_reset_peak_usage();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_mm_heap {
    _unused: [u8; 0],
}
pub type zend_mm_heap = _zend_mm_heap;
unsafe extern "C" {
    pub fn zend_mm_startup() -> *mut zend_mm_heap;
}
unsafe extern "C" {
    pub fn zend_mm_shutdown(heap: *mut zend_mm_heap, full_shutdown: bool, silent: bool);
}
unsafe extern "C" {
    pub fn _zend_mm_alloc(heap: *mut zend_mm_heap, size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _zend_mm_free(heap: *mut zend_mm_heap, p: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _zend_mm_realloc(
        heap: *mut zend_mm_heap,
        p: *mut ::std::os::raw::c_void,
        size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _zend_mm_realloc2(
        heap: *mut zend_mm_heap,
        p: *mut ::std::os::raw::c_void,
        size: usize,
        copy_size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _zend_mm_block_size(heap: *mut zend_mm_heap, p: *mut ::std::os::raw::c_void) -> usize;
}
unsafe extern "C" {
    pub fn zend_mm_set_heap(new_heap: *mut zend_mm_heap) -> *mut zend_mm_heap;
}
unsafe extern "C" {
    pub fn zend_mm_get_heap() -> *mut zend_mm_heap;
}
unsafe extern "C" {
    pub fn zend_mm_gc(heap: *mut zend_mm_heap) -> usize;
}
unsafe extern "C" {
    pub fn zend_mm_is_custom_heap(new_heap: *mut zend_mm_heap) -> bool;
}
unsafe extern "C" {
    pub fn zend_mm_set_custom_handlers(
        heap: *mut zend_mm_heap,
        _malloc: ::std::option::Option<
            unsafe extern "C" fn(arg1: usize) -> *mut ::std::os::raw::c_void,
        >,
        _free: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
        _realloc: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: usize,
            ) -> *mut ::std::os::raw::c_void,
        >,
    );
}
unsafe extern "C" {
    pub fn zend_mm_set_custom_handlers_ex(
        heap: *mut zend_mm_heap,
        _malloc: ::std::option::Option<
            unsafe extern "C" fn(arg1: usize) -> *mut ::std::os::raw::c_void,
        >,
        _free: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
        _realloc: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: usize,
            ) -> *mut ::std::os::raw::c_void,
        >,
        _gc: ::std::option::Option<unsafe extern "C" fn() -> usize>,
        _shutdown: ::std::option::Option<unsafe extern "C" fn(arg1: bool, arg2: bool)>,
    );
}
unsafe extern "C" {
    pub fn zend_mm_get_custom_handlers(
        heap: *mut zend_mm_heap,
        _malloc: *mut ::std::option::Option<
            unsafe extern "C" fn(arg1: usize) -> *mut ::std::os::raw::c_void,
        >,
        _free: *mut ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
        _realloc: *mut ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: usize,
            ) -> *mut ::std::os::raw::c_void,
        >,
    );
}
unsafe extern "C" {
    pub fn zend_mm_get_custom_handlers_ex(
        heap: *mut zend_mm_heap,
        _malloc: *mut ::std::option::Option<
            unsafe extern "C" fn(arg1: usize) -> *mut ::std::os::raw::c_void,
        >,
        _free: *mut ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
        _realloc: *mut ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: usize,
            ) -> *mut ::std::os::raw::c_void,
        >,
        _gc: *mut ::std::option::Option<unsafe extern "C" fn() -> usize>,
        _shutdown: *mut ::std::option::Option<unsafe extern "C" fn(arg1: bool, arg2: bool)>,
    );
}
pub type zend_mm_storage = _zend_mm_storage;
pub type zend_mm_chunk_alloc_t = ::std::option::Option<
    unsafe extern "C" fn(
        storage: *mut zend_mm_storage,
        size: usize,
        alignment: usize,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type zend_mm_chunk_free_t = ::std::option::Option<
    unsafe extern "C" fn(
        storage: *mut zend_mm_storage,
        chunk: *mut ::std::os::raw::c_void,
        size: usize,
    ),
>;
pub type zend_mm_chunk_truncate_t = ::std::option::Option<
    unsafe extern "C" fn(
        storage: *mut zend_mm_storage,
        chunk: *mut ::std::os::raw::c_void,
        old_size: usize,
        new_size: usize,
    ) -> bool,
>;
pub type zend_mm_chunk_extend_t = ::std::option::Option<
    unsafe extern "C" fn(
        storage: *mut zend_mm_storage,
        chunk: *mut ::std::os::raw::c_void,
        old_size: usize,
        new_size: usize,
    ) -> bool,
>;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _zend_mm_handlers {
    pub chunk_alloc: zend_mm_chunk_alloc_t,
    pub chunk_free: zend_mm_chunk_free_t,
    pub chunk_truncate: zend_mm_chunk_truncate_t,
    pub chunk_extend: zend_mm_chunk_extend_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_mm_handlers"][::std::mem::size_of::<_zend_mm_handlers>() - 32usize];
    ["Alignment of _zend_mm_handlers"][::std::mem::align_of::<_zend_mm_handlers>() - 8usize];
    ["Offset of field: _zend_mm_handlers::chunk_alloc"]
        [::std::mem::offset_of!(_zend_mm_handlers, chunk_alloc) - 0usize];
    ["Offset of field: _zend_mm_handlers::chunk_free"]
        [::std::mem::offset_of!(_zend_mm_handlers, chunk_free) - 8usize];
    ["Offset of field: _zend_mm_handlers::chunk_truncate"]
        [::std::mem::offset_of!(_zend_mm_handlers, chunk_truncate) - 16usize];
    ["Offset of field: _zend_mm_handlers::chunk_extend"]
        [::std::mem::offset_of!(_zend_mm_handlers, chunk_extend) - 24usize];
};
pub type zend_mm_handlers = _zend_mm_handlers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_mm_storage {
    pub handlers: zend_mm_handlers,
    pub data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_mm_storage"][::std::mem::size_of::<_zend_mm_storage>() - 40usize];
    ["Alignment of _zend_mm_storage"][::std::mem::align_of::<_zend_mm_storage>() - 8usize];
    ["Offset of field: _zend_mm_storage::handlers"]
        [::std::mem::offset_of!(_zend_mm_storage, handlers) - 0usize];
    ["Offset of field: _zend_mm_storage::data"]
        [::std::mem::offset_of!(_zend_mm_storage, data) - 32usize];
};
impl Default for _zend_mm_storage {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn zend_mm_get_storage(heap: *mut zend_mm_heap) -> *mut zend_mm_storage;
}
unsafe extern "C" {
    pub fn zend_mm_startup_ex(
        handlers: *const zend_mm_handlers,
        data: *mut ::std::os::raw::c_void,
        data_size: usize,
    ) -> *mut zend_mm_heap;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_llist_element {
    pub next: *mut _zend_llist_element,
    pub prev: *mut _zend_llist_element,
    pub data: [::std::os::raw::c_char; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_llist_element"][::std::mem::size_of::<_zend_llist_element>() - 24usize];
    ["Alignment of _zend_llist_element"][::std::mem::align_of::<_zend_llist_element>() - 8usize];
    ["Offset of field: _zend_llist_element::next"]
        [::std::mem::offset_of!(_zend_llist_element, next) - 0usize];
    ["Offset of field: _zend_llist_element::prev"]
        [::std::mem::offset_of!(_zend_llist_element, prev) - 8usize];
    ["Offset of field: _zend_llist_element::data"]
        [::std::mem::offset_of!(_zend_llist_element, data) - 16usize];
};
impl Default for _zend_llist_element {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_llist_element = _zend_llist_element;
pub type llist_dtor_func_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
pub type llist_compare_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut *const zend_llist_element,
        arg2: *mut *const zend_llist_element,
    ) -> ::std::os::raw::c_int,
>;
pub type llist_apply_with_args_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        data: *mut ::std::os::raw::c_void,
        num_args: ::std::os::raw::c_int,
        args: va_list,
    ),
>;
pub type llist_apply_with_arg_func_t = ::std::option::Option<
    unsafe extern "C" fn(data: *mut ::std::os::raw::c_void, arg: *mut ::std::os::raw::c_void),
>;
pub type llist_apply_func_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_llist {
    pub head: *mut zend_llist_element,
    pub tail: *mut zend_llist_element,
    pub count: usize,
    pub size: usize,
    pub dtor: llist_dtor_func_t,
    pub persistent: ::std::os::raw::c_uchar,
    pub traverse_ptr: *mut zend_llist_element,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_llist"][::std::mem::size_of::<_zend_llist>() - 56usize];
    ["Alignment of _zend_llist"][::std::mem::align_of::<_zend_llist>() - 8usize];
    ["Offset of field: _zend_llist::head"][::std::mem::offset_of!(_zend_llist, head) - 0usize];
    ["Offset of field: _zend_llist::tail"][::std::mem::offset_of!(_zend_llist, tail) - 8usize];
    ["Offset of field: _zend_llist::count"][::std::mem::offset_of!(_zend_llist, count) - 16usize];
    ["Offset of field: _zend_llist::size"][::std::mem::offset_of!(_zend_llist, size) - 24usize];
    ["Offset of field: _zend_llist::dtor"][::std::mem::offset_of!(_zend_llist, dtor) - 32usize];
    ["Offset of field: _zend_llist::persistent"]
        [::std::mem::offset_of!(_zend_llist, persistent) - 40usize];
    ["Offset of field: _zend_llist::traverse_ptr"]
        [::std::mem::offset_of!(_zend_llist, traverse_ptr) - 48usize];
};
impl Default for _zend_llist {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_llist = _zend_llist;
pub type zend_llist_position = *mut zend_llist_element;
unsafe extern "C" {
    pub fn zend_llist_init(
        l: *mut zend_llist,
        size: usize,
        dtor: llist_dtor_func_t,
        persistent: ::std::os::raw::c_uchar,
    );
}
unsafe extern "C" {
    pub fn zend_llist_add_element(l: *mut zend_llist, element: *const ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn zend_llist_prepend_element(l: *mut zend_llist, element: *const ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn zend_llist_del_element(
        l: *mut zend_llist,
        element: *mut ::std::os::raw::c_void,
        compare: ::std::option::Option<
            unsafe extern "C" fn(
                element1: *mut ::std::os::raw::c_void,
                element2: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn zend_llist_destroy(l: *mut zend_llist);
}
unsafe extern "C" {
    pub fn zend_llist_clean(l: *mut zend_llist);
}
unsafe extern "C" {
    pub fn zend_llist_remove_tail(l: *mut zend_llist);
}
unsafe extern "C" {
    pub fn zend_llist_copy(dst: *mut zend_llist, src: *mut zend_llist);
}
unsafe extern "C" {
    pub fn zend_llist_apply(l: *mut zend_llist, func: llist_apply_func_t);
}
unsafe extern "C" {
    pub fn zend_llist_apply_with_del(
        l: *mut zend_llist,
        func: ::std::option::Option<
            unsafe extern "C" fn(data: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn zend_llist_apply_with_argument(
        l: *mut zend_llist,
        func: llist_apply_with_arg_func_t,
        arg: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn zend_llist_apply_with_arguments(
        l: *mut zend_llist,
        func: llist_apply_with_args_func_t,
        num_args: ::std::os::raw::c_int,
        ...
    );
}
unsafe extern "C" {
    pub fn zend_llist_count(l: *mut zend_llist) -> usize;
}
unsafe extern "C" {
    pub fn zend_llist_sort(l: *mut zend_llist, comp_func: llist_compare_func_t);
}
unsafe extern "C" {
    pub fn zend_llist_get_first_ex(
        l: *mut zend_llist,
        pos: *mut zend_llist_position,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn zend_llist_get_last_ex(
        l: *mut zend_llist,
        pos: *mut zend_llist_position,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn zend_llist_get_next_ex(
        l: *mut zend_llist,
        pos: *mut zend_llist_position,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn zend_llist_get_prev_ex(
        l: *mut zend_llist,
        pos: *mut zend_llist_position,
    ) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mach_timebase_info {
    pub numer: u32,
    pub denom: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_timebase_info"][::std::mem::size_of::<mach_timebase_info>() - 8usize];
    ["Alignment of mach_timebase_info"][::std::mem::align_of::<mach_timebase_info>() - 4usize];
    ["Offset of field: mach_timebase_info::numer"]
        [::std::mem::offset_of!(mach_timebase_info, numer) - 0usize];
    ["Offset of field: mach_timebase_info::denom"]
        [::std::mem::offset_of!(mach_timebase_info, denom) - 4usize];
};
pub type mach_timebase_info_data_t = mach_timebase_info;
unsafe extern "C" {
    pub static mut zend_hrtime_timerlib_info: mach_timebase_info_data_t;
}
pub type zend_hrtime_t = u64;
unsafe extern "C" {
    pub fn zend_startup_hrtime();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _zend_gc_status {
    pub active: bool,
    pub gc_protected: bool,
    pub full: bool,
    pub runs: u32,
    pub collected: u32,
    pub threshold: u32,
    pub buf_size: u32,
    pub num_roots: u32,
    pub application_time: zend_hrtime_t,
    pub collector_time: zend_hrtime_t,
    pub dtor_time: zend_hrtime_t,
    pub free_time: zend_hrtime_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_gc_status"][::std::mem::size_of::<_zend_gc_status>() - 56usize];
    ["Alignment of _zend_gc_status"][::std::mem::align_of::<_zend_gc_status>() - 8usize];
    ["Offset of field: _zend_gc_status::active"]
        [::std::mem::offset_of!(_zend_gc_status, active) - 0usize];
    ["Offset of field: _zend_gc_status::gc_protected"]
        [::std::mem::offset_of!(_zend_gc_status, gc_protected) - 1usize];
    ["Offset of field: _zend_gc_status::full"]
        [::std::mem::offset_of!(_zend_gc_status, full) - 2usize];
    ["Offset of field: _zend_gc_status::runs"]
        [::std::mem::offset_of!(_zend_gc_status, runs) - 4usize];
    ["Offset of field: _zend_gc_status::collected"]
        [::std::mem::offset_of!(_zend_gc_status, collected) - 8usize];
    ["Offset of field: _zend_gc_status::threshold"]
        [::std::mem::offset_of!(_zend_gc_status, threshold) - 12usize];
    ["Offset of field: _zend_gc_status::buf_size"]
        [::std::mem::offset_of!(_zend_gc_status, buf_size) - 16usize];
    ["Offset of field: _zend_gc_status::num_roots"]
        [::std::mem::offset_of!(_zend_gc_status, num_roots) - 20usize];
    ["Offset of field: _zend_gc_status::application_time"]
        [::std::mem::offset_of!(_zend_gc_status, application_time) - 24usize];
    ["Offset of field: _zend_gc_status::collector_time"]
        [::std::mem::offset_of!(_zend_gc_status, collector_time) - 32usize];
    ["Offset of field: _zend_gc_status::dtor_time"]
        [::std::mem::offset_of!(_zend_gc_status, dtor_time) - 40usize];
    ["Offset of field: _zend_gc_status::free_time"]
        [::std::mem::offset_of!(_zend_gc_status, free_time) - 48usize];
};
pub type zend_gc_status = _zend_gc_status;
unsafe extern "C" {
    pub static mut gc_collect_cycles:
        ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
}
unsafe extern "C" {
    pub fn gc_possible_root(ref_: *mut zend_refcounted);
}
unsafe extern "C" {
    pub fn gc_remove_from_buffer(ref_: *mut zend_refcounted);
}
unsafe extern "C" {
    pub fn gc_enable(enable: bool) -> bool;
}
unsafe extern "C" {
    pub fn gc_enabled() -> bool;
}
unsafe extern "C" {
    pub fn gc_protect(protect: bool) -> bool;
}
unsafe extern "C" {
    pub fn gc_protected() -> bool;
}
unsafe extern "C" {
    pub fn zend_gc_collect_cycles() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_gc_get_status(status: *mut zend_gc_status);
}
unsafe extern "C" {
    pub fn gc_init();
}
unsafe extern "C" {
    pub fn gc_globals_ctor();
}
unsafe extern "C" {
    pub fn gc_globals_dtor();
}
unsafe extern "C" {
    pub fn gc_reset();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct zend_get_gc_buffer {
    pub cur: *mut zval,
    pub end: *mut zval,
    pub start: *mut zval,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of zend_get_gc_buffer"][::std::mem::size_of::<zend_get_gc_buffer>() - 24usize];
    ["Alignment of zend_get_gc_buffer"][::std::mem::align_of::<zend_get_gc_buffer>() - 8usize];
    ["Offset of field: zend_get_gc_buffer::cur"]
        [::std::mem::offset_of!(zend_get_gc_buffer, cur) - 0usize];
    ["Offset of field: zend_get_gc_buffer::end"]
        [::std::mem::offset_of!(zend_get_gc_buffer, end) - 8usize];
    ["Offset of field: zend_get_gc_buffer::start"]
        [::std::mem::offset_of!(zend_get_gc_buffer, start) - 16usize];
};
impl Default for zend_get_gc_buffer {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn zend_get_gc_buffer_create() -> *mut zend_get_gc_buffer;
}
unsafe extern "C" {
    pub fn zend_get_gc_buffer_grow(gc_buffer: *mut zend_get_gc_buffer);
}
pub type zend_string_copy_storage_func_t = ::std::option::Option<unsafe extern "C" fn()>;
pub type zend_new_interned_string_func_t =
    ::std::option::Option<unsafe extern "C" fn(str_: *mut zend_string) -> *mut zend_string>;
pub type zend_string_init_interned_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        str_: *const ::std::os::raw::c_char,
        size: usize,
        permanent: bool,
    ) -> *mut zend_string,
>;
pub type zend_string_init_existing_interned_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        str_: *const ::std::os::raw::c_char,
        size: usize,
        permanent: bool,
    ) -> *mut zend_string,
>;
unsafe extern "C" {
    pub static mut zend_new_interned_string: zend_new_interned_string_func_t;
}
unsafe extern "C" {
    pub static mut zend_string_init_interned: zend_string_init_interned_func_t;
}
unsafe extern "C" {
    pub static mut zend_string_init_existing_interned: zend_string_init_existing_interned_func_t;
}
unsafe extern "C" {
    pub fn zend_string_hash_func(str_: *mut zend_string) -> zend_ulong;
}
unsafe extern "C" {
    pub fn zend_hash_func(str_: *const ::std::os::raw::c_char, len: usize) -> zend_ulong;
}
unsafe extern "C" {
    pub fn zend_interned_string_find_permanent(str_: *mut zend_string) -> *mut zend_string;
}
unsafe extern "C" {
    pub fn zend_string_concat2(
        str1: *const ::std::os::raw::c_char,
        str1_len: usize,
        str2: *const ::std::os::raw::c_char,
        str2_len: usize,
    ) -> *mut zend_string;
}
unsafe extern "C" {
    pub fn zend_string_concat3(
        str1: *const ::std::os::raw::c_char,
        str1_len: usize,
        str2: *const ::std::os::raw::c_char,
        str2_len: usize,
        str3: *const ::std::os::raw::c_char,
        str3_len: usize,
    ) -> *mut zend_string;
}
unsafe extern "C" {
    pub fn zend_interned_strings_init();
}
unsafe extern "C" {
    pub fn zend_interned_strings_dtor();
}
unsafe extern "C" {
    pub fn zend_interned_strings_activate();
}
unsafe extern "C" {
    pub fn zend_interned_strings_deactivate();
}
unsafe extern "C" {
    pub fn zend_interned_strings_set_request_storage_handlers(
        handler: zend_new_interned_string_func_t,
        init_handler: zend_string_init_interned_func_t,
        init_existing_handler: zend_string_init_existing_interned_func_t,
    );
}
unsafe extern "C" {
    pub fn zend_interned_strings_switch_storage(request: bool);
}
unsafe extern "C" {
    pub static mut zend_empty_string: *mut zend_string;
}
unsafe extern "C" {
    pub static mut zend_one_char_string: [*mut zend_string; 256usize];
}
unsafe extern "C" {
    pub static mut zend_known_strings: *mut *mut zend_string;
}
pub const _zend_known_string_id_ZEND_STR_FILE: _zend_known_string_id = 0;
pub const _zend_known_string_id_ZEND_STR_LINE: _zend_known_string_id = 1;
pub const _zend_known_string_id_ZEND_STR_FUNCTION: _zend_known_string_id = 2;
pub const _zend_known_string_id_ZEND_STR_CLASS: _zend_known_string_id = 3;
pub const _zend_known_string_id_ZEND_STR_OBJECT: _zend_known_string_id = 4;
pub const _zend_known_string_id_ZEND_STR_TYPE: _zend_known_string_id = 5;
pub const _zend_known_string_id_ZEND_STR_OBJECT_OPERATOR: _zend_known_string_id = 6;
pub const _zend_known_string_id_ZEND_STR_PAAMAYIM_NEKUDOTAYIM: _zend_known_string_id = 7;
pub const _zend_known_string_id_ZEND_STR_ARGS: _zend_known_string_id = 8;
pub const _zend_known_string_id_ZEND_STR_UNKNOWN: _zend_known_string_id = 9;
pub const _zend_known_string_id_ZEND_STR_UNKNOWN_CAPITALIZED: _zend_known_string_id = 10;
pub const _zend_known_string_id_ZEND_STR_EXIT: _zend_known_string_id = 11;
pub const _zend_known_string_id_ZEND_STR_EVAL: _zend_known_string_id = 12;
pub const _zend_known_string_id_ZEND_STR_INCLUDE: _zend_known_string_id = 13;
pub const _zend_known_string_id_ZEND_STR_REQUIRE: _zend_known_string_id = 14;
pub const _zend_known_string_id_ZEND_STR_INCLUDE_ONCE: _zend_known_string_id = 15;
pub const _zend_known_string_id_ZEND_STR_REQUIRE_ONCE: _zend_known_string_id = 16;
pub const _zend_known_string_id_ZEND_STR_SCALAR: _zend_known_string_id = 17;
pub const _zend_known_string_id_ZEND_STR_ERROR_REPORTING: _zend_known_string_id = 18;
pub const _zend_known_string_id_ZEND_STR_STATIC: _zend_known_string_id = 19;
pub const _zend_known_string_id_ZEND_STR_THIS: _zend_known_string_id = 20;
pub const _zend_known_string_id_ZEND_STR_VALUE: _zend_known_string_id = 21;
pub const _zend_known_string_id_ZEND_STR_KEY: _zend_known_string_id = 22;
pub const _zend_known_string_id_ZEND_STR_MAGIC_INVOKE: _zend_known_string_id = 23;
pub const _zend_known_string_id_ZEND_STR_PREVIOUS: _zend_known_string_id = 24;
pub const _zend_known_string_id_ZEND_STR_CODE: _zend_known_string_id = 25;
pub const _zend_known_string_id_ZEND_STR_MESSAGE: _zend_known_string_id = 26;
pub const _zend_known_string_id_ZEND_STR_SEVERITY: _zend_known_string_id = 27;
pub const _zend_known_string_id_ZEND_STR_STRING: _zend_known_string_id = 28;
pub const _zend_known_string_id_ZEND_STR_TRACE: _zend_known_string_id = 29;
pub const _zend_known_string_id_ZEND_STR_SCHEME: _zend_known_string_id = 30;
pub const _zend_known_string_id_ZEND_STR_HOST: _zend_known_string_id = 31;
pub const _zend_known_string_id_ZEND_STR_PORT: _zend_known_string_id = 32;
pub const _zend_known_string_id_ZEND_STR_USER: _zend_known_string_id = 33;
pub const _zend_known_string_id_ZEND_STR_PASS: _zend_known_string_id = 34;
pub const _zend_known_string_id_ZEND_STR_PATH: _zend_known_string_id = 35;
pub const _zend_known_string_id_ZEND_STR_QUERY: _zend_known_string_id = 36;
pub const _zend_known_string_id_ZEND_STR_FRAGMENT: _zend_known_string_id = 37;
pub const _zend_known_string_id_ZEND_STR_NULL: _zend_known_string_id = 38;
pub const _zend_known_string_id_ZEND_STR_BOOLEAN: _zend_known_string_id = 39;
pub const _zend_known_string_id_ZEND_STR_INTEGER: _zend_known_string_id = 40;
pub const _zend_known_string_id_ZEND_STR_DOUBLE: _zend_known_string_id = 41;
pub const _zend_known_string_id_ZEND_STR_ARRAY: _zend_known_string_id = 42;
pub const _zend_known_string_id_ZEND_STR_RESOURCE: _zend_known_string_id = 43;
pub const _zend_known_string_id_ZEND_STR_CLOSED_RESOURCE: _zend_known_string_id = 44;
pub const _zend_known_string_id_ZEND_STR_NAME: _zend_known_string_id = 45;
pub const _zend_known_string_id_ZEND_STR_ARGV: _zend_known_string_id = 46;
pub const _zend_known_string_id_ZEND_STR_ARGC: _zend_known_string_id = 47;
pub const _zend_known_string_id_ZEND_STR_ARRAY_CAPITALIZED: _zend_known_string_id = 48;
pub const _zend_known_string_id_ZEND_STR_BOOL: _zend_known_string_id = 49;
pub const _zend_known_string_id_ZEND_STR_INT: _zend_known_string_id = 50;
pub const _zend_known_string_id_ZEND_STR_FLOAT: _zend_known_string_id = 51;
pub const _zend_known_string_id_ZEND_STR_CALLABLE: _zend_known_string_id = 52;
pub const _zend_known_string_id_ZEND_STR_ITERABLE: _zend_known_string_id = 53;
pub const _zend_known_string_id_ZEND_STR_VOID: _zend_known_string_id = 54;
pub const _zend_known_string_id_ZEND_STR_NEVER: _zend_known_string_id = 55;
pub const _zend_known_string_id_ZEND_STR_FALSE: _zend_known_string_id = 56;
pub const _zend_known_string_id_ZEND_STR_TRUE: _zend_known_string_id = 57;
pub const _zend_known_string_id_ZEND_STR_NULL_LOWERCASE: _zend_known_string_id = 58;
pub const _zend_known_string_id_ZEND_STR_MIXED: _zend_known_string_id = 59;
pub const _zend_known_string_id_ZEND_STR_TRAVERSABLE: _zend_known_string_id = 60;
pub const _zend_known_string_id_ZEND_STR_SLEEP: _zend_known_string_id = 61;
pub const _zend_known_string_id_ZEND_STR_WAKEUP: _zend_known_string_id = 62;
pub const _zend_known_string_id_ZEND_STR_CASES: _zend_known_string_id = 63;
pub const _zend_known_string_id_ZEND_STR_FROM: _zend_known_string_id = 64;
pub const _zend_known_string_id_ZEND_STR_TRYFROM: _zend_known_string_id = 65;
pub const _zend_known_string_id_ZEND_STR_TRYFROM_LOWERCASE: _zend_known_string_id = 66;
pub const _zend_known_string_id_ZEND_STR_AUTOGLOBAL_SERVER: _zend_known_string_id = 67;
pub const _zend_known_string_id_ZEND_STR_AUTOGLOBAL_ENV: _zend_known_string_id = 68;
pub const _zend_known_string_id_ZEND_STR_AUTOGLOBAL_REQUEST: _zend_known_string_id = 69;
pub const _zend_known_string_id_ZEND_STR_COUNT: _zend_known_string_id = 70;
pub const _zend_known_string_id_ZEND_STR_SENSITIVEPARAMETER: _zend_known_string_id = 71;
pub const _zend_known_string_id_ZEND_STR_CONST_EXPR_PLACEHOLDER: _zend_known_string_id = 72;
pub const _zend_known_string_id_ZEND_STR_DEPRECATED_CAPITALIZED: _zend_known_string_id = 73;
pub const _zend_known_string_id_ZEND_STR_SINCE: _zend_known_string_id = 74;
pub const _zend_known_string_id_ZEND_STR_GET: _zend_known_string_id = 75;
pub const _zend_known_string_id_ZEND_STR_SET: _zend_known_string_id = 76;
pub const _zend_known_string_id_ZEND_STR_LAST_KNOWN: _zend_known_string_id = 77;
pub type _zend_known_string_id = ::std::os::raw::c_uint;
pub use self::_zend_known_string_id as zend_known_string_id;
unsafe extern "C" {
    pub fn zend_sort(
        base: *mut ::std::os::raw::c_void,
        nmemb: usize,
        siz: usize,
        cmp: compare_func_t,
        swp: swap_func_t,
    );
}
unsafe extern "C" {
    pub fn zend_insert_sort(
        base: *mut ::std::os::raw::c_void,
        nmemb: usize,
        siz: usize,
        cmp: compare_func_t,
        swp: swap_func_t,
    );
}
unsafe extern "C" {
    pub static zend_empty_array: HashTable;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_hash_key {
    pub h: zend_ulong,
    pub key: *mut zend_string,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_hash_key"][::std::mem::size_of::<_zend_hash_key>() - 16usize];
    ["Alignment of _zend_hash_key"][::std::mem::align_of::<_zend_hash_key>() - 8usize];
    ["Offset of field: _zend_hash_key::h"][::std::mem::offset_of!(_zend_hash_key, h) - 0usize];
    ["Offset of field: _zend_hash_key::key"][::std::mem::offset_of!(_zend_hash_key, key) - 8usize];
};
impl Default for _zend_hash_key {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_hash_key = _zend_hash_key;
pub type merge_checker_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        target_ht: *mut HashTable,
        source_data: *mut zval,
        hash_key: *mut zend_hash_key,
        pParam: *mut ::std::os::raw::c_void,
    ) -> bool,
>;
unsafe extern "C" {
    pub fn _zend_hash_init(
        ht: *mut HashTable,
        nSize: u32,
        pDestructor: dtor_func_t,
        persistent: bool,
    );
}
unsafe extern "C" {
    pub fn zend_hash_destroy(ht: *mut HashTable);
}
unsafe extern "C" {
    pub fn zend_hash_clean(ht: *mut HashTable);
}
unsafe extern "C" {
    pub fn zend_hash_real_init(ht: *mut HashTable, packed: bool);
}
unsafe extern "C" {
    pub fn zend_hash_real_init_packed(ht: *mut HashTable);
}
unsafe extern "C" {
    pub fn zend_hash_real_init_mixed(ht: *mut HashTable);
}
unsafe extern "C" {
    pub fn zend_hash_packed_to_hash(ht: *mut HashTable);
}
unsafe extern "C" {
    pub fn zend_hash_to_packed(ht: *mut HashTable);
}
unsafe extern "C" {
    pub fn zend_hash_extend(ht: *mut HashTable, nSize: u32, packed: bool);
}
unsafe extern "C" {
    pub fn zend_hash_discard(ht: *mut HashTable, nNumUsed: u32);
}
unsafe extern "C" {
    pub fn zend_hash_packed_grow(ht: *mut HashTable);
}
unsafe extern "C" {
    pub fn zend_hash_add_or_update(
        ht: *mut HashTable,
        key: *mut zend_string,
        pData: *mut zval,
        flag: u32,
    ) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_update(
        ht: *mut HashTable,
        key: *mut zend_string,
        pData: *mut zval,
    ) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_update_ind(
        ht: *mut HashTable,
        key: *mut zend_string,
        pData: *mut zval,
    ) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_add(ht: *mut HashTable, key: *mut zend_string, pData: *mut zval) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_add_new(
        ht: *mut HashTable,
        key: *mut zend_string,
        pData: *mut zval,
    ) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_str_add_or_update(
        ht: *mut HashTable,
        key: *const ::std::os::raw::c_char,
        len: usize,
        pData: *mut zval,
        flag: u32,
    ) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_str_update(
        ht: *mut HashTable,
        key: *const ::std::os::raw::c_char,
        len: usize,
        pData: *mut zval,
    ) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_str_update_ind(
        ht: *mut HashTable,
        key: *const ::std::os::raw::c_char,
        len: usize,
        pData: *mut zval,
    ) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_str_add(
        ht: *mut HashTable,
        key: *const ::std::os::raw::c_char,
        len: usize,
        pData: *mut zval,
    ) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_str_add_new(
        ht: *mut HashTable,
        key: *const ::std::os::raw::c_char,
        len: usize,
        pData: *mut zval,
    ) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_index_add_or_update(
        ht: *mut HashTable,
        h: zend_ulong,
        pData: *mut zval,
        flag: u32,
    ) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_index_add(ht: *mut HashTable, h: zend_ulong, pData: *mut zval) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_index_add_new(
        ht: *mut HashTable,
        h: zend_ulong,
        pData: *mut zval,
    ) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_index_update(ht: *mut HashTable, h: zend_ulong, pData: *mut zval)
        -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_next_index_insert(ht: *mut HashTable, pData: *mut zval) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_next_index_insert_new(ht: *mut HashTable, pData: *mut zval) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_index_add_empty_element(ht: *mut HashTable, h: zend_ulong) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_add_empty_element(ht: *mut HashTable, key: *mut zend_string) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_str_add_empty_element(
        ht: *mut HashTable,
        key: *const ::std::os::raw::c_char,
        len: usize,
    ) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_set_bucket_key(
        ht: *mut HashTable,
        p: *mut Bucket,
        key: *mut zend_string,
    ) -> *mut zval;
}
pub type apply_func_t =
    ::std::option::Option<unsafe extern "C" fn(pDest: *mut zval) -> ::std::os::raw::c_int>;
pub type apply_func_arg_t = ::std::option::Option<
    unsafe extern "C" fn(
        pDest: *mut zval,
        argument: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type apply_func_args_t = ::std::option::Option<
    unsafe extern "C" fn(
        pDest: *mut zval,
        num_args: ::std::os::raw::c_int,
        args: va_list,
        hash_key: *mut zend_hash_key,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn zend_hash_graceful_destroy(ht: *mut HashTable);
}
unsafe extern "C" {
    pub fn zend_hash_graceful_reverse_destroy(ht: *mut HashTable);
}
unsafe extern "C" {
    pub fn zend_hash_apply(ht: *mut HashTable, apply_func: apply_func_t);
}
unsafe extern "C" {
    pub fn zend_hash_apply_with_argument(
        ht: *mut HashTable,
        apply_func: apply_func_arg_t,
        arg1: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn zend_hash_apply_with_arguments(
        ht: *mut HashTable,
        apply_func: apply_func_args_t,
        arg1: ::std::os::raw::c_int,
        ...
    );
}
unsafe extern "C" {
    pub fn zend_hash_reverse_apply(ht: *mut HashTable, apply_func: apply_func_t);
}
unsafe extern "C" {
    pub fn zend_hash_del(ht: *mut HashTable, key: *mut zend_string) -> zend_result;
}
unsafe extern "C" {
    pub fn zend_hash_del_ind(ht: *mut HashTable, key: *mut zend_string) -> zend_result;
}
unsafe extern "C" {
    pub fn zend_hash_str_del(
        ht: *mut HashTable,
        key: *const ::std::os::raw::c_char,
        len: usize,
    ) -> zend_result;
}
unsafe extern "C" {
    pub fn zend_hash_str_del_ind(
        ht: *mut HashTable,
        key: *const ::std::os::raw::c_char,
        len: usize,
    ) -> zend_result;
}
unsafe extern "C" {
    pub fn zend_hash_index_del(ht: *mut HashTable, h: zend_ulong) -> zend_result;
}
unsafe extern "C" {
    pub fn zend_hash_del_bucket(ht: *mut HashTable, p: *mut Bucket);
}
unsafe extern "C" {
    pub fn zend_hash_packed_del_val(ht: *mut HashTable, zv: *mut zval);
}
unsafe extern "C" {
    pub fn zend_hash_find(ht: *const HashTable, key: *mut zend_string) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_str_find(
        ht: *const HashTable,
        key: *const ::std::os::raw::c_char,
        len: usize,
    ) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_index_find(ht: *const HashTable, h: zend_ulong) -> *mut zval;
}
unsafe extern "C" {
    pub fn _zend_hash_index_find(ht: *const HashTable, h: zend_ulong) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_find_known_hash(ht: *const HashTable, key: *const zend_string) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_lookup(ht: *mut HashTable, key: *mut zend_string) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_index_lookup(ht: *mut HashTable, h: zend_ulong) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_get_current_pos_ex(ht: *const HashTable, pos: HashPosition) -> HashPosition;
}
unsafe extern "C" {
    pub fn zend_hash_get_current_pos(ht: *const HashTable) -> HashPosition;
}
unsafe extern "C" {
    pub fn zend_hash_move_forward_ex(ht: *mut HashTable, pos: *mut HashPosition) -> zend_result;
}
unsafe extern "C" {
    pub fn zend_hash_move_backwards_ex(ht: *mut HashTable, pos: *mut HashPosition) -> zend_result;
}
unsafe extern "C" {
    pub fn zend_hash_get_current_key_ex(
        ht: *const HashTable,
        str_index: *mut *mut zend_string,
        num_index: *mut zend_ulong,
        pos: *const HashPosition,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_hash_get_current_key_zval_ex(
        ht: *const HashTable,
        key: *mut zval,
        pos: *const HashPosition,
    );
}
unsafe extern "C" {
    pub fn zend_hash_get_current_key_type_ex(
        ht: *mut HashTable,
        pos: *mut HashPosition,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_hash_get_current_data_ex(ht: *mut HashTable, pos: *mut HashPosition) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_internal_pointer_reset_ex(ht: *mut HashTable, pos: *mut HashPosition);
}
unsafe extern "C" {
    pub fn zend_hash_internal_pointer_end_ex(ht: *mut HashTable, pos: *mut HashPosition);
}
unsafe extern "C" {
    pub fn zend_hash_copy(
        target: *mut HashTable,
        source: *mut HashTable,
        pCopyConstructor: copy_ctor_func_t,
    );
}
unsafe extern "C" {
    pub fn zend_hash_merge(
        target: *mut HashTable,
        source: *mut HashTable,
        pCopyConstructor: copy_ctor_func_t,
        overwrite: bool,
    );
}
unsafe extern "C" {
    pub fn zend_hash_merge_ex(
        target: *mut HashTable,
        source: *mut HashTable,
        pCopyConstructor: copy_ctor_func_t,
        pMergeSource: merge_checker_func_t,
        pParam: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn zend_hash_bucket_swap(p: *mut Bucket, q: *mut Bucket);
}
unsafe extern "C" {
    pub fn zend_hash_bucket_renum_swap(p: *mut Bucket, q: *mut Bucket);
}
unsafe extern "C" {
    pub fn zend_hash_bucket_packed_swap(p: *mut Bucket, q: *mut Bucket);
}
pub type bucket_compare_func_t = ::std::option::Option<
    unsafe extern "C" fn(a: *mut Bucket, b: *mut Bucket) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn zend_hash_compare(
        ht1: *mut HashTable,
        ht2: *mut HashTable,
        compar: compare_func_t,
        ordered: bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_hash_sort_ex(
        ht: *mut HashTable,
        sort_func: sort_func_t,
        compare_func: bucket_compare_func_t,
        renumber: bool,
    );
}
unsafe extern "C" {
    pub fn zend_array_sort_ex(
        ht: *mut HashTable,
        sort_func: sort_func_t,
        compare_func: bucket_compare_func_t,
        renumber: bool,
    );
}
unsafe extern "C" {
    pub fn zend_hash_minmax(ht: *const HashTable, compar: compare_func_t, flag: u32) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_hash_rehash(ht: *mut HashTable);
}
unsafe extern "C" {
    pub fn _zend_new_array_0() -> *mut HashTable;
}
unsafe extern "C" {
    pub fn _zend_new_array(size: u32) -> *mut HashTable;
}
unsafe extern "C" {
    pub fn zend_new_pair(val1: *mut zval, val2: *mut zval) -> *mut HashTable;
}
unsafe extern "C" {
    pub fn zend_array_count(ht: *mut HashTable) -> u32;
}
unsafe extern "C" {
    pub fn zend_array_dup(source: *mut HashTable) -> *mut HashTable;
}
unsafe extern "C" {
    pub fn zend_array_destroy(ht: *mut HashTable);
}
unsafe extern "C" {
    pub fn zend_array_to_list(source: *mut HashTable) -> *mut HashTable;
}
unsafe extern "C" {
    pub fn zend_symtable_clean(ht: *mut HashTable);
}
unsafe extern "C" {
    pub fn zend_symtable_to_proptable(ht: *mut HashTable) -> *mut HashTable;
}
unsafe extern "C" {
    pub fn zend_proptable_to_symtable(ht: *mut HashTable, always_duplicate: bool)
        -> *mut HashTable;
}
unsafe extern "C" {
    pub fn _zend_handle_numeric_str_ex(
        key: *const ::std::os::raw::c_char,
        length: usize,
        idx: *mut zend_ulong,
    ) -> bool;
}
unsafe extern "C" {
    pub fn zend_hash_iterator_add(ht: *mut HashTable, pos: HashPosition) -> u32;
}
unsafe extern "C" {
    pub fn zend_hash_iterator_pos(idx: u32, ht: *mut HashTable) -> HashPosition;
}
unsafe extern "C" {
    pub fn zend_hash_iterator_pos_ex(idx: u32, array: *mut zval) -> HashPosition;
}
unsafe extern "C" {
    pub fn zend_hash_iterator_del(idx: u32);
}
unsafe extern "C" {
    pub fn zend_hash_iterators_lower_pos(ht: *mut HashTable, start: HashPosition) -> HashPosition;
}
unsafe extern "C" {
    pub fn _zend_hash_iterators_update(ht: *mut HashTable, from: HashPosition, to: HashPosition);
}
unsafe extern "C" {
    pub fn zend_hash_iterators_advance(ht: *mut HashTable, step: HashPosition);
}
unsafe extern "C" {
    pub fn zend_hash_str_find_ptr_lc(
        ht: *const HashTable,
        str_: *const ::std::os::raw::c_char,
        len: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn zend_hash_find_ptr_lc(
        ht: *const HashTable,
        key: *mut zend_string,
    ) -> *mut ::std::os::raw::c_void;
}
pub const _zend_ast_kind_ZEND_AST_ZVAL: _zend_ast_kind = 64;
pub const _zend_ast_kind_ZEND_AST_CONSTANT: _zend_ast_kind = 65;
pub const _zend_ast_kind_ZEND_AST_ZNODE: _zend_ast_kind = 66;
pub const _zend_ast_kind_ZEND_AST_FUNC_DECL: _zend_ast_kind = 67;
pub const _zend_ast_kind_ZEND_AST_CLOSURE: _zend_ast_kind = 68;
pub const _zend_ast_kind_ZEND_AST_METHOD: _zend_ast_kind = 69;
pub const _zend_ast_kind_ZEND_AST_CLASS: _zend_ast_kind = 70;
pub const _zend_ast_kind_ZEND_AST_ARROW_FUNC: _zend_ast_kind = 71;
pub const _zend_ast_kind_ZEND_AST_PROPERTY_HOOK: _zend_ast_kind = 72;
pub const _zend_ast_kind_ZEND_AST_ARG_LIST: _zend_ast_kind = 128;
pub const _zend_ast_kind_ZEND_AST_ARRAY: _zend_ast_kind = 129;
pub const _zend_ast_kind_ZEND_AST_ENCAPS_LIST: _zend_ast_kind = 130;
pub const _zend_ast_kind_ZEND_AST_EXPR_LIST: _zend_ast_kind = 131;
pub const _zend_ast_kind_ZEND_AST_STMT_LIST: _zend_ast_kind = 132;
pub const _zend_ast_kind_ZEND_AST_IF: _zend_ast_kind = 133;
pub const _zend_ast_kind_ZEND_AST_SWITCH_LIST: _zend_ast_kind = 134;
pub const _zend_ast_kind_ZEND_AST_CATCH_LIST: _zend_ast_kind = 135;
pub const _zend_ast_kind_ZEND_AST_PARAM_LIST: _zend_ast_kind = 136;
pub const _zend_ast_kind_ZEND_AST_CLOSURE_USES: _zend_ast_kind = 137;
pub const _zend_ast_kind_ZEND_AST_PROP_DECL: _zend_ast_kind = 138;
pub const _zend_ast_kind_ZEND_AST_CONST_DECL: _zend_ast_kind = 139;
pub const _zend_ast_kind_ZEND_AST_CLASS_CONST_DECL: _zend_ast_kind = 140;
pub const _zend_ast_kind_ZEND_AST_NAME_LIST: _zend_ast_kind = 141;
pub const _zend_ast_kind_ZEND_AST_TRAIT_ADAPTATIONS: _zend_ast_kind = 142;
pub const _zend_ast_kind_ZEND_AST_USE: _zend_ast_kind = 143;
pub const _zend_ast_kind_ZEND_AST_TYPE_UNION: _zend_ast_kind = 144;
pub const _zend_ast_kind_ZEND_AST_TYPE_INTERSECTION: _zend_ast_kind = 145;
pub const _zend_ast_kind_ZEND_AST_ATTRIBUTE_LIST: _zend_ast_kind = 146;
pub const _zend_ast_kind_ZEND_AST_ATTRIBUTE_GROUP: _zend_ast_kind = 147;
pub const _zend_ast_kind_ZEND_AST_MATCH_ARM_LIST: _zend_ast_kind = 148;
pub const _zend_ast_kind_ZEND_AST_MODIFIER_LIST: _zend_ast_kind = 149;
pub const _zend_ast_kind_ZEND_AST_MAGIC_CONST: _zend_ast_kind = 0;
pub const _zend_ast_kind_ZEND_AST_TYPE: _zend_ast_kind = 1;
pub const _zend_ast_kind_ZEND_AST_CONSTANT_CLASS: _zend_ast_kind = 2;
pub const _zend_ast_kind_ZEND_AST_CALLABLE_CONVERT: _zend_ast_kind = 3;
pub const _zend_ast_kind_ZEND_AST_VAR: _zend_ast_kind = 256;
pub const _zend_ast_kind_ZEND_AST_CONST: _zend_ast_kind = 257;
pub const _zend_ast_kind_ZEND_AST_UNPACK: _zend_ast_kind = 258;
pub const _zend_ast_kind_ZEND_AST_UNARY_PLUS: _zend_ast_kind = 259;
pub const _zend_ast_kind_ZEND_AST_UNARY_MINUS: _zend_ast_kind = 260;
pub const _zend_ast_kind_ZEND_AST_CAST: _zend_ast_kind = 261;
pub const _zend_ast_kind_ZEND_AST_EMPTY: _zend_ast_kind = 262;
pub const _zend_ast_kind_ZEND_AST_ISSET: _zend_ast_kind = 263;
pub const _zend_ast_kind_ZEND_AST_SILENCE: _zend_ast_kind = 264;
pub const _zend_ast_kind_ZEND_AST_SHELL_EXEC: _zend_ast_kind = 265;
pub const _zend_ast_kind_ZEND_AST_CLONE: _zend_ast_kind = 266;
pub const _zend_ast_kind_ZEND_AST_EXIT: _zend_ast_kind = 267;
pub const _zend_ast_kind_ZEND_AST_PRINT: _zend_ast_kind = 268;
pub const _zend_ast_kind_ZEND_AST_INCLUDE_OR_EVAL: _zend_ast_kind = 269;
pub const _zend_ast_kind_ZEND_AST_UNARY_OP: _zend_ast_kind = 270;
pub const _zend_ast_kind_ZEND_AST_PRE_INC: _zend_ast_kind = 271;
pub const _zend_ast_kind_ZEND_AST_PRE_DEC: _zend_ast_kind = 272;
pub const _zend_ast_kind_ZEND_AST_POST_INC: _zend_ast_kind = 273;
pub const _zend_ast_kind_ZEND_AST_POST_DEC: _zend_ast_kind = 274;
pub const _zend_ast_kind_ZEND_AST_YIELD_FROM: _zend_ast_kind = 275;
pub const _zend_ast_kind_ZEND_AST_CLASS_NAME: _zend_ast_kind = 276;
pub const _zend_ast_kind_ZEND_AST_GLOBAL: _zend_ast_kind = 277;
pub const _zend_ast_kind_ZEND_AST_UNSET: _zend_ast_kind = 278;
pub const _zend_ast_kind_ZEND_AST_RETURN: _zend_ast_kind = 279;
pub const _zend_ast_kind_ZEND_AST_LABEL: _zend_ast_kind = 280;
pub const _zend_ast_kind_ZEND_AST_REF: _zend_ast_kind = 281;
pub const _zend_ast_kind_ZEND_AST_HALT_COMPILER: _zend_ast_kind = 282;
pub const _zend_ast_kind_ZEND_AST_ECHO: _zend_ast_kind = 283;
pub const _zend_ast_kind_ZEND_AST_THROW: _zend_ast_kind = 284;
pub const _zend_ast_kind_ZEND_AST_GOTO: _zend_ast_kind = 285;
pub const _zend_ast_kind_ZEND_AST_BREAK: _zend_ast_kind = 286;
pub const _zend_ast_kind_ZEND_AST_CONTINUE: _zend_ast_kind = 287;
pub const _zend_ast_kind_ZEND_AST_PROPERTY_HOOK_SHORT_BODY: _zend_ast_kind = 288;
pub const _zend_ast_kind_ZEND_AST_DIM: _zend_ast_kind = 512;
pub const _zend_ast_kind_ZEND_AST_PROP: _zend_ast_kind = 513;
pub const _zend_ast_kind_ZEND_AST_NULLSAFE_PROP: _zend_ast_kind = 514;
pub const _zend_ast_kind_ZEND_AST_STATIC_PROP: _zend_ast_kind = 515;
pub const _zend_ast_kind_ZEND_AST_CALL: _zend_ast_kind = 516;
pub const _zend_ast_kind_ZEND_AST_CLASS_CONST: _zend_ast_kind = 517;
pub const _zend_ast_kind_ZEND_AST_ASSIGN: _zend_ast_kind = 518;
pub const _zend_ast_kind_ZEND_AST_ASSIGN_REF: _zend_ast_kind = 519;
pub const _zend_ast_kind_ZEND_AST_ASSIGN_OP: _zend_ast_kind = 520;
pub const _zend_ast_kind_ZEND_AST_BINARY_OP: _zend_ast_kind = 521;
pub const _zend_ast_kind_ZEND_AST_GREATER: _zend_ast_kind = 522;
pub const _zend_ast_kind_ZEND_AST_GREATER_EQUAL: _zend_ast_kind = 523;
pub const _zend_ast_kind_ZEND_AST_AND: _zend_ast_kind = 524;
pub const _zend_ast_kind_ZEND_AST_OR: _zend_ast_kind = 525;
pub const _zend_ast_kind_ZEND_AST_ARRAY_ELEM: _zend_ast_kind = 526;
pub const _zend_ast_kind_ZEND_AST_NEW: _zend_ast_kind = 527;
pub const _zend_ast_kind_ZEND_AST_INSTANCEOF: _zend_ast_kind = 528;
pub const _zend_ast_kind_ZEND_AST_YIELD: _zend_ast_kind = 529;
pub const _zend_ast_kind_ZEND_AST_COALESCE: _zend_ast_kind = 530;
pub const _zend_ast_kind_ZEND_AST_ASSIGN_COALESCE: _zend_ast_kind = 531;
pub const _zend_ast_kind_ZEND_AST_STATIC: _zend_ast_kind = 532;
pub const _zend_ast_kind_ZEND_AST_WHILE: _zend_ast_kind = 533;
pub const _zend_ast_kind_ZEND_AST_DO_WHILE: _zend_ast_kind = 534;
pub const _zend_ast_kind_ZEND_AST_IF_ELEM: _zend_ast_kind = 535;
pub const _zend_ast_kind_ZEND_AST_SWITCH: _zend_ast_kind = 536;
pub const _zend_ast_kind_ZEND_AST_SWITCH_CASE: _zend_ast_kind = 537;
pub const _zend_ast_kind_ZEND_AST_DECLARE: _zend_ast_kind = 538;
pub const _zend_ast_kind_ZEND_AST_USE_TRAIT: _zend_ast_kind = 539;
pub const _zend_ast_kind_ZEND_AST_TRAIT_PRECEDENCE: _zend_ast_kind = 540;
pub const _zend_ast_kind_ZEND_AST_METHOD_REFERENCE: _zend_ast_kind = 541;
pub const _zend_ast_kind_ZEND_AST_NAMESPACE: _zend_ast_kind = 542;
pub const _zend_ast_kind_ZEND_AST_USE_ELEM: _zend_ast_kind = 543;
pub const _zend_ast_kind_ZEND_AST_TRAIT_ALIAS: _zend_ast_kind = 544;
pub const _zend_ast_kind_ZEND_AST_GROUP_USE: _zend_ast_kind = 545;
pub const _zend_ast_kind_ZEND_AST_ATTRIBUTE: _zend_ast_kind = 546;
pub const _zend_ast_kind_ZEND_AST_MATCH: _zend_ast_kind = 547;
pub const _zend_ast_kind_ZEND_AST_MATCH_ARM: _zend_ast_kind = 548;
pub const _zend_ast_kind_ZEND_AST_NAMED_ARG: _zend_ast_kind = 549;
pub const _zend_ast_kind_ZEND_AST_PARENT_PROPERTY_HOOK_CALL: _zend_ast_kind = 550;
pub const _zend_ast_kind_ZEND_AST_METHOD_CALL: _zend_ast_kind = 768;
pub const _zend_ast_kind_ZEND_AST_NULLSAFE_METHOD_CALL: _zend_ast_kind = 769;
pub const _zend_ast_kind_ZEND_AST_STATIC_CALL: _zend_ast_kind = 770;
pub const _zend_ast_kind_ZEND_AST_CONDITIONAL: _zend_ast_kind = 771;
pub const _zend_ast_kind_ZEND_AST_TRY: _zend_ast_kind = 772;
pub const _zend_ast_kind_ZEND_AST_CATCH: _zend_ast_kind = 773;
pub const _zend_ast_kind_ZEND_AST_PROP_GROUP: _zend_ast_kind = 774;
pub const _zend_ast_kind_ZEND_AST_CONST_ELEM: _zend_ast_kind = 775;
pub const _zend_ast_kind_ZEND_AST_CLASS_CONST_GROUP: _zend_ast_kind = 776;
pub const _zend_ast_kind_ZEND_AST_CONST_ENUM_INIT: _zend_ast_kind = 777;
pub const _zend_ast_kind_ZEND_AST_FOR: _zend_ast_kind = 1024;
pub const _zend_ast_kind_ZEND_AST_FOREACH: _zend_ast_kind = 1025;
pub const _zend_ast_kind_ZEND_AST_ENUM_CASE: _zend_ast_kind = 1026;
pub const _zend_ast_kind_ZEND_AST_PROP_ELEM: _zend_ast_kind = 1027;
pub const _zend_ast_kind_ZEND_AST_PARAM: _zend_ast_kind = 1536;
pub type _zend_ast_kind = ::std::os::raw::c_uint;
pub type zend_ast_kind = u16;
pub type zend_ast_attr = u16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_ast {
    pub kind: zend_ast_kind,
    pub attr: zend_ast_attr,
    pub lineno: u32,
    pub child: [*mut zend_ast; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_ast"][::std::mem::size_of::<_zend_ast>() - 16usize];
    ["Alignment of _zend_ast"][::std::mem::align_of::<_zend_ast>() - 8usize];
    ["Offset of field: _zend_ast::kind"][::std::mem::offset_of!(_zend_ast, kind) - 0usize];
    ["Offset of field: _zend_ast::attr"][::std::mem::offset_of!(_zend_ast, attr) - 2usize];
    ["Offset of field: _zend_ast::lineno"][::std::mem::offset_of!(_zend_ast, lineno) - 4usize];
    ["Offset of field: _zend_ast::child"][::std::mem::offset_of!(_zend_ast, child) - 8usize];
};
impl Default for _zend_ast {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_ast_list {
    pub kind: zend_ast_kind,
    pub attr: zend_ast_attr,
    pub lineno: u32,
    pub children: u32,
    pub child: [*mut zend_ast; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_ast_list"][::std::mem::size_of::<_zend_ast_list>() - 24usize];
    ["Alignment of _zend_ast_list"][::std::mem::align_of::<_zend_ast_list>() - 8usize];
    ["Offset of field: _zend_ast_list::kind"]
        [::std::mem::offset_of!(_zend_ast_list, kind) - 0usize];
    ["Offset of field: _zend_ast_list::attr"]
        [::std::mem::offset_of!(_zend_ast_list, attr) - 2usize];
    ["Offset of field: _zend_ast_list::lineno"]
        [::std::mem::offset_of!(_zend_ast_list, lineno) - 4usize];
    ["Offset of field: _zend_ast_list::children"]
        [::std::mem::offset_of!(_zend_ast_list, children) - 8usize];
    ["Offset of field: _zend_ast_list::child"]
        [::std::mem::offset_of!(_zend_ast_list, child) - 16usize];
};
impl Default for _zend_ast_list {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_ast_list = _zend_ast_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_ast_zval {
    pub kind: zend_ast_kind,
    pub attr: zend_ast_attr,
    pub val: zval,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_ast_zval"][::std::mem::size_of::<_zend_ast_zval>() - 24usize];
    ["Alignment of _zend_ast_zval"][::std::mem::align_of::<_zend_ast_zval>() - 8usize];
    ["Offset of field: _zend_ast_zval::kind"]
        [::std::mem::offset_of!(_zend_ast_zval, kind) - 0usize];
    ["Offset of field: _zend_ast_zval::attr"]
        [::std::mem::offset_of!(_zend_ast_zval, attr) - 2usize];
    ["Offset of field: _zend_ast_zval::val"][::std::mem::offset_of!(_zend_ast_zval, val) - 8usize];
};
impl Default for _zend_ast_zval {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_ast_zval = _zend_ast_zval;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_ast_decl {
    pub kind: zend_ast_kind,
    pub attr: zend_ast_attr,
    pub start_lineno: u32,
    pub end_lineno: u32,
    pub flags: u32,
    pub doc_comment: *mut zend_string,
    pub name: *mut zend_string,
    pub child: [*mut zend_ast; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_ast_decl"][::std::mem::size_of::<_zend_ast_decl>() - 72usize];
    ["Alignment of _zend_ast_decl"][::std::mem::align_of::<_zend_ast_decl>() - 8usize];
    ["Offset of field: _zend_ast_decl::kind"]
        [::std::mem::offset_of!(_zend_ast_decl, kind) - 0usize];
    ["Offset of field: _zend_ast_decl::attr"]
        [::std::mem::offset_of!(_zend_ast_decl, attr) - 2usize];
    ["Offset of field: _zend_ast_decl::start_lineno"]
        [::std::mem::offset_of!(_zend_ast_decl, start_lineno) - 4usize];
    ["Offset of field: _zend_ast_decl::end_lineno"]
        [::std::mem::offset_of!(_zend_ast_decl, end_lineno) - 8usize];
    ["Offset of field: _zend_ast_decl::flags"]
        [::std::mem::offset_of!(_zend_ast_decl, flags) - 12usize];
    ["Offset of field: _zend_ast_decl::doc_comment"]
        [::std::mem::offset_of!(_zend_ast_decl, doc_comment) - 16usize];
    ["Offset of field: _zend_ast_decl::name"]
        [::std::mem::offset_of!(_zend_ast_decl, name) - 24usize];
    ["Offset of field: _zend_ast_decl::child"]
        [::std::mem::offset_of!(_zend_ast_decl, child) - 32usize];
};
impl Default for _zend_ast_decl {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_ast_decl = _zend_ast_decl;
pub type zend_ast_process_t = ::std::option::Option<unsafe extern "C" fn(ast: *mut zend_ast)>;
unsafe extern "C" {
    pub static mut zend_ast_process: zend_ast_process_t;
}
unsafe extern "C" {
    pub fn zend_ast_create_zval_with_lineno(zv: *mut zval, lineno: u32) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_create_zval_ex(zv: *mut zval, attr: zend_ast_attr) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_create_zval(zv: *mut zval) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_create_zval_from_str(str_: *mut zend_string) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_create_zval_from_long(lval: zend_long) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_create_constant(name: *mut zend_string, attr: zend_ast_attr) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_create_class_const_or_name(
        class_name: *mut zend_ast,
        name: *mut zend_ast,
    ) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_create_0(kind: zend_ast_kind) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_create_1(kind: zend_ast_kind, child: *mut zend_ast) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_create_2(
        kind: zend_ast_kind,
        child1: *mut zend_ast,
        child2: *mut zend_ast,
    ) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_create_3(
        kind: zend_ast_kind,
        child1: *mut zend_ast,
        child2: *mut zend_ast,
        child3: *mut zend_ast,
    ) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_create_4(
        kind: zend_ast_kind,
        child1: *mut zend_ast,
        child2: *mut zend_ast,
        child3: *mut zend_ast,
        child4: *mut zend_ast,
    ) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_create_5(
        kind: zend_ast_kind,
        child1: *mut zend_ast,
        child2: *mut zend_ast,
        child3: *mut zend_ast,
        child4: *mut zend_ast,
        child5: *mut zend_ast,
    ) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_create_va(
        kind: zend_ast_kind,
        attr: zend_ast_attr,
        va: *mut va_list,
    ) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_create_n(kind: ::std::os::raw::c_uint, ...) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_create_ex_n(
        kind: zend_ast_kind,
        attr: ::std::os::raw::c_uint,
        ...
    ) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_create_list_0(kind: zend_ast_kind) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_create_list_1(kind: zend_ast_kind, child: *mut zend_ast) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_create_list_2(
        kind: zend_ast_kind,
        child1: *mut zend_ast,
        child2: *mut zend_ast,
    ) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_list_add(list: *mut zend_ast, op: *mut zend_ast) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_create_decl(
        kind: zend_ast_kind,
        flags: u32,
        start_lineno: u32,
        doc_comment: *mut zend_string,
        name: *mut zend_string,
        child0: *mut zend_ast,
        child1: *mut zend_ast,
        child2: *mut zend_ast,
        child3: *mut zend_ast,
        child4: *mut zend_ast,
    ) -> *mut zend_ast;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct zend_ast_evaluate_ctx {
    pub had_side_effects: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of zend_ast_evaluate_ctx"][::std::mem::size_of::<zend_ast_evaluate_ctx>() - 1usize];
    ["Alignment of zend_ast_evaluate_ctx"]
        [::std::mem::align_of::<zend_ast_evaluate_ctx>() - 1usize];
    ["Offset of field: zend_ast_evaluate_ctx::had_side_effects"]
        [::std::mem::offset_of!(zend_ast_evaluate_ctx, had_side_effects) - 0usize];
};
unsafe extern "C" {
    pub fn zend_ast_evaluate(
        result: *mut zval,
        ast: *mut zend_ast,
        scope: *mut zend_class_entry,
    ) -> zend_result;
}
unsafe extern "C" {
    pub fn zend_ast_evaluate_ex(
        result: *mut zval,
        ast: *mut zend_ast,
        scope: *mut zend_class_entry,
        short_circuited_ptr: *mut bool,
        ctx: *mut zend_ast_evaluate_ctx,
    ) -> zend_result;
}
unsafe extern "C" {
    pub fn zend_ast_export(
        prefix: *const ::std::os::raw::c_char,
        ast: *mut zend_ast,
        suffix: *const ::std::os::raw::c_char,
    ) -> *mut zend_string;
}
unsafe extern "C" {
    pub fn zend_ast_copy(ast: *mut zend_ast) -> *mut zend_ast_ref;
}
unsafe extern "C" {
    pub fn zend_ast_destroy(ast: *mut zend_ast);
}
unsafe extern "C" {
    pub fn zend_ast_ref_destroy(ast: *mut zend_ast_ref);
}
pub type zend_ast_apply_func = ::std::option::Option<
    unsafe extern "C" fn(ast_ptr: *mut *mut zend_ast, context: *mut ::std::os::raw::c_void),
>;
unsafe extern "C" {
    pub fn zend_ast_apply(
        ast: *mut zend_ast,
        fn_: zend_ast_apply_func,
        context: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn zend_ast_create_concat_op(op0: *mut zend_ast, op1: *mut zend_ast) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn zend_ast_with_attributes(ast: *mut zend_ast, attr: *mut zend_ast) -> *mut zend_ast;
}
unsafe extern "C" {
    pub fn rc_dtor_func(p: *mut zend_refcounted);
}
unsafe extern "C" {
    pub fn zval_copy_ctor_func(zvalue: *mut zval);
}
unsafe extern "C" {
    pub fn zval_ptr_dtor(zval_ptr: *mut zval);
}
unsafe extern "C" {
    pub fn zval_internal_ptr_dtor(zvalue: *mut zval);
}
unsafe extern "C" {
    pub fn zval_add_ref(p: *mut zval);
}
pub type zend_object_iterator = _zend_object_iterator;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _zend_object_iterator_funcs {
    pub dtor: ::std::option::Option<unsafe extern "C" fn(iter: *mut zend_object_iterator)>,
    pub valid:
        ::std::option::Option<unsafe extern "C" fn(iter: *mut zend_object_iterator) -> zend_result>,
    pub get_current_data:
        ::std::option::Option<unsafe extern "C" fn(iter: *mut zend_object_iterator) -> *mut zval>,
    pub get_current_key: ::std::option::Option<
        unsafe extern "C" fn(iter: *mut zend_object_iterator, key: *mut zval),
    >,
    pub move_forward: ::std::option::Option<unsafe extern "C" fn(iter: *mut zend_object_iterator)>,
    pub rewind: ::std::option::Option<unsafe extern "C" fn(iter: *mut zend_object_iterator)>,
    pub invalidate_current:
        ::std::option::Option<unsafe extern "C" fn(iter: *mut zend_object_iterator)>,
    pub get_gc: ::std::option::Option<
        unsafe extern "C" fn(
            iter: *mut zend_object_iterator,
            table: *mut *mut zval,
            n: *mut ::std::os::raw::c_int,
        ) -> *mut HashTable,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_object_iterator_funcs"]
        [::std::mem::size_of::<_zend_object_iterator_funcs>() - 64usize];
    ["Alignment of _zend_object_iterator_funcs"]
        [::std::mem::align_of::<_zend_object_iterator_funcs>() - 8usize];
    ["Offset of field: _zend_object_iterator_funcs::dtor"]
        [::std::mem::offset_of!(_zend_object_iterator_funcs, dtor) - 0usize];
    ["Offset of field: _zend_object_iterator_funcs::valid"]
        [::std::mem::offset_of!(_zend_object_iterator_funcs, valid) - 8usize];
    ["Offset of field: _zend_object_iterator_funcs::get_current_data"]
        [::std::mem::offset_of!(_zend_object_iterator_funcs, get_current_data) - 16usize];
    ["Offset of field: _zend_object_iterator_funcs::get_current_key"]
        [::std::mem::offset_of!(_zend_object_iterator_funcs, get_current_key) - 24usize];
    ["Offset of field: _zend_object_iterator_funcs::move_forward"]
        [::std::mem::offset_of!(_zend_object_iterator_funcs, move_forward) - 32usize];
    ["Offset of field: _zend_object_iterator_funcs::rewind"]
        [::std::mem::offset_of!(_zend_object_iterator_funcs, rewind) - 40usize];
    ["Offset of field: _zend_object_iterator_funcs::invalidate_current"]
        [::std::mem::offset_of!(_zend_object_iterator_funcs, invalidate_current) - 48usize];
    ["Offset of field: _zend_object_iterator_funcs::get_gc"]
        [::std::mem::offset_of!(_zend_object_iterator_funcs, get_gc) - 56usize];
};
pub type zend_object_iterator_funcs = _zend_object_iterator_funcs;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_object_iterator {
    pub std: zend_object,
    pub data: zval,
    pub funcs: *const zend_object_iterator_funcs,
    pub index: zend_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_object_iterator"][::std::mem::size_of::<_zend_object_iterator>() - 88usize];
    ["Alignment of _zend_object_iterator"]
        [::std::mem::align_of::<_zend_object_iterator>() - 8usize];
    ["Offset of field: _zend_object_iterator::std"]
        [::std::mem::offset_of!(_zend_object_iterator, std) - 0usize];
    ["Offset of field: _zend_object_iterator::data"]
        [::std::mem::offset_of!(_zend_object_iterator, data) - 56usize];
    ["Offset of field: _zend_object_iterator::funcs"]
        [::std::mem::offset_of!(_zend_object_iterator, funcs) - 72usize];
    ["Offset of field: _zend_object_iterator::index"]
        [::std::mem::offset_of!(_zend_object_iterator, index) - 80usize];
};
impl Default for _zend_object_iterator {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_class_iterator_funcs {
    pub zf_new_iterator: *mut zend_function,
    pub zf_valid: *mut zend_function,
    pub zf_current: *mut zend_function,
    pub zf_key: *mut zend_function,
    pub zf_next: *mut zend_function,
    pub zf_rewind: *mut zend_function,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_class_iterator_funcs"]
        [::std::mem::size_of::<_zend_class_iterator_funcs>() - 48usize];
    ["Alignment of _zend_class_iterator_funcs"]
        [::std::mem::align_of::<_zend_class_iterator_funcs>() - 8usize];
    ["Offset of field: _zend_class_iterator_funcs::zf_new_iterator"]
        [::std::mem::offset_of!(_zend_class_iterator_funcs, zf_new_iterator) - 0usize];
    ["Offset of field: _zend_class_iterator_funcs::zf_valid"]
        [::std::mem::offset_of!(_zend_class_iterator_funcs, zf_valid) - 8usize];
    ["Offset of field: _zend_class_iterator_funcs::zf_current"]
        [::std::mem::offset_of!(_zend_class_iterator_funcs, zf_current) - 16usize];
    ["Offset of field: _zend_class_iterator_funcs::zf_key"]
        [::std::mem::offset_of!(_zend_class_iterator_funcs, zf_key) - 24usize];
    ["Offset of field: _zend_class_iterator_funcs::zf_next"]
        [::std::mem::offset_of!(_zend_class_iterator_funcs, zf_next) - 32usize];
    ["Offset of field: _zend_class_iterator_funcs::zf_rewind"]
        [::std::mem::offset_of!(_zend_class_iterator_funcs, zf_rewind) - 40usize];
};
impl Default for _zend_class_iterator_funcs {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_class_iterator_funcs = _zend_class_iterator_funcs;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_class_arrayaccess_funcs {
    pub zf_offsetget: *mut zend_function,
    pub zf_offsetexists: *mut zend_function,
    pub zf_offsetset: *mut zend_function,
    pub zf_offsetunset: *mut zend_function,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_class_arrayaccess_funcs"]
        [::std::mem::size_of::<_zend_class_arrayaccess_funcs>() - 32usize];
    ["Alignment of _zend_class_arrayaccess_funcs"]
        [::std::mem::align_of::<_zend_class_arrayaccess_funcs>() - 8usize];
    ["Offset of field: _zend_class_arrayaccess_funcs::zf_offsetget"]
        [::std::mem::offset_of!(_zend_class_arrayaccess_funcs, zf_offsetget) - 0usize];
    ["Offset of field: _zend_class_arrayaccess_funcs::zf_offsetexists"]
        [::std::mem::offset_of!(_zend_class_arrayaccess_funcs, zf_offsetexists) - 8usize];
    ["Offset of field: _zend_class_arrayaccess_funcs::zf_offsetset"]
        [::std::mem::offset_of!(_zend_class_arrayaccess_funcs, zf_offsetset) - 16usize];
    ["Offset of field: _zend_class_arrayaccess_funcs::zf_offsetunset"]
        [::std::mem::offset_of!(_zend_class_arrayaccess_funcs, zf_offsetunset) - 24usize];
};
impl Default for _zend_class_arrayaccess_funcs {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_class_arrayaccess_funcs = _zend_class_arrayaccess_funcs;
unsafe extern "C" {
    pub fn zend_iterator_unwrap(array_ptr: *mut zval) -> *mut zend_object_iterator;
}
unsafe extern "C" {
    pub fn zend_iterator_init(iter: *mut zend_object_iterator);
}
unsafe extern "C" {
    pub fn zend_iterator_dtor(iter: *mut zend_object_iterator);
}
unsafe extern "C" {
    pub fn zend_register_iterator_wrapper();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct stat {
    pub st_dev: dev_t,
    pub st_mode: mode_t,
    pub st_nlink: nlink_t,
    pub st_ino: __darwin_ino64_t,
    pub st_uid: uid_t,
    pub st_gid: gid_t,
    pub st_rdev: dev_t,
    pub st_atimespec: timespec,
    pub st_mtimespec: timespec,
    pub st_ctimespec: timespec,
    pub st_birthtimespec: timespec,
    pub st_size: off_t,
    pub st_blocks: blkcnt_t,
    pub st_blksize: blksize_t,
    pub st_flags: __uint32_t,
    pub st_gen: __uint32_t,
    pub st_lspare: __int32_t,
    pub st_qspare: [__int64_t; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of stat"][::std::mem::size_of::<stat>() - 144usize];
    ["Alignment of stat"][::std::mem::align_of::<stat>() - 8usize];
    ["Offset of field: stat::st_dev"][::std::mem::offset_of!(stat, st_dev) - 0usize];
    ["Offset of field: stat::st_mode"][::std::mem::offset_of!(stat, st_mode) - 4usize];
    ["Offset of field: stat::st_nlink"][::std::mem::offset_of!(stat, st_nlink) - 6usize];
    ["Offset of field: stat::st_ino"][::std::mem::offset_of!(stat, st_ino) - 8usize];
    ["Offset of field: stat::st_uid"][::std::mem::offset_of!(stat, st_uid) - 16usize];
    ["Offset of field: stat::st_gid"][::std::mem::offset_of!(stat, st_gid) - 20usize];
    ["Offset of field: stat::st_rdev"][::std::mem::offset_of!(stat, st_rdev) - 24usize];
    ["Offset of field: stat::st_atimespec"][::std::mem::offset_of!(stat, st_atimespec) - 32usize];
    ["Offset of field: stat::st_mtimespec"][::std::mem::offset_of!(stat, st_mtimespec) - 48usize];
    ["Offset of field: stat::st_ctimespec"][::std::mem::offset_of!(stat, st_ctimespec) - 64usize];
    ["Offset of field: stat::st_birthtimespec"]
        [::std::mem::offset_of!(stat, st_birthtimespec) - 80usize];
    ["Offset of field: stat::st_size"][::std::mem::offset_of!(stat, st_size) - 96usize];
    ["Offset of field: stat::st_blocks"][::std::mem::offset_of!(stat, st_blocks) - 104usize];
    ["Offset of field: stat::st_blksize"][::std::mem::offset_of!(stat, st_blksize) - 112usize];
    ["Offset of field: stat::st_flags"][::std::mem::offset_of!(stat, st_flags) - 116usize];
    ["Offset of field: stat::st_gen"][::std::mem::offset_of!(stat, st_gen) - 120usize];
    ["Offset of field: stat::st_lspare"][::std::mem::offset_of!(stat, st_lspare) - 124usize];
    ["Offset of field: stat::st_qspare"][::std::mem::offset_of!(stat, st_qspare) - 128usize];
};
pub type zend_stream_fsizer_t =
    ::std::option::Option<unsafe extern "C" fn(handle: *mut ::std::os::raw::c_void) -> usize>;
pub type zend_stream_reader_t = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *mut ::std::os::raw::c_void,
        buf: *mut ::std::os::raw::c_char,
        len: usize,
    ) -> isize,
>;
pub type zend_stream_closer_t =
    ::std::option::Option<unsafe extern "C" fn(handle: *mut ::std::os::raw::c_void)>;
pub const zend_stream_type_ZEND_HANDLE_FILENAME: zend_stream_type = 0;
pub const zend_stream_type_ZEND_HANDLE_FP: zend_stream_type = 1;
pub const zend_stream_type_ZEND_HANDLE_STREAM: zend_stream_type = 2;
pub type zend_stream_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_stream {
    pub handle: *mut ::std::os::raw::c_void,
    pub isatty: ::std::os::raw::c_int,
    pub reader: zend_stream_reader_t,
    pub fsizer: zend_stream_fsizer_t,
    pub closer: zend_stream_closer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_stream"][::std::mem::size_of::<_zend_stream>() - 40usize];
    ["Alignment of _zend_stream"][::std::mem::align_of::<_zend_stream>() - 8usize];
    ["Offset of field: _zend_stream::handle"]
        [::std::mem::offset_of!(_zend_stream, handle) - 0usize];
    ["Offset of field: _zend_stream::isatty"]
        [::std::mem::offset_of!(_zend_stream, isatty) - 8usize];
    ["Offset of field: _zend_stream::reader"]
        [::std::mem::offset_of!(_zend_stream, reader) - 16usize];
    ["Offset of field: _zend_stream::fsizer"]
        [::std::mem::offset_of!(_zend_stream, fsizer) - 24usize];
    ["Offset of field: _zend_stream::closer"]
        [::std::mem::offset_of!(_zend_stream, closer) - 32usize];
};
impl Default for _zend_stream {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_stream = _zend_stream;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_file_handle {
    pub handle: _zend_file_handle__bindgen_ty_1,
    pub filename: *mut zend_string,
    pub opened_path: *mut zend_string,
    pub type_: u8,
    pub primary_script: bool,
    pub in_list: bool,
    pub buf: *mut ::std::os::raw::c_char,
    pub len: usize,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_file_handle__bindgen_ty_1 {
    pub fp: *mut FILE,
    pub stream: zend_stream,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_file_handle__bindgen_ty_1"]
        [::std::mem::size_of::<_zend_file_handle__bindgen_ty_1>() - 40usize];
    ["Alignment of _zend_file_handle__bindgen_ty_1"]
        [::std::mem::align_of::<_zend_file_handle__bindgen_ty_1>() - 8usize];
    ["Offset of field: _zend_file_handle__bindgen_ty_1::fp"]
        [::std::mem::offset_of!(_zend_file_handle__bindgen_ty_1, fp) - 0usize];
    ["Offset of field: _zend_file_handle__bindgen_ty_1::stream"]
        [::std::mem::offset_of!(_zend_file_handle__bindgen_ty_1, stream) - 0usize];
};
impl Default for _zend_file_handle__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_file_handle"][::std::mem::size_of::<_zend_file_handle>() - 80usize];
    ["Alignment of _zend_file_handle"][::std::mem::align_of::<_zend_file_handle>() - 8usize];
    ["Offset of field: _zend_file_handle::handle"]
        [::std::mem::offset_of!(_zend_file_handle, handle) - 0usize];
    ["Offset of field: _zend_file_handle::filename"]
        [::std::mem::offset_of!(_zend_file_handle, filename) - 40usize];
    ["Offset of field: _zend_file_handle::opened_path"]
        [::std::mem::offset_of!(_zend_file_handle, opened_path) - 48usize];
    ["Offset of field: _zend_file_handle::type_"]
        [::std::mem::offset_of!(_zend_file_handle, type_) - 56usize];
    ["Offset of field: _zend_file_handle::primary_script"]
        [::std::mem::offset_of!(_zend_file_handle, primary_script) - 57usize];
    ["Offset of field: _zend_file_handle::in_list"]
        [::std::mem::offset_of!(_zend_file_handle, in_list) - 58usize];
    ["Offset of field: _zend_file_handle::buf"]
        [::std::mem::offset_of!(_zend_file_handle, buf) - 64usize];
    ["Offset of field: _zend_file_handle::len"]
        [::std::mem::offset_of!(_zend_file_handle, len) - 72usize];
};
impl Default for _zend_file_handle {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_file_handle = _zend_file_handle;
unsafe extern "C" {
    pub fn zend_stream_init_fp(
        handle: *mut zend_file_handle,
        fp: *mut FILE,
        filename: *const ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn zend_stream_init_filename(
        handle: *mut zend_file_handle,
        filename: *const ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn zend_stream_init_filename_ex(handle: *mut zend_file_handle, filename: *mut zend_string);
}
unsafe extern "C" {
    pub fn zend_stream_open(handle: *mut zend_file_handle) -> zend_result;
}
unsafe extern "C" {
    pub fn zend_stream_fixup(
        file_handle: *mut zend_file_handle,
        buf: *mut *mut ::std::os::raw::c_char,
        len: *mut usize,
    ) -> zend_result;
}
unsafe extern "C" {
    pub fn zend_destroy_file_handle(file_handle: *mut zend_file_handle);
}
unsafe extern "C" {
    pub fn zend_stream_init();
}
unsafe extern "C" {
    pub fn zend_stream_shutdown();
}
pub type zend_stat_t = stat;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct smart_str {
    #[doc = " See smart_str_extract()"]
    pub s: *mut zend_string,
    pub a: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of smart_str"][::std::mem::size_of::<smart_str>() - 16usize];
    ["Alignment of smart_str"][::std::mem::align_of::<smart_str>() - 8usize];
    ["Offset of field: smart_str::s"][::std::mem::offset_of!(smart_str, s) - 0usize];
    ["Offset of field: smart_str::a"][::std::mem::offset_of!(smart_str, a) - 8usize];
};
impl Default for smart_str {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct smart_string {
    pub c: *mut ::std::os::raw::c_char,
    pub len: usize,
    pub a: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of smart_string"][::std::mem::size_of::<smart_string>() - 24usize];
    ["Alignment of smart_string"][::std::mem::align_of::<smart_string>() - 8usize];
    ["Offset of field: smart_string::c"][::std::mem::offset_of!(smart_string, c) - 0usize];
    ["Offset of field: smart_string::len"][::std::mem::offset_of!(smart_string, len) - 8usize];
    ["Offset of field: smart_string::a"][::std::mem::offset_of!(smart_string, a) - 16usize];
};
impl Default for smart_string {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_signal_entry_t {
    pub flags: ::std::os::raw::c_int,
    pub handler: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_signal_entry_t"][::std::mem::size_of::<_zend_signal_entry_t>() - 16usize];
    ["Alignment of _zend_signal_entry_t"][::std::mem::align_of::<_zend_signal_entry_t>() - 8usize];
    ["Offset of field: _zend_signal_entry_t::flags"]
        [::std::mem::offset_of!(_zend_signal_entry_t, flags) - 0usize];
    ["Offset of field: _zend_signal_entry_t::handler"]
        [::std::mem::offset_of!(_zend_signal_entry_t, handler) - 8usize];
};
impl Default for _zend_signal_entry_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_signal_entry_t = _zend_signal_entry_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_signal_t {
    pub signo: ::std::os::raw::c_int,
    pub siginfo: *mut siginfo_t,
    pub context: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_signal_t"][::std::mem::size_of::<_zend_signal_t>() - 24usize];
    ["Alignment of _zend_signal_t"][::std::mem::align_of::<_zend_signal_t>() - 8usize];
    ["Offset of field: _zend_signal_t::signo"]
        [::std::mem::offset_of!(_zend_signal_t, signo) - 0usize];
    ["Offset of field: _zend_signal_t::siginfo"]
        [::std::mem::offset_of!(_zend_signal_t, siginfo) - 8usize];
    ["Offset of field: _zend_signal_t::context"]
        [::std::mem::offset_of!(_zend_signal_t, context) - 16usize];
};
impl Default for _zend_signal_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_signal_t = _zend_signal_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_signal_queue_t {
    pub zend_signal: zend_signal_t,
    pub next: *mut _zend_signal_queue_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_signal_queue_t"][::std::mem::size_of::<_zend_signal_queue_t>() - 32usize];
    ["Alignment of _zend_signal_queue_t"][::std::mem::align_of::<_zend_signal_queue_t>() - 8usize];
    ["Offset of field: _zend_signal_queue_t::zend_signal"]
        [::std::mem::offset_of!(_zend_signal_queue_t, zend_signal) - 0usize];
    ["Offset of field: _zend_signal_queue_t::next"]
        [::std::mem::offset_of!(_zend_signal_queue_t, next) - 24usize];
};
impl Default for _zend_signal_queue_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_signal_queue_t = _zend_signal_queue_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_signal_globals_t {
    pub depth: ::std::os::raw::c_int,
    pub blocked: ::std::os::raw::c_int,
    pub running: ::std::os::raw::c_int,
    pub active: ::std::os::raw::c_int,
    pub check: bool,
    pub reset: bool,
    pub handlers: [zend_signal_entry_t; 32usize],
    pub pstorage: [zend_signal_queue_t; 64usize],
    pub phead: *mut zend_signal_queue_t,
    pub ptail: *mut zend_signal_queue_t,
    pub pavail: *mut zend_signal_queue_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_signal_globals_t"][::std::mem::size_of::<_zend_signal_globals_t>() - 2608usize];
    ["Alignment of _zend_signal_globals_t"]
        [::std::mem::align_of::<_zend_signal_globals_t>() - 8usize];
    ["Offset of field: _zend_signal_globals_t::depth"]
        [::std::mem::offset_of!(_zend_signal_globals_t, depth) - 0usize];
    ["Offset of field: _zend_signal_globals_t::blocked"]
        [::std::mem::offset_of!(_zend_signal_globals_t, blocked) - 4usize];
    ["Offset of field: _zend_signal_globals_t::running"]
        [::std::mem::offset_of!(_zend_signal_globals_t, running) - 8usize];
    ["Offset of field: _zend_signal_globals_t::active"]
        [::std::mem::offset_of!(_zend_signal_globals_t, active) - 12usize];
    ["Offset of field: _zend_signal_globals_t::check"]
        [::std::mem::offset_of!(_zend_signal_globals_t, check) - 16usize];
    ["Offset of field: _zend_signal_globals_t::reset"]
        [::std::mem::offset_of!(_zend_signal_globals_t, reset) - 17usize];
    ["Offset of field: _zend_signal_globals_t::handlers"]
        [::std::mem::offset_of!(_zend_signal_globals_t, handlers) - 24usize];
    ["Offset of field: _zend_signal_globals_t::pstorage"]
        [::std::mem::offset_of!(_zend_signal_globals_t, pstorage) - 536usize];
    ["Offset of field: _zend_signal_globals_t::phead"]
        [::std::mem::offset_of!(_zend_signal_globals_t, phead) - 2584usize];
    ["Offset of field: _zend_signal_globals_t::ptail"]
        [::std::mem::offset_of!(_zend_signal_globals_t, ptail) - 2592usize];
    ["Offset of field: _zend_signal_globals_t::pavail"]
        [::std::mem::offset_of!(_zend_signal_globals_t, pavail) - 2600usize];
};
impl Default for _zend_signal_globals_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_signal_globals_t = _zend_signal_globals_t;
unsafe extern "C" {
    pub static mut zend_signal_globals: zend_signal_globals_t;
}
unsafe extern "C" {
    pub fn zend_signal_handler_unblock();
}
unsafe extern "C" {
    pub fn zend_signal_activate();
}
unsafe extern "C" {
    pub fn zend_signal_deactivate();
}
unsafe extern "C" {
    pub fn zend_signal_startup();
}
unsafe extern "C" {
    pub fn zend_signal_init();
}
unsafe extern "C" {
    pub fn zend_signal(
        signo: ::std::os::raw::c_int,
        handler: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
    );
}
unsafe extern "C" {
    pub fn zend_sigaction(
        signo: ::std::os::raw::c_int,
        act: *const sigaction,
        oldact: *mut sigaction,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_serialize_data {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_unserialize_data {
    _unused: [u8; 0],
}
pub type zend_serialize_data = _zend_serialize_data;
pub type zend_unserialize_data = _zend_unserialize_data;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_class_name {
    pub name: *mut zend_string,
    pub lc_name: *mut zend_string,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_class_name"][::std::mem::size_of::<_zend_class_name>() - 16usize];
    ["Alignment of _zend_class_name"][::std::mem::align_of::<_zend_class_name>() - 8usize];
    ["Offset of field: _zend_class_name::name"]
        [::std::mem::offset_of!(_zend_class_name, name) - 0usize];
    ["Offset of field: _zend_class_name::lc_name"]
        [::std::mem::offset_of!(_zend_class_name, lc_name) - 8usize];
};
impl Default for _zend_class_name {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_class_name = _zend_class_name;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_trait_method_reference {
    pub method_name: *mut zend_string,
    pub class_name: *mut zend_string,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_trait_method_reference"]
        [::std::mem::size_of::<_zend_trait_method_reference>() - 16usize];
    ["Alignment of _zend_trait_method_reference"]
        [::std::mem::align_of::<_zend_trait_method_reference>() - 8usize];
    ["Offset of field: _zend_trait_method_reference::method_name"]
        [::std::mem::offset_of!(_zend_trait_method_reference, method_name) - 0usize];
    ["Offset of field: _zend_trait_method_reference::class_name"]
        [::std::mem::offset_of!(_zend_trait_method_reference, class_name) - 8usize];
};
impl Default for _zend_trait_method_reference {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_trait_method_reference = _zend_trait_method_reference;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_trait_precedence {
    pub trait_method: zend_trait_method_reference,
    pub num_excludes: u32,
    pub exclude_class_names: [*mut zend_string; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_trait_precedence"][::std::mem::size_of::<_zend_trait_precedence>() - 32usize];
    ["Alignment of _zend_trait_precedence"]
        [::std::mem::align_of::<_zend_trait_precedence>() - 8usize];
    ["Offset of field: _zend_trait_precedence::trait_method"]
        [::std::mem::offset_of!(_zend_trait_precedence, trait_method) - 0usize];
    ["Offset of field: _zend_trait_precedence::num_excludes"]
        [::std::mem::offset_of!(_zend_trait_precedence, num_excludes) - 16usize];
    ["Offset of field: _zend_trait_precedence::exclude_class_names"]
        [::std::mem::offset_of!(_zend_trait_precedence, exclude_class_names) - 24usize];
};
impl Default for _zend_trait_precedence {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_trait_precedence = _zend_trait_precedence;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_trait_alias {
    pub trait_method: zend_trait_method_reference,
    #[doc = " name for method to be added"]
    pub alias: *mut zend_string,
    #[doc = " modifiers to be set on trait method"]
    pub modifiers: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_trait_alias"][::std::mem::size_of::<_zend_trait_alias>() - 32usize];
    ["Alignment of _zend_trait_alias"][::std::mem::align_of::<_zend_trait_alias>() - 8usize];
    ["Offset of field: _zend_trait_alias::trait_method"]
        [::std::mem::offset_of!(_zend_trait_alias, trait_method) - 0usize];
    ["Offset of field: _zend_trait_alias::alias"]
        [::std::mem::offset_of!(_zend_trait_alias, alias) - 16usize];
    ["Offset of field: _zend_trait_alias::modifiers"]
        [::std::mem::offset_of!(_zend_trait_alias, modifiers) - 24usize];
};
impl Default for _zend_trait_alias {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_trait_alias = _zend_trait_alias;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_class_mutable_data {
    pub default_properties_table: *mut zval,
    pub constants_table: *mut HashTable,
    pub ce_flags: u32,
    pub backed_enum_table: *mut HashTable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_class_mutable_data"]
        [::std::mem::size_of::<_zend_class_mutable_data>() - 32usize];
    ["Alignment of _zend_class_mutable_data"]
        [::std::mem::align_of::<_zend_class_mutable_data>() - 8usize];
    ["Offset of field: _zend_class_mutable_data::default_properties_table"]
        [::std::mem::offset_of!(_zend_class_mutable_data, default_properties_table) - 0usize];
    ["Offset of field: _zend_class_mutable_data::constants_table"]
        [::std::mem::offset_of!(_zend_class_mutable_data, constants_table) - 8usize];
    ["Offset of field: _zend_class_mutable_data::ce_flags"]
        [::std::mem::offset_of!(_zend_class_mutable_data, ce_flags) - 16usize];
    ["Offset of field: _zend_class_mutable_data::backed_enum_table"]
        [::std::mem::offset_of!(_zend_class_mutable_data, backed_enum_table) - 24usize];
};
impl Default for _zend_class_mutable_data {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_class_mutable_data = _zend_class_mutable_data;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_class_dependency {
    pub name: *mut zend_string,
    pub ce: *mut zend_class_entry,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_class_dependency"][::std::mem::size_of::<_zend_class_dependency>() - 16usize];
    ["Alignment of _zend_class_dependency"]
        [::std::mem::align_of::<_zend_class_dependency>() - 8usize];
    ["Offset of field: _zend_class_dependency::name"]
        [::std::mem::offset_of!(_zend_class_dependency, name) - 0usize];
    ["Offset of field: _zend_class_dependency::ce"]
        [::std::mem::offset_of!(_zend_class_dependency, ce) - 8usize];
};
impl Default for _zend_class_dependency {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_class_dependency = _zend_class_dependency;
pub type zend_inheritance_cache_entry = _zend_inheritance_cache_entry;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_error_info {
    pub type_: ::std::os::raw::c_int,
    pub lineno: u32,
    pub filename: *mut zend_string,
    pub message: *mut zend_string,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_error_info"][::std::mem::size_of::<_zend_error_info>() - 24usize];
    ["Alignment of _zend_error_info"][::std::mem::align_of::<_zend_error_info>() - 8usize];
    ["Offset of field: _zend_error_info::type_"]
        [::std::mem::offset_of!(_zend_error_info, type_) - 0usize];
    ["Offset of field: _zend_error_info::lineno"]
        [::std::mem::offset_of!(_zend_error_info, lineno) - 4usize];
    ["Offset of field: _zend_error_info::filename"]
        [::std::mem::offset_of!(_zend_error_info, filename) - 8usize];
    ["Offset of field: _zend_error_info::message"]
        [::std::mem::offset_of!(_zend_error_info, message) - 16usize];
};
impl Default for _zend_error_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_error_info = _zend_error_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_inheritance_cache_entry {
    pub next: *mut zend_inheritance_cache_entry,
    pub ce: *mut zend_class_entry,
    pub parent: *mut zend_class_entry,
    pub dependencies: *mut zend_class_dependency,
    pub dependencies_count: u32,
    pub num_warnings: u32,
    pub warnings: *mut *mut zend_error_info,
    pub traits_and_interfaces: [*mut zend_class_entry; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_inheritance_cache_entry"]
        [::std::mem::size_of::<_zend_inheritance_cache_entry>() - 56usize];
    ["Alignment of _zend_inheritance_cache_entry"]
        [::std::mem::align_of::<_zend_inheritance_cache_entry>() - 8usize];
    ["Offset of field: _zend_inheritance_cache_entry::next"]
        [::std::mem::offset_of!(_zend_inheritance_cache_entry, next) - 0usize];
    ["Offset of field: _zend_inheritance_cache_entry::ce"]
        [::std::mem::offset_of!(_zend_inheritance_cache_entry, ce) - 8usize];
    ["Offset of field: _zend_inheritance_cache_entry::parent"]
        [::std::mem::offset_of!(_zend_inheritance_cache_entry, parent) - 16usize];
    ["Offset of field: _zend_inheritance_cache_entry::dependencies"]
        [::std::mem::offset_of!(_zend_inheritance_cache_entry, dependencies) - 24usize];
    ["Offset of field: _zend_inheritance_cache_entry::dependencies_count"]
        [::std::mem::offset_of!(_zend_inheritance_cache_entry, dependencies_count) - 32usize];
    ["Offset of field: _zend_inheritance_cache_entry::num_warnings"]
        [::std::mem::offset_of!(_zend_inheritance_cache_entry, num_warnings) - 36usize];
    ["Offset of field: _zend_inheritance_cache_entry::warnings"]
        [::std::mem::offset_of!(_zend_inheritance_cache_entry, warnings) - 40usize];
    ["Offset of field: _zend_inheritance_cache_entry::traits_and_interfaces"]
        [::std::mem::offset_of!(_zend_inheritance_cache_entry, traits_and_interfaces) - 48usize];
};
impl Default for _zend_inheritance_cache_entry {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_class_entry {
    pub type_: ::std::os::raw::c_char,
    pub name: *mut zend_string,
    pub __bindgen_anon_1: _zend_class_entry__bindgen_ty_1,
    pub refcount: ::std::os::raw::c_int,
    pub ce_flags: u32,
    pub default_properties_count: ::std::os::raw::c_int,
    pub default_static_members_count: ::std::os::raw::c_int,
    pub default_properties_table: *mut zval,
    pub default_static_members_table: *mut zval,
    pub static_members_table__ptr: *mut zval,
    pub function_table: HashTable,
    pub properties_info: HashTable,
    pub constants_table: HashTable,
    pub mutable_data__ptr: *mut zend_class_mutable_data,
    pub inheritance_cache: *mut zend_inheritance_cache_entry,
    pub properties_info_table: *mut *mut _zend_property_info,
    pub constructor: *mut zend_function,
    pub destructor: *mut zend_function,
    pub clone: *mut zend_function,
    pub __get: *mut zend_function,
    pub __set: *mut zend_function,
    pub __unset: *mut zend_function,
    pub __isset: *mut zend_function,
    pub __call: *mut zend_function,
    pub __callstatic: *mut zend_function,
    pub __tostring: *mut zend_function,
    pub __debugInfo: *mut zend_function,
    pub __serialize: *mut zend_function,
    pub __unserialize: *mut zend_function,
    pub default_object_handlers: *const zend_object_handlers,
    pub iterator_funcs_ptr: *mut zend_class_iterator_funcs,
    pub arrayaccess_funcs_ptr: *mut zend_class_arrayaccess_funcs,
    pub __bindgen_anon_2: _zend_class_entry__bindgen_ty_2,
    pub get_iterator: ::std::option::Option<
        unsafe extern "C" fn(
            ce: *mut zend_class_entry,
            object: *mut zval,
            by_ref: ::std::os::raw::c_int,
        ) -> *mut zend_object_iterator,
    >,
    pub get_static_method: ::std::option::Option<
        unsafe extern "C" fn(
            ce: *mut zend_class_entry,
            method: *mut zend_string,
        ) -> *mut zend_function,
    >,
    pub serialize: ::std::option::Option<
        unsafe extern "C" fn(
            object: *mut zval,
            buffer: *mut *mut ::std::os::raw::c_uchar,
            buf_len: *mut usize,
            data: *mut zend_serialize_data,
        ) -> ::std::os::raw::c_int,
    >,
    pub unserialize: ::std::option::Option<
        unsafe extern "C" fn(
            object: *mut zval,
            ce: *mut zend_class_entry,
            buf: *const ::std::os::raw::c_uchar,
            buf_len: usize,
            data: *mut zend_unserialize_data,
        ) -> ::std::os::raw::c_int,
    >,
    pub num_interfaces: u32,
    pub num_traits: u32,
    pub num_hooked_props: u32,
    pub num_hooked_prop_variance_checks: u32,
    pub __bindgen_anon_3: _zend_class_entry__bindgen_ty_3,
    pub trait_names: *mut zend_class_name,
    pub trait_aliases: *mut *mut zend_trait_alias,
    pub trait_precedences: *mut *mut zend_trait_precedence,
    pub attributes: *mut HashTable,
    pub enum_backing_type: u32,
    pub backed_enum_table: *mut HashTable,
    pub doc_comment: *mut zend_string,
    pub info: _zend_class_entry__bindgen_ty_4,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_class_entry__bindgen_ty_1 {
    pub parent: *mut zend_class_entry,
    pub parent_name: *mut zend_string,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_class_entry__bindgen_ty_1"]
        [::std::mem::size_of::<_zend_class_entry__bindgen_ty_1>() - 8usize];
    ["Alignment of _zend_class_entry__bindgen_ty_1"]
        [::std::mem::align_of::<_zend_class_entry__bindgen_ty_1>() - 8usize];
    ["Offset of field: _zend_class_entry__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(_zend_class_entry__bindgen_ty_1, parent) - 0usize];
    ["Offset of field: _zend_class_entry__bindgen_ty_1::parent_name"]
        [::std::mem::offset_of!(_zend_class_entry__bindgen_ty_1, parent_name) - 0usize];
};
impl Default for _zend_class_entry__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_class_entry__bindgen_ty_2 {
    pub create_object: ::std::option::Option<
        unsafe extern "C" fn(class_type: *mut zend_class_entry) -> *mut zend_object,
    >,
    pub interface_gets_implemented: ::std::option::Option<
        unsafe extern "C" fn(
            iface: *mut zend_class_entry,
            class_type: *mut zend_class_entry,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_class_entry__bindgen_ty_2"]
        [::std::mem::size_of::<_zend_class_entry__bindgen_ty_2>() - 8usize];
    ["Alignment of _zend_class_entry__bindgen_ty_2"]
        [::std::mem::align_of::<_zend_class_entry__bindgen_ty_2>() - 8usize];
    ["Offset of field: _zend_class_entry__bindgen_ty_2::create_object"]
        [::std::mem::offset_of!(_zend_class_entry__bindgen_ty_2, create_object) - 0usize];
    ["Offset of field: _zend_class_entry__bindgen_ty_2::interface_gets_implemented"][::std::mem::offset_of!(
        _zend_class_entry__bindgen_ty_2,
        interface_gets_implemented
    ) - 0usize];
};
impl Default for _zend_class_entry__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_class_entry__bindgen_ty_3 {
    pub interfaces: *mut *mut zend_class_entry,
    pub interface_names: *mut zend_class_name,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_class_entry__bindgen_ty_3"]
        [::std::mem::size_of::<_zend_class_entry__bindgen_ty_3>() - 8usize];
    ["Alignment of _zend_class_entry__bindgen_ty_3"]
        [::std::mem::align_of::<_zend_class_entry__bindgen_ty_3>() - 8usize];
    ["Offset of field: _zend_class_entry__bindgen_ty_3::interfaces"]
        [::std::mem::offset_of!(_zend_class_entry__bindgen_ty_3, interfaces) - 0usize];
    ["Offset of field: _zend_class_entry__bindgen_ty_3::interface_names"]
        [::std::mem::offset_of!(_zend_class_entry__bindgen_ty_3, interface_names) - 0usize];
};
impl Default for _zend_class_entry__bindgen_ty_3 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_class_entry__bindgen_ty_4 {
    pub user: _zend_class_entry__bindgen_ty_4__bindgen_ty_1,
    pub internal: _zend_class_entry__bindgen_ty_4__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_class_entry__bindgen_ty_4__bindgen_ty_1 {
    pub filename: *mut zend_string,
    pub line_start: u32,
    pub line_end: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_class_entry__bindgen_ty_4__bindgen_ty_1"]
        [::std::mem::size_of::<_zend_class_entry__bindgen_ty_4__bindgen_ty_1>() - 16usize];
    ["Alignment of _zend_class_entry__bindgen_ty_4__bindgen_ty_1"]
        [::std::mem::align_of::<_zend_class_entry__bindgen_ty_4__bindgen_ty_1>() - 8usize];
    ["Offset of field: _zend_class_entry__bindgen_ty_4__bindgen_ty_1::filename"]
        [::std::mem::offset_of!(_zend_class_entry__bindgen_ty_4__bindgen_ty_1, filename) - 0usize];
    ["Offset of field: _zend_class_entry__bindgen_ty_4__bindgen_ty_1::line_start"][::std::mem::offset_of!(
        _zend_class_entry__bindgen_ty_4__bindgen_ty_1,
        line_start
    ) - 8usize];
    ["Offset of field: _zend_class_entry__bindgen_ty_4__bindgen_ty_1::line_end"]
        [::std::mem::offset_of!(_zend_class_entry__bindgen_ty_4__bindgen_ty_1, line_end) - 12usize];
};
impl Default for _zend_class_entry__bindgen_ty_4__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_class_entry__bindgen_ty_4__bindgen_ty_2 {
    pub builtin_functions: *const _zend_function_entry,
    pub module: *mut _zend_module_entry,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_class_entry__bindgen_ty_4__bindgen_ty_2"]
        [::std::mem::size_of::<_zend_class_entry__bindgen_ty_4__bindgen_ty_2>() - 16usize];
    ["Alignment of _zend_class_entry__bindgen_ty_4__bindgen_ty_2"]
        [::std::mem::align_of::<_zend_class_entry__bindgen_ty_4__bindgen_ty_2>() - 8usize];
    ["Offset of field: _zend_class_entry__bindgen_ty_4__bindgen_ty_2::builtin_functions"][::std::mem::offset_of!(
        _zend_class_entry__bindgen_ty_4__bindgen_ty_2,
        builtin_functions
    )
        - 0usize];
    ["Offset of field: _zend_class_entry__bindgen_ty_4__bindgen_ty_2::module"]
        [::std::mem::offset_of!(_zend_class_entry__bindgen_ty_4__bindgen_ty_2, module) - 8usize];
};
impl Default for _zend_class_entry__bindgen_ty_4__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_class_entry__bindgen_ty_4"]
        [::std::mem::size_of::<_zend_class_entry__bindgen_ty_4>() - 16usize];
    ["Alignment of _zend_class_entry__bindgen_ty_4"]
        [::std::mem::align_of::<_zend_class_entry__bindgen_ty_4>() - 8usize];
    ["Offset of field: _zend_class_entry__bindgen_ty_4::user"]
        [::std::mem::offset_of!(_zend_class_entry__bindgen_ty_4, user) - 0usize];
    ["Offset of field: _zend_class_entry__bindgen_ty_4::internal"]
        [::std::mem::offset_of!(_zend_class_entry__bindgen_ty_4, internal) - 0usize];
};
impl Default for _zend_class_entry__bindgen_ty_4 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_class_entry"][::std::mem::size_of::<_zend_class_entry>() - 520usize];
    ["Alignment of _zend_class_entry"][::std::mem::align_of::<_zend_class_entry>() - 8usize];
    ["Offset of field: _zend_class_entry::type_"]
        [::std::mem::offset_of!(_zend_class_entry, type_) - 0usize];
    ["Offset of field: _zend_class_entry::name"]
        [::std::mem::offset_of!(_zend_class_entry, name) - 8usize];
    ["Offset of field: _zend_class_entry::refcount"]
        [::std::mem::offset_of!(_zend_class_entry, refcount) - 24usize];
    ["Offset of field: _zend_class_entry::ce_flags"]
        [::std::mem::offset_of!(_zend_class_entry, ce_flags) - 28usize];
    ["Offset of field: _zend_class_entry::default_properties_count"]
        [::std::mem::offset_of!(_zend_class_entry, default_properties_count) - 32usize];
    ["Offset of field: _zend_class_entry::default_static_members_count"]
        [::std::mem::offset_of!(_zend_class_entry, default_static_members_count) - 36usize];
    ["Offset of field: _zend_class_entry::default_properties_table"]
        [::std::mem::offset_of!(_zend_class_entry, default_properties_table) - 40usize];
    ["Offset of field: _zend_class_entry::default_static_members_table"]
        [::std::mem::offset_of!(_zend_class_entry, default_static_members_table) - 48usize];
    ["Offset of field: _zend_class_entry::static_members_table__ptr"]
        [::std::mem::offset_of!(_zend_class_entry, static_members_table__ptr) - 56usize];
    ["Offset of field: _zend_class_entry::function_table"]
        [::std::mem::offset_of!(_zend_class_entry, function_table) - 64usize];
    ["Offset of field: _zend_class_entry::properties_info"]
        [::std::mem::offset_of!(_zend_class_entry, properties_info) - 120usize];
    ["Offset of field: _zend_class_entry::constants_table"]
        [::std::mem::offset_of!(_zend_class_entry, constants_table) - 176usize];
    ["Offset of field: _zend_class_entry::mutable_data__ptr"]
        [::std::mem::offset_of!(_zend_class_entry, mutable_data__ptr) - 232usize];
    ["Offset of field: _zend_class_entry::inheritance_cache"]
        [::std::mem::offset_of!(_zend_class_entry, inheritance_cache) - 240usize];
    ["Offset of field: _zend_class_entry::properties_info_table"]
        [::std::mem::offset_of!(_zend_class_entry, properties_info_table) - 248usize];
    ["Offset of field: _zend_class_entry::constructor"]
        [::std::mem::offset_of!(_zend_class_entry, constructor) - 256usize];
    ["Offset of field: _zend_class_entry::destructor"]
        [::std::mem::offset_of!(_zend_class_entry, destructor) - 264usize];
    ["Offset of field: _zend_class_entry::clone"]
        [::std::mem::offset_of!(_zend_class_entry, clone) - 272usize];
    ["Offset of field: _zend_class_entry::__get"]
        [::std::mem::offset_of!(_zend_class_entry, __get) - 280usize];
    ["Offset of field: _zend_class_entry::__set"]
        [::std::mem::offset_of!(_zend_class_entry, __set) - 288usize];
    ["Offset of field: _zend_class_entry::__unset"]
        [::std::mem::offset_of!(_zend_class_entry, __unset) - 296usize];
    ["Offset of field: _zend_class_entry::__isset"]
        [::std::mem::offset_of!(_zend_class_entry, __isset) - 304usize];
    ["Offset of field: _zend_class_entry::__call"]
        [::std::mem::offset_of!(_zend_class_entry, __call) - 312usize];
    ["Offset of field: _zend_class_entry::__callstatic"]
        [::std::mem::offset_of!(_zend_class_entry, __callstatic) - 320usize];
    ["Offset of field: _zend_class_entry::__tostring"]
        [::std::mem::offset_of!(_zend_class_entry, __tostring) - 328usize];
    ["Offset of field: _zend_class_entry::__debugInfo"]
        [::std::mem::offset_of!(_zend_class_entry, __debugInfo) - 336usize];
    ["Offset of field: _zend_class_entry::__serialize"]
        [::std::mem::offset_of!(_zend_class_entry, __serialize) - 344usize];
    ["Offset of field: _zend_class_entry::__unserialize"]
        [::std::mem::offset_of!(_zend_class_entry, __unserialize) - 352usize];
    ["Offset of field: _zend_class_entry::default_object_handlers"]
        [::std::mem::offset_of!(_zend_class_entry, default_object_handlers) - 360usize];
    ["Offset of field: _zend_class_entry::iterator_funcs_ptr"]
        [::std::mem::offset_of!(_zend_class_entry, iterator_funcs_ptr) - 368usize];
    ["Offset of field: _zend_class_entry::arrayaccess_funcs_ptr"]
        [::std::mem::offset_of!(_zend_class_entry, arrayaccess_funcs_ptr) - 376usize];
    ["Offset of field: _zend_class_entry::get_iterator"]
        [::std::mem::offset_of!(_zend_class_entry, get_iterator) - 392usize];
    ["Offset of field: _zend_class_entry::get_static_method"]
        [::std::mem::offset_of!(_zend_class_entry, get_static_method) - 400usize];
    ["Offset of field: _zend_class_entry::serialize"]
        [::std::mem::offset_of!(_zend_class_entry, serialize) - 408usize];
    ["Offset of field: _zend_class_entry::unserialize"]
        [::std::mem::offset_of!(_zend_class_entry, unserialize) - 416usize];
    ["Offset of field: _zend_class_entry::num_interfaces"]
        [::std::mem::offset_of!(_zend_class_entry, num_interfaces) - 424usize];
    ["Offset of field: _zend_class_entry::num_traits"]
        [::std::mem::offset_of!(_zend_class_entry, num_traits) - 428usize];
    ["Offset of field: _zend_class_entry::num_hooked_props"]
        [::std::mem::offset_of!(_zend_class_entry, num_hooked_props) - 432usize];
    ["Offset of field: _zend_class_entry::num_hooked_prop_variance_checks"]
        [::std::mem::offset_of!(_zend_class_entry, num_hooked_prop_variance_checks) - 436usize];
    ["Offset of field: _zend_class_entry::trait_names"]
        [::std::mem::offset_of!(_zend_class_entry, trait_names) - 448usize];
    ["Offset of field: _zend_class_entry::trait_aliases"]
        [::std::mem::offset_of!(_zend_class_entry, trait_aliases) - 456usize];
    ["Offset of field: _zend_class_entry::trait_precedences"]
        [::std::mem::offset_of!(_zend_class_entry, trait_precedences) - 464usize];
    ["Offset of field: _zend_class_entry::attributes"]
        [::std::mem::offset_of!(_zend_class_entry, attributes) - 472usize];
    ["Offset of field: _zend_class_entry::enum_backing_type"]
        [::std::mem::offset_of!(_zend_class_entry, enum_backing_type) - 480usize];
    ["Offset of field: _zend_class_entry::backed_enum_table"]
        [::std::mem::offset_of!(_zend_class_entry, backed_enum_table) - 488usize];
    ["Offset of field: _zend_class_entry::doc_comment"]
        [::std::mem::offset_of!(_zend_class_entry, doc_comment) - 496usize];
    ["Offset of field: _zend_class_entry::info"]
        [::std::mem::offset_of!(_zend_class_entry, info) - 504usize];
};
impl Default for _zend_class_entry {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union zend_random_bytes_insecure_state {
    pub align: zend_max_align_t,
    pub opaque: [u64; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of zend_random_bytes_insecure_state"]
        [::std::mem::size_of::<zend_random_bytes_insecure_state>() - 40usize];
    ["Alignment of zend_random_bytes_insecure_state"]
        [::std::mem::align_of::<zend_random_bytes_insecure_state>() - 8usize];
    ["Offset of field: zend_random_bytes_insecure_state::align"]
        [::std::mem::offset_of!(zend_random_bytes_insecure_state, align) - 0usize];
    ["Offset of field: zend_random_bytes_insecure_state::opaque"]
        [::std::mem::offset_of!(zend_random_bytes_insecure_state, opaque) - 0usize];
};
impl Default for zend_random_bytes_insecure_state {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _zend_utility_functions {
    pub error_function: ::std::option::Option<
        unsafe extern "C" fn(
            type_: ::std::os::raw::c_int,
            error_filename: *mut zend_string,
            error_lineno: u32,
            message: *mut zend_string,
        ),
    >,
    pub printf_function: ::std::option::Option<
        unsafe extern "C" fn(format: *const ::std::os::raw::c_char, ...) -> usize,
    >,
    pub write_function: ::std::option::Option<
        unsafe extern "C" fn(str_: *const ::std::os::raw::c_char, str_length: usize) -> usize,
    >,
    pub fopen_function: ::std::option::Option<
        unsafe extern "C" fn(
            filename: *mut zend_string,
            opened_path: *mut *mut zend_string,
        ) -> *mut FILE,
    >,
    pub message_handler: ::std::option::Option<
        unsafe extern "C" fn(message: zend_long, data: *const ::std::os::raw::c_void),
    >,
    pub get_configuration_directive:
        ::std::option::Option<unsafe extern "C" fn(name: *mut zend_string) -> *mut zval>,
    pub ticks_function: ::std::option::Option<unsafe extern "C" fn(ticks: ::std::os::raw::c_int)>,
    pub on_timeout: ::std::option::Option<unsafe extern "C" fn(seconds: ::std::os::raw::c_int)>,
    pub stream_open_function:
        ::std::option::Option<unsafe extern "C" fn(handle: *mut zend_file_handle) -> zend_result>,
    pub printf_to_smart_string_function: ::std::option::Option<
        unsafe extern "C" fn(
            buf: *mut smart_string,
            format: *const ::std::os::raw::c_char,
            ap: va_list,
        ),
    >,
    pub printf_to_smart_str_function: ::std::option::Option<
        unsafe extern "C" fn(
            buf: *mut smart_str,
            format: *const ::std::os::raw::c_char,
            ap: va_list,
        ),
    >,
    pub getenv_function: ::std::option::Option<
        unsafe extern "C" fn(
            name: *const ::std::os::raw::c_char,
            name_len: usize,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub resolve_path_function:
        ::std::option::Option<unsafe extern "C" fn(filename: *mut zend_string) -> *mut zend_string>,
    pub random_bytes_function: ::std::option::Option<
        unsafe extern "C" fn(
            bytes: *mut ::std::os::raw::c_void,
            size: usize,
            errstr: *mut ::std::os::raw::c_char,
            errstr_size: usize,
        ) -> zend_result,
    >,
    pub random_bytes_insecure_function: ::std::option::Option<
        unsafe extern "C" fn(
            state: *mut zend_random_bytes_insecure_state,
            bytes: *mut ::std::os::raw::c_void,
            size: usize,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_utility_functions"]
        [::std::mem::size_of::<_zend_utility_functions>() - 120usize];
    ["Alignment of _zend_utility_functions"]
        [::std::mem::align_of::<_zend_utility_functions>() - 8usize];
    ["Offset of field: _zend_utility_functions::error_function"]
        [::std::mem::offset_of!(_zend_utility_functions, error_function) - 0usize];
    ["Offset of field: _zend_utility_functions::printf_function"]
        [::std::mem::offset_of!(_zend_utility_functions, printf_function) - 8usize];
    ["Offset of field: _zend_utility_functions::write_function"]
        [::std::mem::offset_of!(_zend_utility_functions, write_function) - 16usize];
    ["Offset of field: _zend_utility_functions::fopen_function"]
        [::std::mem::offset_of!(_zend_utility_functions, fopen_function) - 24usize];
    ["Offset of field: _zend_utility_functions::message_handler"]
        [::std::mem::offset_of!(_zend_utility_functions, message_handler) - 32usize];
    ["Offset of field: _zend_utility_functions::get_configuration_directive"]
        [::std::mem::offset_of!(_zend_utility_functions, get_configuration_directive) - 40usize];
    ["Offset of field: _zend_utility_functions::ticks_function"]
        [::std::mem::offset_of!(_zend_utility_functions, ticks_function) - 48usize];
    ["Offset of field: _zend_utility_functions::on_timeout"]
        [::std::mem::offset_of!(_zend_utility_functions, on_timeout) - 56usize];
    ["Offset of field: _zend_utility_functions::stream_open_function"]
        [::std::mem::offset_of!(_zend_utility_functions, stream_open_function) - 64usize];
    ["Offset of field: _zend_utility_functions::printf_to_smart_string_function"][::std::mem::offset_of!(
        _zend_utility_functions,
        printf_to_smart_string_function
    ) - 72usize];
    ["Offset of field: _zend_utility_functions::printf_to_smart_str_function"]
        [::std::mem::offset_of!(_zend_utility_functions, printf_to_smart_str_function) - 80usize];
    ["Offset of field: _zend_utility_functions::getenv_function"]
        [::std::mem::offset_of!(_zend_utility_functions, getenv_function) - 88usize];
    ["Offset of field: _zend_utility_functions::resolve_path_function"]
        [::std::mem::offset_of!(_zend_utility_functions, resolve_path_function) - 96usize];
    ["Offset of field: _zend_utility_functions::random_bytes_function"]
        [::std::mem::offset_of!(_zend_utility_functions, random_bytes_function) - 104usize];
    ["Offset of field: _zend_utility_functions::random_bytes_insecure_function"][::std::mem::offset_of!(
        _zend_utility_functions,
        random_bytes_insecure_function
    ) - 112usize];
};
pub type zend_utility_functions = _zend_utility_functions;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _zend_utility_values {
    pub html_errors: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_utility_values"][::std::mem::size_of::<_zend_utility_values>() - 1usize];
    ["Alignment of _zend_utility_values"][::std::mem::align_of::<_zend_utility_values>() - 1usize];
    ["Offset of field: _zend_utility_values::html_errors"]
        [::std::mem::offset_of!(_zend_utility_values, html_errors) - 0usize];
};
pub type zend_utility_values = _zend_utility_values;
pub type zend_write_func_t = ::std::option::Option<
    unsafe extern "C" fn(str_: *const ::std::os::raw::c_char, str_length: usize) -> usize,
>;
unsafe extern "C" {
    pub fn zend_shutdown();
}
unsafe extern "C" {
    pub fn zend_register_standard_ini_entries();
}
unsafe extern "C" {
    pub fn zend_post_startup() -> zend_result;
}
unsafe extern "C" {
    pub fn zend_set_utility_values(utility_values: *mut zend_utility_values);
}
unsafe extern "C" {
    pub fn zend_unload_modules();
}
unsafe extern "C" {
    pub fn _zend_bailout(filename: *const ::std::os::raw::c_char, lineno: u32) -> !;
}
unsafe extern "C" {
    pub fn zend_get_page_size() -> usize;
}
unsafe extern "C" {
    pub fn zend_vspprintf(
        pbuf: *mut *mut ::std::os::raw::c_char,
        max_len: usize,
        format: *const ::std::os::raw::c_char,
        ap: va_list,
    ) -> usize;
}
unsafe extern "C" {
    pub fn zend_spprintf(
        message: *mut *mut ::std::os::raw::c_char,
        max_len: usize,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> usize;
}
unsafe extern "C" {
    pub fn zend_vstrpprintf(
        max_len: usize,
        format: *const ::std::os::raw::c_char,
        ap: va_list,
    ) -> *mut zend_string;
}
unsafe extern "C" {
    pub fn zend_strpprintf(
        max_len: usize,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> *mut zend_string;
}
unsafe extern "C" {
    pub fn zend_spprintf_unchecked(
        message: *mut *mut ::std::os::raw::c_char,
        max_len: usize,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> usize;
}
unsafe extern "C" {
    pub fn zend_strpprintf_unchecked(
        max_len: usize,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> *mut zend_string;
}
unsafe extern "C" {
    pub fn get_zend_version() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn zend_make_printable_zval(expr: *mut zval, expr_copy: *mut zval) -> bool;
}
unsafe extern "C" {
    pub fn zend_print_zval(expr: *mut zval, indent: ::std::os::raw::c_int) -> usize;
}
unsafe extern "C" {
    pub fn zend_print_zval_r(expr: *mut zval, indent: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn zend_print_zval_r_to_str(
        expr: *mut zval,
        indent: ::std::os::raw::c_int,
    ) -> *mut zend_string;
}
unsafe extern "C" {
    pub fn zend_print_flat_zval_r(expr: *mut zval);
}
unsafe extern "C" {
    pub fn zend_print_flat_zval_r_to_buf(str_: *mut smart_str, expr: *mut zval);
}
unsafe extern "C" {
    pub fn zend_output_debug_string(
        trigger_break: bool,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
unsafe extern "C" {
    pub fn zend_activate();
}
unsafe extern "C" {
    pub fn zend_deactivate();
}
unsafe extern "C" {
    pub fn zend_call_destructors();
}
unsafe extern "C" {
    pub fn zend_activate_modules();
}
unsafe extern "C" {
    pub fn zend_deactivate_modules();
}
unsafe extern "C" {
    pub fn zend_post_deactivate_modules();
}
unsafe extern "C" {
    pub fn free_estring(str_p: *mut *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub static mut zend_printf: ::std::option::Option<
        unsafe extern "C" fn(format: *const ::std::os::raw::c_char, ...) -> usize,
    >;
}
unsafe extern "C" {
    pub static mut zend_write: zend_write_func_t;
}
unsafe extern "C" {
    pub static mut zend_fopen: ::std::option::Option<
        unsafe extern "C" fn(
            filename: *mut zend_string,
            opened_path: *mut *mut zend_string,
        ) -> *mut FILE,
    >;
}
unsafe extern "C" {
    pub static mut zend_ticks_function:
        ::std::option::Option<unsafe extern "C" fn(ticks: ::std::os::raw::c_int)>;
}
unsafe extern "C" {
    pub static mut zend_interrupt_function:
        ::std::option::Option<unsafe extern "C" fn(execute_data: *mut zend_execute_data)>;
}
unsafe extern "C" {
    pub static mut zend_error_cb: ::std::option::Option<
        unsafe extern "C" fn(
            type_: ::std::os::raw::c_int,
            error_filename: *mut zend_string,
            error_lineno: u32,
            message: *mut zend_string,
        ),
    >;
}
unsafe extern "C" {
    pub static mut zend_on_timeout:
        ::std::option::Option<unsafe extern "C" fn(seconds: ::std::os::raw::c_int)>;
}
unsafe extern "C" {
    pub static mut zend_stream_open_function:
        ::std::option::Option<unsafe extern "C" fn(handle: *mut zend_file_handle) -> zend_result>;
}
unsafe extern "C" {
    pub static mut zend_printf_to_smart_string: ::std::option::Option<
        unsafe extern "C" fn(
            buf: *mut smart_string,
            format: *const ::std::os::raw::c_char,
            ap: va_list,
        ),
    >;
}
unsafe extern "C" {
    pub static mut zend_printf_to_smart_str: ::std::option::Option<
        unsafe extern "C" fn(
            buf: *mut smart_str,
            format: *const ::std::os::raw::c_char,
            ap: va_list,
        ),
    >;
}
unsafe extern "C" {
    pub static mut zend_getenv: ::std::option::Option<
        unsafe extern "C" fn(
            name: *const ::std::os::raw::c_char,
            name_len: usize,
        ) -> *mut ::std::os::raw::c_char,
    >;
}
unsafe extern "C" {
    pub static mut zend_resolve_path:
        ::std::option::Option<unsafe extern "C" fn(filename: *mut zend_string) -> *mut zend_string>;
}
unsafe extern "C" {
    pub static mut zend_random_bytes: ::std::option::Option<
        unsafe extern "C" fn(
            bytes: *mut ::std::os::raw::c_void,
            size: usize,
            errstr: *mut ::std::os::raw::c_char,
            errstr_size: usize,
        ) -> zend_result,
    >;
}
unsafe extern "C" {
    pub static mut zend_post_startup_cb:
        ::std::option::Option<unsafe extern "C" fn() -> zend_result>;
}
unsafe extern "C" {
    pub static mut zend_post_shutdown_cb: ::std::option::Option<unsafe extern "C" fn()>;
}
unsafe extern "C" {
    pub static mut zend_accel_schedule_restart_hook:
        ::std::option::Option<unsafe extern "C" fn(reason: ::std::os::raw::c_int)>;
}
unsafe extern "C" {
    pub fn zend_error(type_: ::std::os::raw::c_int, format: *const ::std::os::raw::c_char, ...);
}
unsafe extern "C" {
    pub fn zend_error_noreturn(
        type_: ::std::os::raw::c_int,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> !;
}
unsafe extern "C" {
    pub fn zend_error_noreturn_unchecked(
        type_: ::std::os::raw::c_int,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> !;
}
unsafe extern "C" {
    pub fn zend_error_unchecked(
        type_: ::std::os::raw::c_int,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
unsafe extern "C" {
    pub fn zend_error_at(
        type_: ::std::os::raw::c_int,
        filename: *mut zend_string,
        lineno: u32,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
unsafe extern "C" {
    pub fn zend_error_at_noreturn(
        type_: ::std::os::raw::c_int,
        filename: *mut zend_string,
        lineno: u32,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> !;
}
unsafe extern "C" {
    pub fn zend_error_zstr(type_: ::std::os::raw::c_int, message: *mut zend_string);
}
unsafe extern "C" {
    pub fn zend_error_zstr_at(
        type_: ::std::os::raw::c_int,
        filename: *mut zend_string,
        lineno: u32,
        message: *mut zend_string,
    );
}
unsafe extern "C" {
    pub fn zend_throw_error(
        exception_ce: *mut zend_class_entry,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
unsafe extern "C" {
    pub fn zend_type_error(format: *const ::std::os::raw::c_char, ...);
}
unsafe extern "C" {
    pub fn zend_argument_count_error(format: *const ::std::os::raw::c_char, ...);
}
unsafe extern "C" {
    pub fn zend_value_error(format: *const ::std::os::raw::c_char, ...);
}
unsafe extern "C" {
    pub fn zend_illegal_container_offset(
        container: *const zend_string,
        offset: *const zval,
        type_: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn zenderror(error: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn zend_strerror_noreturn(
        type_: ::std::os::raw::c_int,
        errn: ::std::os::raw::c_int,
        message: *const ::std::os::raw::c_char,
    ) -> !;
}
unsafe extern "C" {
    pub static mut zend_standard_class_def: *mut zend_class_entry;
}
unsafe extern "C" {
    pub static mut zend_uv: zend_utility_values;
}
unsafe extern "C" {
    pub static mut zend_dtrace_enabled: bool;
}
unsafe extern "C" {
    pub fn zend_message_dispatcher(message: zend_long, data: *const ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn zend_get_configuration_directive(name: *mut zend_string) -> *mut zval;
}
pub const zend_error_handling_t_EH_NORMAL: zend_error_handling_t = 0;
pub const zend_error_handling_t_EH_THROW: zend_error_handling_t = 1;
pub type zend_error_handling_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct zend_error_handling {
    pub handling: zend_error_handling_t,
    pub exception: *mut zend_class_entry,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of zend_error_handling"][::std::mem::size_of::<zend_error_handling>() - 16usize];
    ["Alignment of zend_error_handling"][::std::mem::align_of::<zend_error_handling>() - 8usize];
    ["Offset of field: zend_error_handling::handling"]
        [::std::mem::offset_of!(zend_error_handling, handling) - 0usize];
    ["Offset of field: zend_error_handling::exception"]
        [::std::mem::offset_of!(zend_error_handling, exception) - 8usize];
};
impl Default for zend_error_handling {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn zend_save_error_handling(current: *mut zend_error_handling);
}
unsafe extern "C" {
    pub fn zend_replace_error_handling(
        error_handling: zend_error_handling_t,
        exception_class: *mut zend_class_entry,
        current: *mut zend_error_handling,
    );
}
unsafe extern "C" {
    pub fn zend_restore_error_handling(saved: *mut zend_error_handling);
}
unsafe extern "C" {
    pub fn zend_begin_record_errors();
}
unsafe extern "C" {
    pub fn zend_emit_recorded_errors();
}
unsafe extern "C" {
    pub fn zend_free_recorded_errors();
}
pub const zend_property_hook_kind_ZEND_PROPERTY_HOOK_GET: zend_property_hook_kind = 0;
pub const zend_property_hook_kind_ZEND_PROPERTY_HOOK_SET: zend_property_hook_kind = 1;
pub type zend_property_hook_kind = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn zend_hooked_object_get_iterator(
        ce: *mut zend_class_entry,
        object: *mut zval,
        by_ref: ::std::os::raw::c_int,
    ) -> *mut zend_object_iterator;
}
unsafe extern "C" {
    pub fn zend_hooked_object_build_properties(zobj: *mut zend_object) -> *mut zend_array;
}
pub type zend_lazy_object_flags_t = u8;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_lazy_objects_store {
    pub infos: HashTable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_lazy_objects_store"]
        [::std::mem::size_of::<_zend_lazy_objects_store>() - 56usize];
    ["Alignment of _zend_lazy_objects_store"]
        [::std::mem::align_of::<_zend_lazy_objects_store>() - 8usize];
    ["Offset of field: _zend_lazy_objects_store::infos"]
        [::std::mem::offset_of!(_zend_lazy_objects_store, infos) - 0usize];
};
impl Default for _zend_lazy_objects_store {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_lazy_objects_store = _zend_lazy_objects_store;
pub type zend_property_info = _zend_property_info;
pub type zend_fcall_info = _zend_fcall_info;
pub type zend_fcall_info_cache = _zend_fcall_info_cache;
unsafe extern "C" {
    pub fn zend_class_can_be_lazy(ce: *mut zend_class_entry) -> bool;
}
unsafe extern "C" {
    pub fn zend_object_make_lazy(
        obj: *mut zend_object,
        class_type: *mut zend_class_entry,
        initializer_zv: *mut zval,
        initializer_fcc: *mut zend_fcall_info_cache,
        flags: zend_lazy_object_flags_t,
    ) -> *mut zend_object;
}
unsafe extern "C" {
    pub fn zend_lazy_object_init(obj: *mut zend_object) -> *mut zend_object;
}
unsafe extern "C" {
    pub fn zend_lazy_object_mark_as_initialized(obj: *mut zend_object) -> *mut zend_object;
}
unsafe extern "C" {
    pub fn zend_lazy_objects_init(store: *mut zend_lazy_objects_store);
}
unsafe extern "C" {
    pub fn zend_lazy_objects_destroy(store: *mut zend_lazy_objects_store);
}
unsafe extern "C" {
    pub fn zend_lazy_object_get_initializer_zv(obj: *mut zend_object) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_lazy_object_get_instance(obj: *mut zend_object) -> *mut zend_object;
}
unsafe extern "C" {
    pub fn zend_lazy_object_get_flags(obj: *mut zend_object) -> zend_lazy_object_flags_t;
}
unsafe extern "C" {
    pub fn zend_lazy_object_del_info(obj: *mut zend_object);
}
unsafe extern "C" {
    pub fn zend_lazy_object_get_properties(object: *mut zend_object) -> *mut HashTable;
}
unsafe extern "C" {
    pub fn zend_lazy_object_clone(old_obj: *mut zend_object) -> *mut zend_object;
}
unsafe extern "C" {
    pub fn zend_lazy_object_debug_info(
        object: *mut zend_object,
        is_temp: *mut ::std::os::raw::c_int,
    ) -> *mut HashTable;
}
unsafe extern "C" {
    pub fn zend_lazy_object_get_gc(
        zobj: *mut zend_object,
        table: *mut *mut zval,
        n: *mut ::std::os::raw::c_int,
    ) -> *mut HashTable;
}
unsafe extern "C" {
    pub fn zend_lazy_object_decr_lazy_props(obj: *mut zend_object) -> bool;
}
unsafe extern "C" {
    pub fn zend_lazy_object_realize(obj: *mut zend_object);
}
unsafe extern "C" {
    pub fn zend_lazy_object_get_property_info_for_slot(
        obj: *mut zend_object,
        slot: *mut zval,
    ) -> *mut zend_property_info;
}
pub type zend_object_read_property_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zend_object,
        member: *mut zend_string,
        type_: ::std::os::raw::c_int,
        cache_slot: *mut *mut ::std::os::raw::c_void,
        rv: *mut zval,
    ) -> *mut zval,
>;
pub type zend_object_read_dimension_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zend_object,
        offset: *mut zval,
        type_: ::std::os::raw::c_int,
        rv: *mut zval,
    ) -> *mut zval,
>;
pub type zend_object_write_property_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zend_object,
        member: *mut zend_string,
        value: *mut zval,
        cache_slot: *mut *mut ::std::os::raw::c_void,
    ) -> *mut zval,
>;
pub type zend_object_write_dimension_t = ::std::option::Option<
    unsafe extern "C" fn(object: *mut zend_object, offset: *mut zval, value: *mut zval),
>;
pub type zend_object_get_property_ptr_ptr_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zend_object,
        member: *mut zend_string,
        type_: ::std::os::raw::c_int,
        cache_slot: *mut *mut ::std::os::raw::c_void,
    ) -> *mut zval,
>;
pub type zend_object_has_property_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zend_object,
        member: *mut zend_string,
        has_set_exists: ::std::os::raw::c_int,
        cache_slot: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type zend_object_has_dimension_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zend_object,
        member: *mut zval,
        check_empty: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type zend_object_unset_property_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zend_object,
        member: *mut zend_string,
        cache_slot: *mut *mut ::std::os::raw::c_void,
    ),
>;
pub type zend_object_unset_dimension_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut zend_object, offset: *mut zval)>;
pub type zend_object_get_properties_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut zend_object) -> *mut HashTable>;
pub type zend_object_get_debug_info_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zend_object,
        is_temp: *mut ::std::os::raw::c_int,
    ) -> *mut HashTable,
>;
pub const _zend_prop_purpose_ZEND_PROP_PURPOSE_DEBUG: _zend_prop_purpose = 0;
pub const _zend_prop_purpose_ZEND_PROP_PURPOSE_ARRAY_CAST: _zend_prop_purpose = 1;
pub const _zend_prop_purpose_ZEND_PROP_PURPOSE_SERIALIZE: _zend_prop_purpose = 2;
pub const _zend_prop_purpose_ZEND_PROP_PURPOSE_VAR_EXPORT: _zend_prop_purpose = 3;
pub const _zend_prop_purpose_ZEND_PROP_PURPOSE_JSON: _zend_prop_purpose = 4;
pub const _zend_prop_purpose_ZEND_PROP_PURPOSE_GET_OBJECT_VARS: _zend_prop_purpose = 5;
pub const _zend_prop_purpose__ZEND_PROP_PURPOSE_NON_EXHAUSTIVE_ENUM: _zend_prop_purpose = 6;
pub type _zend_prop_purpose = ::std::os::raw::c_uint;
pub use self::_zend_prop_purpose as zend_prop_purpose;
pub type zend_object_get_properties_for_t = ::std::option::Option<
    unsafe extern "C" fn(object: *mut zend_object, purpose: zend_prop_purpose) -> *mut zend_array,
>;
pub type zend_object_get_method_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut *mut zend_object,
        method: *mut zend_string,
        key: *const zval,
    ) -> *mut zend_function,
>;
pub type zend_object_get_constructor_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut zend_object) -> *mut zend_function>;
pub type zend_object_free_obj_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut zend_object)>;
pub type zend_object_dtor_obj_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut zend_object)>;
pub type zend_object_clone_obj_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut zend_object) -> *mut zend_object>;
pub type zend_object_get_class_name_t =
    ::std::option::Option<unsafe extern "C" fn(object: *const zend_object) -> *mut zend_string>;
pub type zend_object_compare_t = ::std::option::Option<
    unsafe extern "C" fn(object1: *mut zval, object2: *mut zval) -> ::std::os::raw::c_int,
>;
pub type zend_object_cast_t = ::std::option::Option<
    unsafe extern "C" fn(
        readobj: *mut zend_object,
        retval: *mut zval,
        type_: ::std::os::raw::c_int,
    ) -> zend_result,
>;
pub type zend_object_count_elements_t = ::std::option::Option<
    unsafe extern "C" fn(object: *mut zend_object, count: *mut zend_long) -> zend_result,
>;
pub type zend_object_get_closure_t = ::std::option::Option<
    unsafe extern "C" fn(
        obj: *mut zend_object,
        ce_ptr: *mut *mut zend_class_entry,
        fptr_ptr: *mut *mut zend_function,
        obj_ptr: *mut *mut zend_object,
        check_only: bool,
    ) -> zend_result,
>;
pub type zend_object_get_gc_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zend_object,
        table: *mut *mut zval,
        n: *mut ::std::os::raw::c_int,
    ) -> *mut HashTable,
>;
pub type zend_object_do_operation_t = ::std::option::Option<
    unsafe extern "C" fn(
        opcode: u8,
        result: *mut zval,
        op1: *mut zval,
        op2: *mut zval,
    ) -> zend_result,
>;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _zend_object_handlers {
    pub offset: ::std::os::raw::c_int,
    pub free_obj: zend_object_free_obj_t,
    pub dtor_obj: zend_object_dtor_obj_t,
    pub clone_obj: zend_object_clone_obj_t,
    pub read_property: zend_object_read_property_t,
    pub write_property: zend_object_write_property_t,
    pub read_dimension: zend_object_read_dimension_t,
    pub write_dimension: zend_object_write_dimension_t,
    pub get_property_ptr_ptr: zend_object_get_property_ptr_ptr_t,
    pub has_property: zend_object_has_property_t,
    pub unset_property: zend_object_unset_property_t,
    pub has_dimension: zend_object_has_dimension_t,
    pub unset_dimension: zend_object_unset_dimension_t,
    pub get_properties: zend_object_get_properties_t,
    pub get_method: zend_object_get_method_t,
    pub get_constructor: zend_object_get_constructor_t,
    pub get_class_name: zend_object_get_class_name_t,
    pub cast_object: zend_object_cast_t,
    pub count_elements: zend_object_count_elements_t,
    pub get_debug_info: zend_object_get_debug_info_t,
    pub get_closure: zend_object_get_closure_t,
    pub get_gc: zend_object_get_gc_t,
    pub do_operation: zend_object_do_operation_t,
    pub compare: zend_object_compare_t,
    pub get_properties_for: zend_object_get_properties_for_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_object_handlers"][::std::mem::size_of::<_zend_object_handlers>() - 200usize];
    ["Alignment of _zend_object_handlers"]
        [::std::mem::align_of::<_zend_object_handlers>() - 8usize];
    ["Offset of field: _zend_object_handlers::offset"]
        [::std::mem::offset_of!(_zend_object_handlers, offset) - 0usize];
    ["Offset of field: _zend_object_handlers::free_obj"]
        [::std::mem::offset_of!(_zend_object_handlers, free_obj) - 8usize];
    ["Offset of field: _zend_object_handlers::dtor_obj"]
        [::std::mem::offset_of!(_zend_object_handlers, dtor_obj) - 16usize];
    ["Offset of field: _zend_object_handlers::clone_obj"]
        [::std::mem::offset_of!(_zend_object_handlers, clone_obj) - 24usize];
    ["Offset of field: _zend_object_handlers::read_property"]
        [::std::mem::offset_of!(_zend_object_handlers, read_property) - 32usize];
    ["Offset of field: _zend_object_handlers::write_property"]
        [::std::mem::offset_of!(_zend_object_handlers, write_property) - 40usize];
    ["Offset of field: _zend_object_handlers::read_dimension"]
        [::std::mem::offset_of!(_zend_object_handlers, read_dimension) - 48usize];
    ["Offset of field: _zend_object_handlers::write_dimension"]
        [::std::mem::offset_of!(_zend_object_handlers, write_dimension) - 56usize];
    ["Offset of field: _zend_object_handlers::get_property_ptr_ptr"]
        [::std::mem::offset_of!(_zend_object_handlers, get_property_ptr_ptr) - 64usize];
    ["Offset of field: _zend_object_handlers::has_property"]
        [::std::mem::offset_of!(_zend_object_handlers, has_property) - 72usize];
    ["Offset of field: _zend_object_handlers::unset_property"]
        [::std::mem::offset_of!(_zend_object_handlers, unset_property) - 80usize];
    ["Offset of field: _zend_object_handlers::has_dimension"]
        [::std::mem::offset_of!(_zend_object_handlers, has_dimension) - 88usize];
    ["Offset of field: _zend_object_handlers::unset_dimension"]
        [::std::mem::offset_of!(_zend_object_handlers, unset_dimension) - 96usize];
    ["Offset of field: _zend_object_handlers::get_properties"]
        [::std::mem::offset_of!(_zend_object_handlers, get_properties) - 104usize];
    ["Offset of field: _zend_object_handlers::get_method"]
        [::std::mem::offset_of!(_zend_object_handlers, get_method) - 112usize];
    ["Offset of field: _zend_object_handlers::get_constructor"]
        [::std::mem::offset_of!(_zend_object_handlers, get_constructor) - 120usize];
    ["Offset of field: _zend_object_handlers::get_class_name"]
        [::std::mem::offset_of!(_zend_object_handlers, get_class_name) - 128usize];
    ["Offset of field: _zend_object_handlers::cast_object"]
        [::std::mem::offset_of!(_zend_object_handlers, cast_object) - 136usize];
    ["Offset of field: _zend_object_handlers::count_elements"]
        [::std::mem::offset_of!(_zend_object_handlers, count_elements) - 144usize];
    ["Offset of field: _zend_object_handlers::get_debug_info"]
        [::std::mem::offset_of!(_zend_object_handlers, get_debug_info) - 152usize];
    ["Offset of field: _zend_object_handlers::get_closure"]
        [::std::mem::offset_of!(_zend_object_handlers, get_closure) - 160usize];
    ["Offset of field: _zend_object_handlers::get_gc"]
        [::std::mem::offset_of!(_zend_object_handlers, get_gc) - 168usize];
    ["Offset of field: _zend_object_handlers::do_operation"]
        [::std::mem::offset_of!(_zend_object_handlers, do_operation) - 176usize];
    ["Offset of field: _zend_object_handlers::compare"]
        [::std::mem::offset_of!(_zend_object_handlers, compare) - 184usize];
    ["Offset of field: _zend_object_handlers::get_properties_for"]
        [::std::mem::offset_of!(_zend_object_handlers, get_properties_for) - 192usize];
};
unsafe extern "C" {
    pub static std_object_handlers: zend_object_handlers;
}
unsafe extern "C" {
    pub fn zend_class_init_statics(ce: *mut zend_class_entry);
}
unsafe extern "C" {
    pub fn zend_std_get_static_method(
        ce: *mut zend_class_entry,
        function_name_strval: *mut zend_string,
        key: *const zval,
    ) -> *mut zend_function;
}
unsafe extern "C" {
    pub fn zend_std_get_static_property_with_info(
        ce: *mut zend_class_entry,
        property_name: *mut zend_string,
        type_: ::std::os::raw::c_int,
        prop_info: *mut *mut _zend_property_info,
    ) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_std_get_static_property(
        ce: *mut zend_class_entry,
        property_name: *mut zend_string,
        type_: ::std::os::raw::c_int,
    ) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_std_unset_static_property(
        ce: *mut zend_class_entry,
        property_name: *mut zend_string,
    ) -> bool;
}
unsafe extern "C" {
    pub fn zend_std_get_constructor(object: *mut zend_object) -> *mut zend_function;
}
unsafe extern "C" {
    pub fn zend_get_property_info(
        ce: *const zend_class_entry,
        member: *mut zend_string,
        silent: ::std::os::raw::c_int,
    ) -> *mut _zend_property_info;
}
unsafe extern "C" {
    pub fn zend_std_get_properties(object: *mut zend_object) -> *mut HashTable;
}
unsafe extern "C" {
    pub fn zend_get_properties_no_lazy_init(zobj: *mut zend_object) -> *mut HashTable;
}
unsafe extern "C" {
    pub fn zend_std_get_gc(
        object: *mut zend_object,
        table: *mut *mut zval,
        n: *mut ::std::os::raw::c_int,
    ) -> *mut HashTable;
}
unsafe extern "C" {
    pub fn zend_std_get_debug_info(
        object: *mut zend_object,
        is_temp: *mut ::std::os::raw::c_int,
    ) -> *mut HashTable;
}
unsafe extern "C" {
    pub fn zend_std_cast_object_tostring(
        object: *mut zend_object,
        writeobj: *mut zval,
        type_: ::std::os::raw::c_int,
    ) -> zend_result;
}
unsafe extern "C" {
    pub fn zend_std_get_property_ptr_ptr(
        object: *mut zend_object,
        member: *mut zend_string,
        type_: ::std::os::raw::c_int,
        cache_slot: *mut *mut ::std::os::raw::c_void,
    ) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_std_read_property(
        object: *mut zend_object,
        member: *mut zend_string,
        type_: ::std::os::raw::c_int,
        cache_slot: *mut *mut ::std::os::raw::c_void,
        rv: *mut zval,
    ) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_std_write_property(
        object: *mut zend_object,
        member: *mut zend_string,
        value: *mut zval,
        cache_slot: *mut *mut ::std::os::raw::c_void,
    ) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_std_has_property(
        object: *mut zend_object,
        member: *mut zend_string,
        has_set_exists: ::std::os::raw::c_int,
        cache_slot: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_std_unset_property(
        object: *mut zend_object,
        member: *mut zend_string,
        cache_slot: *mut *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn zend_std_read_dimension(
        object: *mut zend_object,
        offset: *mut zval,
        type_: ::std::os::raw::c_int,
        rv: *mut zval,
    ) -> *mut zval;
}
unsafe extern "C" {
    pub fn zend_std_write_dimension(object: *mut zend_object, offset: *mut zval, value: *mut zval);
}
unsafe extern "C" {
    pub fn zend_std_has_dimension(
        object: *mut zend_object,
        offset: *mut zval,
        check_empty: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_std_unset_dimension(object: *mut zend_object, offset: *mut zval);
}
unsafe extern "C" {
    pub fn zend_std_get_method(
        obj_ptr: *mut *mut zend_object,
        method_name: *mut zend_string,
        key: *const zval,
    ) -> *mut zend_function;
}
unsafe extern "C" {
    pub fn zend_std_get_class_name(zobj: *const zend_object) -> *mut zend_string;
}
unsafe extern "C" {
    pub fn zend_std_compare_objects(o1: *mut zval, o2: *mut zval) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_std_get_closure(
        obj: *mut zend_object,
        ce_ptr: *mut *mut zend_class_entry,
        fptr_ptr: *mut *mut zend_function,
        obj_ptr: *mut *mut zend_object,
        check_only: bool,
    ) -> zend_result;
}
unsafe extern "C" {
    pub fn rebuild_object_properties_internal(zobj: *mut zend_object) -> *mut HashTable;
}
unsafe extern "C" {
    pub fn zend_std_build_object_properties_array(zobj: *mut zend_object) -> *mut HashTable;
}
unsafe extern "C" {
    pub fn zend_objects_not_comparable(o1: *mut zval, o2: *mut zval) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_check_protected(
        ce: *const zend_class_entry,
        scope: *const zend_class_entry,
    ) -> bool;
}
unsafe extern "C" {
    pub fn zend_check_property_access(
        zobj: *const zend_object,
        prop_info_name: *mut zend_string,
        is_dynamic: bool,
    ) -> zend_result;
}
unsafe extern "C" {
    pub fn zend_get_call_trampoline_func(
        ce: *const zend_class_entry,
        method_name: *mut zend_string,
        is_static: bool,
    ) -> *mut zend_function;
}
unsafe extern "C" {
    pub fn zend_get_property_guard(zobj: *mut zend_object, member: *mut zend_string) -> *mut u32;
}
unsafe extern "C" {
    pub fn zend_get_recursion_guard(zobj: *mut zend_object) -> *mut u32;
}
unsafe extern "C" {
    pub fn zend_std_get_properties_for(
        obj: *mut zend_object,
        purpose: zend_prop_purpose,
    ) -> *mut HashTable;
}
unsafe extern "C" {
    pub fn zend_get_properties_for(obj: *mut zval, purpose: zend_prop_purpose) -> *mut HashTable;
}
unsafe extern "C" {
    pub fn zend_get_property_hook_trampoline(
        prop_info: *const zend_property_info,
        kind: zend_property_hook_kind,
        prop_name: *mut zend_string,
    ) -> *mut zend_function;
}
unsafe extern "C" {
    pub fn zend_asymmetric_property_has_set_access(prop_info: *const zend_property_info) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_strtod_bigint {
    _unused: [u8; 0],
}
pub type zend_strtod_bigint = _zend_strtod_bigint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_strtod_state {
    pub freelist: [*mut zend_strtod_bigint; 8usize],
    pub p5s: *mut zend_strtod_bigint,
    pub result: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_strtod_state"][::std::mem::size_of::<_zend_strtod_state>() - 80usize];
    ["Alignment of _zend_strtod_state"][::std::mem::align_of::<_zend_strtod_state>() - 8usize];
    ["Offset of field: _zend_strtod_state::freelist"]
        [::std::mem::offset_of!(_zend_strtod_state, freelist) - 0usize];
    ["Offset of field: _zend_strtod_state::p5s"]
        [::std::mem::offset_of!(_zend_strtod_state, p5s) - 64usize];
    ["Offset of field: _zend_strtod_state::result"]
        [::std::mem::offset_of!(_zend_strtod_state, result) - 72usize];
};
impl Default for _zend_strtod_state {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_strtod_state = _zend_strtod_state;
unsafe extern "C" {
    pub fn zend_freedtoa(s: *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn zend_dtoa(
        _d: f64,
        mode: ::std::os::raw::c_int,
        ndigits: ::std::os::raw::c_int,
        decpt: *mut ::std::os::raw::c_int,
        sign: *mut bool,
        rve: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn zend_gcvt(
        value: f64,
        ndigit: ::std::os::raw::c_int,
        dec_point: ::std::os::raw::c_char,
        exponent: ::std::os::raw::c_char,
        buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn zend_strtod(
        s00: *const ::std::os::raw::c_char,
        se: *mut *const ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn zend_hex_strtod(
        str_: *const ::std::os::raw::c_char,
        endptr: *mut *const ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn zend_oct_strtod(
        str_: *const ::std::os::raw::c_char,
        endptr: *mut *const ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn zend_bin_strtod(
        str_: *const ::std::os::raw::c_char,
        endptr: *mut *const ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn zend_shutdown_strtod() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn add_function(result: *mut zval, op1: *mut zval, op2: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn sub_function(result: *mut zval, op1: *mut zval, op2: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn mul_function(result: *mut zval, op1: *mut zval, op2: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn pow_function(result: *mut zval, op1: *mut zval, op2: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn div_function(result: *mut zval, op1: *mut zval, op2: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn mod_function(result: *mut zval, op1: *mut zval, op2: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn boolean_xor_function(result: *mut zval, op1: *mut zval, op2: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn boolean_not_function(result: *mut zval, op1: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn bitwise_not_function(result: *mut zval, op1: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn bitwise_or_function(result: *mut zval, op1: *mut zval, op2: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn bitwise_and_function(result: *mut zval, op1: *mut zval, op2: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn bitwise_xor_function(result: *mut zval, op1: *mut zval, op2: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn shift_left_function(result: *mut zval, op1: *mut zval, op2: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn shift_right_function(result: *mut zval, op1: *mut zval, op2: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn concat_function(result: *mut zval, op1: *mut zval, op2: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn zend_is_identical(op1: *const zval, op2: *const zval) -> bool;
}
unsafe extern "C" {
    pub fn is_equal_function(result: *mut zval, op1: *mut zval, op2: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn is_identical_function(result: *mut zval, op1: *mut zval, op2: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn is_not_identical_function(
        result: *mut zval,
        op1: *mut zval,
        op2: *mut zval,
    ) -> zend_result;
}
unsafe extern "C" {
    pub fn is_not_equal_function(result: *mut zval, op1: *mut zval, op2: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn is_smaller_function(result: *mut zval, op1: *mut zval, op2: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn is_smaller_or_equal_function(
        result: *mut zval,
        op1: *mut zval,
        op2: *mut zval,
    ) -> zend_result;
}
unsafe extern "C" {
    pub fn zend_class_implements_interface(
        class_ce: *const zend_class_entry,
        interface_ce: *const zend_class_entry,
    ) -> bool;
}
unsafe extern "C" {
    pub fn instanceof_function_slow(
        instance_ce: *const zend_class_entry,
        ce: *const zend_class_entry,
    ) -> bool;
}
unsafe extern "C" {
    pub fn zend_string_only_has_ascii_alphanumeric(str_: *const zend_string) -> bool;
}
unsafe extern "C" {
    #[doc = " Checks whether the string \"str\" with length \"length\" is numeric. The value\n of allow_errors determines whether it's required to be entirely numeric, or\n just its prefix. Leading whitespace is allowed.\n\n The function returns 0 if the string did not contain a valid number; IS_LONG\n if it contained a number that fits within the range of a long; or IS_DOUBLE\n if the number was out of long range or contained a decimal point/exponent.\n The number's value is returned into the respective pointer, *lval or *dval,\n if that pointer is not NULL.\n\n This variant also gives information if a string that represents an integer\n could not be represented as such due to overflow. It writes 1 to oflow_info\n if the integer is larger than ZEND_LONG_MAX and -1 if it's smaller than ZEND_LONG_MIN."]
    pub fn _is_numeric_string_ex(
        str_: *const ::std::os::raw::c_char,
        length: usize,
        lval: *mut zend_long,
        dval: *mut f64,
        allow_errors: bool,
        oflow_info: *mut ::std::os::raw::c_int,
        trailing_data: *mut bool,
    ) -> u8;
}
unsafe extern "C" {
    pub fn zend_memnstr_ex(
        haystack: *const ::std::os::raw::c_char,
        needle: *const ::std::os::raw::c_char,
        needle_len: usize,
        end: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn zend_memnrstr_ex(
        haystack: *const ::std::os::raw::c_char,
        needle: *const ::std::os::raw::c_char,
        needle_len: usize,
        end: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn zend_dval_to_lval_slow(d: f64) -> zend_long;
}
unsafe extern "C" {
    pub fn zend_incompatible_double_to_long_error(d: f64);
}
unsafe extern "C" {
    pub fn zend_incompatible_string_to_long_error(s: *const zend_string);
}
unsafe extern "C" {
    pub fn is_numeric_str_function(
        str_: *const zend_string,
        lval: *mut zend_long,
        dval: *mut f64,
    ) -> u8;
}
unsafe extern "C" {
    pub fn increment_function(op1: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn decrement_function(op2: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn convert_scalar_to_number(op: *mut zval);
}
unsafe extern "C" {
    pub fn _convert_to_string(op: *mut zval);
}
unsafe extern "C" {
    pub fn convert_to_long(op: *mut zval);
}
unsafe extern "C" {
    pub fn convert_to_double(op: *mut zval);
}
unsafe extern "C" {
    pub fn convert_to_null(op: *mut zval);
}
unsafe extern "C" {
    pub fn convert_to_boolean(op: *mut zval);
}
unsafe extern "C" {
    pub fn convert_to_array(op: *mut zval);
}
unsafe extern "C" {
    pub fn convert_to_object(op: *mut zval);
}
unsafe extern "C" {
    pub fn zval_get_long_func(op: *const zval, is_strict: bool) -> zend_long;
}
unsafe extern "C" {
    pub fn zval_try_get_long(op: *const zval, failed: *mut bool) -> zend_long;
}
unsafe extern "C" {
    pub fn zval_get_double_func(op: *const zval) -> f64;
}
unsafe extern "C" {
    pub fn zval_get_string_func(op: *mut zval) -> *mut zend_string;
}
unsafe extern "C" {
    pub fn zval_try_get_string_func(op: *mut zval) -> *mut zend_string;
}
unsafe extern "C" {
    pub fn _try_convert_to_string(op: *mut zval) -> bool;
}
unsafe extern "C" {
    pub fn zend_is_true(op: *const zval) -> bool;
}
unsafe extern "C" {
    pub fn zend_object_is_true(op: *const zval) -> bool;
}
unsafe extern "C" {
    pub fn zend_compare(op1: *mut zval, op2: *mut zval) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn compare_function(result: *mut zval, op1: *mut zval, op2: *mut zval) -> zend_result;
}
unsafe extern "C" {
    pub fn numeric_compare_function(op1: *mut zval, op2: *mut zval) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn string_compare_function_ex(
        op1: *mut zval,
        op2: *mut zval,
        case_insensitive: bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn string_compare_function(op1: *mut zval, op2: *mut zval) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn string_case_compare_function(op1: *mut zval, op2: *mut zval) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn string_locale_compare_function(op1: *mut zval, op2: *mut zval) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static zend_tolower_map: [::std::os::raw::c_uchar; 256usize];
}
unsafe extern "C" {
    pub static zend_toupper_map: [::std::os::raw::c_uchar; 256usize];
}
unsafe extern "C" {
    pub fn zend_str_tolower(str_: *mut ::std::os::raw::c_char, length: usize);
}
unsafe extern "C" {
    pub fn zend_str_toupper(str_: *mut ::std::os::raw::c_char, length: usize);
}
unsafe extern "C" {
    pub fn zend_str_tolower_copy(
        dest: *mut ::std::os::raw::c_char,
        source: *const ::std::os::raw::c_char,
        length: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn zend_str_toupper_copy(
        dest: *mut ::std::os::raw::c_char,
        source: *const ::std::os::raw::c_char,
        length: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn zend_str_tolower_dup(
        source: *const ::std::os::raw::c_char,
        length: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn zend_str_toupper_dup(
        source: *const ::std::os::raw::c_char,
        length: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn zend_str_tolower_dup_ex(
        source: *const ::std::os::raw::c_char,
        length: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn zend_str_toupper_dup_ex(
        source: *const ::std::os::raw::c_char,
        length: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn zend_string_tolower_ex(str_: *mut zend_string, persistent: bool) -> *mut zend_string;
}
unsafe extern "C" {
    pub fn zend_string_toupper_ex(str_: *mut zend_string, persistent: bool) -> *mut zend_string;
}
unsafe extern "C" {
    pub fn zend_binary_zval_strcmp(s1: *mut zval, s2: *mut zval) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_binary_zval_strncmp(
        s1: *mut zval,
        s2: *mut zval,
        s3: *mut zval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_binary_strcmp(
        s1: *const ::std::os::raw::c_char,
        len1: usize,
        s2: *const ::std::os::raw::c_char,
        len2: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_binary_strncmp(
        s1: *const ::std::os::raw::c_char,
        len1: usize,
        s2: *const ::std::os::raw::c_char,
        len2: usize,
        length: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_binary_strcasecmp(
        s1: *const ::std::os::raw::c_char,
        len1: usize,
        s2: *const ::std::os::raw::c_char,
        len2: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_binary_strncasecmp(
        s1: *const ::std::os::raw::c_char,
        len1: usize,
        s2: *const ::std::os::raw::c_char,
        len2: usize,
        length: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_binary_strcasecmp_l(
        s1: *const ::std::os::raw::c_char,
        len1: usize,
        s2: *const ::std::os::raw::c_char,
        len2: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_binary_strncasecmp_l(
        s1: *const ::std::os::raw::c_char,
        len1: usize,
        s2: *const ::std::os::raw::c_char,
        len2: usize,
        length: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zendi_smart_streq(s1: *mut zend_string, s2: *mut zend_string) -> bool;
}
unsafe extern "C" {
    pub fn zendi_smart_strcmp(s1: *mut zend_string, s2: *mut zend_string) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_compare_symbol_tables(
        ht1: *mut HashTable,
        ht2: *mut HashTable,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_compare_arrays(a1: *mut zval, a2: *mut zval) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_compare_objects(o1: *mut zval, o2: *mut zval) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Deprecated in favor of ZEND_STRTOL()"]
    pub fn zend_atoi(str_: *const ::std::os::raw::c_char, str_len: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Deprecated in favor of ZEND_STRTOL()"]
    pub fn zend_atol(str_: *const ::std::os::raw::c_char, str_len: usize) -> zend_long;
}
unsafe extern "C" {
    pub fn zend_update_current_locale();
}
unsafe extern "C" {
    pub fn zend_reset_lc_ctype_locale();
}
unsafe extern "C" {
    pub fn zend_long_to_str(num: zend_long) -> *mut zend_string;
}
unsafe extern "C" {
    pub fn zend_ulong_to_str(num: zend_ulong) -> *mut zend_string;
}
unsafe extern "C" {
    pub fn zend_u64_to_str(num: u64) -> *mut zend_string;
}
unsafe extern "C" {
    pub fn zend_i64_to_str(num: i64) -> *mut zend_string;
}
unsafe extern "C" {
    pub fn zend_double_to_str(num: f64) -> *mut zend_string;
}
pub type zend_op = _zend_op;
pub type zend_frameless_function_0 =
    ::std::option::Option<unsafe extern "C" fn(return_value: *mut zval)>;
pub type zend_frameless_function_1 =
    ::std::option::Option<unsafe extern "C" fn(return_value: *mut zval, op1: *mut zval)>;
pub type zend_frameless_function_2 = ::std::option::Option<
    unsafe extern "C" fn(return_value: *mut zval, op1: *mut zval, op2: *mut zval),
>;
pub type zend_frameless_function_3 = ::std::option::Option<
    unsafe extern "C" fn(return_value: *mut zval, op1: *mut zval, op2: *mut zval, op3: *mut zval),
>;
unsafe extern "C" {
    pub static mut zend_flf_count: usize;
}
unsafe extern "C" {
    pub static mut zend_flf_capacity: usize;
}
unsafe extern "C" {
    pub static mut zend_flf_handlers: *mut *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub static mut zend_flf_functions: *mut *mut zend_function;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct zend_frameless_function_info {
    pub handler: *mut ::std::os::raw::c_void,
    pub num_args: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of zend_frameless_function_info"]
        [::std::mem::size_of::<zend_frameless_function_info>() - 16usize];
    ["Alignment of zend_frameless_function_info"]
        [::std::mem::align_of::<zend_frameless_function_info>() - 8usize];
    ["Offset of field: zend_frameless_function_info::handler"]
        [::std::mem::offset_of!(zend_frameless_function_info, handler) - 0usize];
    ["Offset of field: zend_frameless_function_info::num_args"]
        [::std::mem::offset_of!(zend_frameless_function_info, num_args) - 8usize];
};
impl Default for zend_frameless_function_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const zend_jmp_fl_result_ZEND_JMP_FL_UNPRIMED: zend_jmp_fl_result = 0;
pub const zend_jmp_fl_result_ZEND_JMP_FL_MISS: zend_jmp_fl_result = 1;
pub const zend_jmp_fl_result_ZEND_JMP_FL_HIT: zend_jmp_fl_result = 2;
pub type zend_jmp_fl_result = ::std::os::raw::c_uint;
pub type zend_op_array = _zend_op_array;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _znode_op {
    pub constant: u32,
    pub var: u32,
    pub num: u32,
    pub opline_num: u32,
    pub jmp_offset: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _znode_op"][::std::mem::size_of::<_znode_op>() - 4usize];
    ["Alignment of _znode_op"][::std::mem::align_of::<_znode_op>() - 4usize];
    ["Offset of field: _znode_op::constant"][::std::mem::offset_of!(_znode_op, constant) - 0usize];
    ["Offset of field: _znode_op::var"][::std::mem::offset_of!(_znode_op, var) - 0usize];
    ["Offset of field: _znode_op::num"][::std::mem::offset_of!(_znode_op, num) - 0usize];
    ["Offset of field: _znode_op::opline_num"]
        [::std::mem::offset_of!(_znode_op, opline_num) - 0usize];
    ["Offset of field: _znode_op::jmp_offset"]
        [::std::mem::offset_of!(_znode_op, jmp_offset) - 0usize];
};
impl Default for _znode_op {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type znode_op = _znode_op;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _znode {
    pub op_type: u8,
    pub flag: u8,
    pub u: _znode__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _znode__bindgen_ty_1 {
    pub op: znode_op,
    pub constant: zval,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _znode__bindgen_ty_1"][::std::mem::size_of::<_znode__bindgen_ty_1>() - 16usize];
    ["Alignment of _znode__bindgen_ty_1"][::std::mem::align_of::<_znode__bindgen_ty_1>() - 8usize];
    ["Offset of field: _znode__bindgen_ty_1::op"]
        [::std::mem::offset_of!(_znode__bindgen_ty_1, op) - 0usize];
    ["Offset of field: _znode__bindgen_ty_1::constant"]
        [::std::mem::offset_of!(_znode__bindgen_ty_1, constant) - 0usize];
};
impl Default for _znode__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _znode"][::std::mem::size_of::<_znode>() - 24usize];
    ["Alignment of _znode"][::std::mem::align_of::<_znode>() - 8usize];
    ["Offset of field: _znode::op_type"][::std::mem::offset_of!(_znode, op_type) - 0usize];
    ["Offset of field: _znode::flag"][::std::mem::offset_of!(_znode, flag) - 1usize];
    ["Offset of field: _znode::u"][::std::mem::offset_of!(_znode, u) - 8usize];
};
impl Default for _znode {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type znode = _znode;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_ast_znode {
    pub kind: zend_ast_kind,
    pub attr: zend_ast_attr,
    pub lineno: u32,
    pub node: znode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_ast_znode"][::std::mem::size_of::<_zend_ast_znode>() - 32usize];
    ["Alignment of _zend_ast_znode"][::std::mem::align_of::<_zend_ast_znode>() - 8usize];
    ["Offset of field: _zend_ast_znode::kind"]
        [::std::mem::offset_of!(_zend_ast_znode, kind) - 0usize];
    ["Offset of field: _zend_ast_znode::attr"]
        [::std::mem::offset_of!(_zend_ast_znode, attr) - 2usize];
    ["Offset of field: _zend_ast_znode::lineno"]
        [::std::mem::offset_of!(_zend_ast_znode, lineno) - 4usize];
    ["Offset of field: _zend_ast_znode::node"]
        [::std::mem::offset_of!(_zend_ast_znode, node) - 8usize];
};
impl Default for _zend_ast_znode {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_ast_znode = _zend_ast_znode;
unsafe extern "C" {
    pub fn zend_ast_create_znode(node: *mut znode) -> *mut zend_ast;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _zend_declarables {
    pub ticks: zend_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_declarables"][::std::mem::size_of::<_zend_declarables>() - 8usize];
    ["Alignment of _zend_declarables"][::std::mem::align_of::<_zend_declarables>() - 8usize];
    ["Offset of field: _zend_declarables::ticks"]
        [::std::mem::offset_of!(_zend_declarables, ticks) - 0usize];
};
pub type zend_declarables = _zend_declarables;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_file_context {
    pub declarables: zend_declarables,
    pub current_namespace: *mut zend_string,
    pub in_namespace: bool,
    pub has_bracketed_namespaces: bool,
    pub imports: *mut HashTable,
    pub imports_function: *mut HashTable,
    pub imports_const: *mut HashTable,
    pub seen_symbols: HashTable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_file_context"][::std::mem::size_of::<_zend_file_context>() - 104usize];
    ["Alignment of _zend_file_context"][::std::mem::align_of::<_zend_file_context>() - 8usize];
    ["Offset of field: _zend_file_context::declarables"]
        [::std::mem::offset_of!(_zend_file_context, declarables) - 0usize];
    ["Offset of field: _zend_file_context::current_namespace"]
        [::std::mem::offset_of!(_zend_file_context, current_namespace) - 8usize];
    ["Offset of field: _zend_file_context::in_namespace"]
        [::std::mem::offset_of!(_zend_file_context, in_namespace) - 16usize];
    ["Offset of field: _zend_file_context::has_bracketed_namespaces"]
        [::std::mem::offset_of!(_zend_file_context, has_bracketed_namespaces) - 17usize];
    ["Offset of field: _zend_file_context::imports"]
        [::std::mem::offset_of!(_zend_file_context, imports) - 24usize];
    ["Offset of field: _zend_file_context::imports_function"]
        [::std::mem::offset_of!(_zend_file_context, imports_function) - 32usize];
    ["Offset of field: _zend_file_context::imports_const"]
        [::std::mem::offset_of!(_zend_file_context, imports_const) - 40usize];
    ["Offset of field: _zend_file_context::seen_symbols"]
        [::std::mem::offset_of!(_zend_file_context, seen_symbols) - 48usize];
};
impl Default for _zend_file_context {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_file_context = _zend_file_context;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_parser_stack_elem {
    pub ast: *mut zend_ast,
    pub str_: *mut zend_string,
    pub num: zend_ulong,
    pub ptr: *mut ::std::os::raw::c_uchar,
    pub ident: *mut ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_parser_stack_elem"][::std::mem::size_of::<_zend_parser_stack_elem>() - 8usize];
    ["Alignment of _zend_parser_stack_elem"]
        [::std::mem::align_of::<_zend_parser_stack_elem>() - 8usize];
    ["Offset of field: _zend_parser_stack_elem::ast"]
        [::std::mem::offset_of!(_zend_parser_stack_elem, ast) - 0usize];
    ["Offset of field: _zend_parser_stack_elem::str_"]
        [::std::mem::offset_of!(_zend_parser_stack_elem, str_) - 0usize];
    ["Offset of field: _zend_parser_stack_elem::num"]
        [::std::mem::offset_of!(_zend_parser_stack_elem, num) - 0usize];
    ["Offset of field: _zend_parser_stack_elem::ptr"]
        [::std::mem::offset_of!(_zend_parser_stack_elem, ptr) - 0usize];
    ["Offset of field: _zend_parser_stack_elem::ident"]
        [::std::mem::offset_of!(_zend_parser_stack_elem, ident) - 0usize];
};
impl Default for _zend_parser_stack_elem {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_parser_stack_elem = _zend_parser_stack_elem;
unsafe extern "C" {
    pub fn zend_compile_top_stmt(ast: *mut zend_ast);
}
unsafe extern "C" {
    pub fn zend_const_expr_to_zval(
        result: *mut zval,
        ast_ptr: *mut *mut zend_ast,
        allow_dynamic: bool,
    );
}
pub type user_opcode_handler_t = ::std::option::Option<
    unsafe extern "C" fn(execute_data: *mut zend_execute_data) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_op {
    pub handler: *const ::std::os::raw::c_void,
    pub op1: znode_op,
    pub op2: znode_op,
    pub result: znode_op,
    pub extended_value: u32,
    pub lineno: u32,
    pub opcode: u8,
    pub op1_type: u8,
    pub op2_type: u8,
    pub result_type: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_op"][::std::mem::size_of::<_zend_op>() - 32usize];
    ["Alignment of _zend_op"][::std::mem::align_of::<_zend_op>() - 8usize];
    ["Offset of field: _zend_op::handler"][::std::mem::offset_of!(_zend_op, handler) - 0usize];
    ["Offset of field: _zend_op::op1"][::std::mem::offset_of!(_zend_op, op1) - 8usize];
    ["Offset of field: _zend_op::op2"][::std::mem::offset_of!(_zend_op, op2) - 12usize];
    ["Offset of field: _zend_op::result"][::std::mem::offset_of!(_zend_op, result) - 16usize];
    ["Offset of field: _zend_op::extended_value"]
        [::std::mem::offset_of!(_zend_op, extended_value) - 20usize];
    ["Offset of field: _zend_op::lineno"][::std::mem::offset_of!(_zend_op, lineno) - 24usize];
    ["Offset of field: _zend_op::opcode"][::std::mem::offset_of!(_zend_op, opcode) - 28usize];
    ["Offset of field: _zend_op::op1_type"][::std::mem::offset_of!(_zend_op, op1_type) - 29usize];
    ["Offset of field: _zend_op::op2_type"][::std::mem::offset_of!(_zend_op, op2_type) - 30usize];
    ["Offset of field: _zend_op::result_type"]
        [::std::mem::offset_of!(_zend_op, result_type) - 31usize];
};
impl Default for _zend_op {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _zend_brk_cont_element {
    pub start: ::std::os::raw::c_int,
    pub cont: ::std::os::raw::c_int,
    pub brk: ::std::os::raw::c_int,
    pub parent: ::std::os::raw::c_int,
    pub is_switch: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_brk_cont_element"][::std::mem::size_of::<_zend_brk_cont_element>() - 20usize];
    ["Alignment of _zend_brk_cont_element"]
        [::std::mem::align_of::<_zend_brk_cont_element>() - 4usize];
    ["Offset of field: _zend_brk_cont_element::start"]
        [::std::mem::offset_of!(_zend_brk_cont_element, start) - 0usize];
    ["Offset of field: _zend_brk_cont_element::cont"]
        [::std::mem::offset_of!(_zend_brk_cont_element, cont) - 4usize];
    ["Offset of field: _zend_brk_cont_element::brk"]
        [::std::mem::offset_of!(_zend_brk_cont_element, brk) - 8usize];
    ["Offset of field: _zend_brk_cont_element::parent"]
        [::std::mem::offset_of!(_zend_brk_cont_element, parent) - 12usize];
    ["Offset of field: _zend_brk_cont_element::is_switch"]
        [::std::mem::offset_of!(_zend_brk_cont_element, is_switch) - 16usize];
};
pub type zend_brk_cont_element = _zend_brk_cont_element;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _zend_label {
    pub brk_cont: ::std::os::raw::c_int,
    pub opline_num: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_label"][::std::mem::size_of::<_zend_label>() - 8usize];
    ["Alignment of _zend_label"][::std::mem::align_of::<_zend_label>() - 4usize];
    ["Offset of field: _zend_label::brk_cont"]
        [::std::mem::offset_of!(_zend_label, brk_cont) - 0usize];
    ["Offset of field: _zend_label::opline_num"]
        [::std::mem::offset_of!(_zend_label, opline_num) - 4usize];
};
pub type zend_label = _zend_label;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _zend_try_catch_element {
    pub try_op: u32,
    pub catch_op: u32,
    pub finally_op: u32,
    pub finally_end: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_try_catch_element"][::std::mem::size_of::<_zend_try_catch_element>() - 16usize];
    ["Alignment of _zend_try_catch_element"]
        [::std::mem::align_of::<_zend_try_catch_element>() - 4usize];
    ["Offset of field: _zend_try_catch_element::try_op"]
        [::std::mem::offset_of!(_zend_try_catch_element, try_op) - 0usize];
    ["Offset of field: _zend_try_catch_element::catch_op"]
        [::std::mem::offset_of!(_zend_try_catch_element, catch_op) - 4usize];
    ["Offset of field: _zend_try_catch_element::finally_op"]
        [::std::mem::offset_of!(_zend_try_catch_element, finally_op) - 8usize];
    ["Offset of field: _zend_try_catch_element::finally_end"]
        [::std::mem::offset_of!(_zend_try_catch_element, finally_end) - 12usize];
};
pub type zend_try_catch_element = _zend_try_catch_element;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _zend_live_range {
    pub var: u32,
    pub start: u32,
    pub end: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_live_range"][::std::mem::size_of::<_zend_live_range>() - 12usize];
    ["Alignment of _zend_live_range"][::std::mem::align_of::<_zend_live_range>() - 4usize];
    ["Offset of field: _zend_live_range::var"]
        [::std::mem::offset_of!(_zend_live_range, var) - 0usize];
    ["Offset of field: _zend_live_range::start"]
        [::std::mem::offset_of!(_zend_live_range, start) - 4usize];
    ["Offset of field: _zend_live_range::end"]
        [::std::mem::offset_of!(_zend_live_range, end) - 8usize];
};
pub type zend_live_range = _zend_live_range;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_oparray_context {
    pub prev: *mut _zend_oparray_context,
    pub op_array: *mut zend_op_array,
    pub opcodes_size: u32,
    pub vars_size: ::std::os::raw::c_int,
    pub literals_size: ::std::os::raw::c_int,
    pub fast_call_var: u32,
    pub try_catch_offset: u32,
    pub current_brk_cont: ::std::os::raw::c_int,
    pub last_brk_cont: ::std::os::raw::c_int,
    pub brk_cont_array: *mut zend_brk_cont_element,
    pub labels: *mut HashTable,
    pub active_property_info: *const zend_property_info,
    pub active_property_hook_kind: zend_property_hook_kind,
    pub in_jmp_frameless_branch: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_oparray_context"][::std::mem::size_of::<_zend_oparray_context>() - 80usize];
    ["Alignment of _zend_oparray_context"]
        [::std::mem::align_of::<_zend_oparray_context>() - 8usize];
    ["Offset of field: _zend_oparray_context::prev"]
        [::std::mem::offset_of!(_zend_oparray_context, prev) - 0usize];
    ["Offset of field: _zend_oparray_context::op_array"]
        [::std::mem::offset_of!(_zend_oparray_context, op_array) - 8usize];
    ["Offset of field: _zend_oparray_context::opcodes_size"]
        [::std::mem::offset_of!(_zend_oparray_context, opcodes_size) - 16usize];
    ["Offset of field: _zend_oparray_context::vars_size"]
        [::std::mem::offset_of!(_zend_oparray_context, vars_size) - 20usize];
    ["Offset of field: _zend_oparray_context::literals_size"]
        [::std::mem::offset_of!(_zend_oparray_context, literals_size) - 24usize];
    ["Offset of field: _zend_oparray_context::fast_call_var"]
        [::std::mem::offset_of!(_zend_oparray_context, fast_call_var) - 28usize];
    ["Offset of field: _zend_oparray_context::try_catch_offset"]
        [::std::mem::offset_of!(_zend_oparray_context, try_catch_offset) - 32usize];
    ["Offset of field: _zend_oparray_context::current_brk_cont"]
        [::std::mem::offset_of!(_zend_oparray_context, current_brk_cont) - 36usize];
    ["Offset of field: _zend_oparray_context::last_brk_cont"]
        [::std::mem::offset_of!(_zend_oparray_context, last_brk_cont) - 40usize];
    ["Offset of field: _zend_oparray_context::brk_cont_array"]
        [::std::mem::offset_of!(_zend_oparray_context, brk_cont_array) - 48usize];
    ["Offset of field: _zend_oparray_context::labels"]
        [::std::mem::offset_of!(_zend_oparray_context, labels) - 56usize];
    ["Offset of field: _zend_oparray_context::active_property_info"]
        [::std::mem::offset_of!(_zend_oparray_context, active_property_info) - 64usize];
    ["Offset of field: _zend_oparray_context::active_property_hook_kind"]
        [::std::mem::offset_of!(_zend_oparray_context, active_property_hook_kind) - 72usize];
    ["Offset of field: _zend_oparray_context::in_jmp_frameless_branch"]
        [::std::mem::offset_of!(_zend_oparray_context, in_jmp_frameless_branch) - 76usize];
};
impl Default for _zend_oparray_context {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_oparray_context = _zend_oparray_context;
unsafe extern "C" {
    pub fn zend_visibility_string(fn_flags: u32) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn zend_get_property_hook_kind_from_name(name: *mut zend_string)
        -> zend_property_hook_kind;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_property_info {
    pub offset: u32,
    pub flags: u32,
    pub name: *mut zend_string,
    pub doc_comment: *mut zend_string,
    pub attributes: *mut HashTable,
    pub ce: *mut zend_class_entry,
    pub type_: zend_type,
    pub prototype: *const zend_property_info,
    pub hooks: *mut *mut zend_function,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_property_info"][::std::mem::size_of::<_zend_property_info>() - 72usize];
    ["Alignment of _zend_property_info"][::std::mem::align_of::<_zend_property_info>() - 8usize];
    ["Offset of field: _zend_property_info::offset"]
        [::std::mem::offset_of!(_zend_property_info, offset) - 0usize];
    ["Offset of field: _zend_property_info::flags"]
        [::std::mem::offset_of!(_zend_property_info, flags) - 4usize];
    ["Offset of field: _zend_property_info::name"]
        [::std::mem::offset_of!(_zend_property_info, name) - 8usize];
    ["Offset of field: _zend_property_info::doc_comment"]
        [::std::mem::offset_of!(_zend_property_info, doc_comment) - 16usize];
    ["Offset of field: _zend_property_info::attributes"]
        [::std::mem::offset_of!(_zend_property_info, attributes) - 24usize];
    ["Offset of field: _zend_property_info::ce"]
        [::std::mem::offset_of!(_zend_property_info, ce) - 32usize];
    ["Offset of field: _zend_property_info::type_"]
        [::std::mem::offset_of!(_zend_property_info, type_) - 40usize];
    ["Offset of field: _zend_property_info::prototype"]
        [::std::mem::offset_of!(_zend_property_info, prototype) - 56usize];
    ["Offset of field: _zend_property_info::hooks"]
        [::std::mem::offset_of!(_zend_property_info, hooks) - 64usize];
};
impl Default for _zend_property_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_class_constant {
    pub value: zval,
    pub doc_comment: *mut zend_string,
    pub attributes: *mut HashTable,
    pub ce: *mut zend_class_entry,
    pub type_: zend_type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_class_constant"][::std::mem::size_of::<_zend_class_constant>() - 56usize];
    ["Alignment of _zend_class_constant"][::std::mem::align_of::<_zend_class_constant>() - 8usize];
    ["Offset of field: _zend_class_constant::value"]
        [::std::mem::offset_of!(_zend_class_constant, value) - 0usize];
    ["Offset of field: _zend_class_constant::doc_comment"]
        [::std::mem::offset_of!(_zend_class_constant, doc_comment) - 16usize];
    ["Offset of field: _zend_class_constant::attributes"]
        [::std::mem::offset_of!(_zend_class_constant, attributes) - 24usize];
    ["Offset of field: _zend_class_constant::ce"]
        [::std::mem::offset_of!(_zend_class_constant, ce) - 32usize];
    ["Offset of field: _zend_class_constant::type_"]
        [::std::mem::offset_of!(_zend_class_constant, type_) - 40usize];
};
impl Default for _zend_class_constant {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_class_constant = _zend_class_constant;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_internal_arg_info {
    pub name: *const ::std::os::raw::c_char,
    pub type_: zend_type,
    pub default_value: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_internal_arg_info"][::std::mem::size_of::<_zend_internal_arg_info>() - 32usize];
    ["Alignment of _zend_internal_arg_info"]
        [::std::mem::align_of::<_zend_internal_arg_info>() - 8usize];
    ["Offset of field: _zend_internal_arg_info::name"]
        [::std::mem::offset_of!(_zend_internal_arg_info, name) - 0usize];
    ["Offset of field: _zend_internal_arg_info::type_"]
        [::std::mem::offset_of!(_zend_internal_arg_info, type_) - 8usize];
    ["Offset of field: _zend_internal_arg_info::default_value"]
        [::std::mem::offset_of!(_zend_internal_arg_info, default_value) - 24usize];
};
impl Default for _zend_internal_arg_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_internal_arg_info = _zend_internal_arg_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_arg_info {
    pub name: *mut zend_string,
    pub type_: zend_type,
    pub default_value: *mut zend_string,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_arg_info"][::std::mem::size_of::<_zend_arg_info>() - 32usize];
    ["Alignment of _zend_arg_info"][::std::mem::align_of::<_zend_arg_info>() - 8usize];
    ["Offset of field: _zend_arg_info::name"]
        [::std::mem::offset_of!(_zend_arg_info, name) - 0usize];
    ["Offset of field: _zend_arg_info::type_"]
        [::std::mem::offset_of!(_zend_arg_info, type_) - 8usize];
    ["Offset of field: _zend_arg_info::default_value"]
        [::std::mem::offset_of!(_zend_arg_info, default_value) - 24usize];
};
impl Default for _zend_arg_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_arg_info = _zend_arg_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_internal_function_info {
    pub required_num_args: usize,
    pub type_: zend_type,
    pub default_value: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_internal_function_info"]
        [::std::mem::size_of::<_zend_internal_function_info>() - 32usize];
    ["Alignment of _zend_internal_function_info"]
        [::std::mem::align_of::<_zend_internal_function_info>() - 8usize];
    ["Offset of field: _zend_internal_function_info::required_num_args"]
        [::std::mem::offset_of!(_zend_internal_function_info, required_num_args) - 0usize];
    ["Offset of field: _zend_internal_function_info::type_"]
        [::std::mem::offset_of!(_zend_internal_function_info, type_) - 8usize];
    ["Offset of field: _zend_internal_function_info::default_value"]
        [::std::mem::offset_of!(_zend_internal_function_info, default_value) - 24usize];
};
impl Default for _zend_internal_function_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_internal_function_info = _zend_internal_function_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_op_array {
    pub type_: u8,
    pub arg_flags: [u8; 3usize],
    pub fn_flags: u32,
    pub function_name: *mut zend_string,
    pub scope: *mut zend_class_entry,
    pub prototype: *mut zend_function,
    pub num_args: u32,
    pub required_num_args: u32,
    pub arg_info: *mut zend_arg_info,
    pub attributes: *mut HashTable,
    pub run_time_cache__ptr: *mut *mut ::std::os::raw::c_void,
    pub doc_comment: *mut zend_string,
    pub T: u32,
    pub prop_info: *const zend_property_info,
    pub cache_size: ::std::os::raw::c_int,
    pub last_var: ::std::os::raw::c_int,
    pub last: u32,
    pub opcodes: *mut zend_op,
    pub static_variables_ptr__ptr: *mut HashTable,
    pub static_variables: *mut HashTable,
    pub vars: *mut *mut zend_string,
    pub refcount: *mut u32,
    pub last_live_range: ::std::os::raw::c_int,
    pub last_try_catch: ::std::os::raw::c_int,
    pub live_range: *mut zend_live_range,
    pub try_catch_array: *mut zend_try_catch_element,
    pub filename: *mut zend_string,
    pub line_start: u32,
    pub line_end: u32,
    pub last_literal: ::std::os::raw::c_int,
    pub num_dynamic_func_defs: u32,
    pub literals: *mut zval,
    pub dynamic_func_defs: *mut *mut zend_op_array,
    pub reserved: [*mut ::std::os::raw::c_void; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_op_array"][::std::mem::size_of::<_zend_op_array>() - 256usize];
    ["Alignment of _zend_op_array"][::std::mem::align_of::<_zend_op_array>() - 8usize];
    ["Offset of field: _zend_op_array::type_"]
        [::std::mem::offset_of!(_zend_op_array, type_) - 0usize];
    ["Offset of field: _zend_op_array::arg_flags"]
        [::std::mem::offset_of!(_zend_op_array, arg_flags) - 1usize];
    ["Offset of field: _zend_op_array::fn_flags"]
        [::std::mem::offset_of!(_zend_op_array, fn_flags) - 4usize];
    ["Offset of field: _zend_op_array::function_name"]
        [::std::mem::offset_of!(_zend_op_array, function_name) - 8usize];
    ["Offset of field: _zend_op_array::scope"]
        [::std::mem::offset_of!(_zend_op_array, scope) - 16usize];
    ["Offset of field: _zend_op_array::prototype"]
        [::std::mem::offset_of!(_zend_op_array, prototype) - 24usize];
    ["Offset of field: _zend_op_array::num_args"]
        [::std::mem::offset_of!(_zend_op_array, num_args) - 32usize];
    ["Offset of field: _zend_op_array::required_num_args"]
        [::std::mem::offset_of!(_zend_op_array, required_num_args) - 36usize];
    ["Offset of field: _zend_op_array::arg_info"]
        [::std::mem::offset_of!(_zend_op_array, arg_info) - 40usize];
    ["Offset of field: _zend_op_array::attributes"]
        [::std::mem::offset_of!(_zend_op_array, attributes) - 48usize];
    ["Offset of field: _zend_op_array::run_time_cache__ptr"]
        [::std::mem::offset_of!(_zend_op_array, run_time_cache__ptr) - 56usize];
    ["Offset of field: _zend_op_array::doc_comment"]
        [::std::mem::offset_of!(_zend_op_array, doc_comment) - 64usize];
    ["Offset of field: _zend_op_array::T"][::std::mem::offset_of!(_zend_op_array, T) - 72usize];
    ["Offset of field: _zend_op_array::prop_info"]
        [::std::mem::offset_of!(_zend_op_array, prop_info) - 80usize];
    ["Offset of field: _zend_op_array::cache_size"]
        [::std::mem::offset_of!(_zend_op_array, cache_size) - 88usize];
    ["Offset of field: _zend_op_array::last_var"]
        [::std::mem::offset_of!(_zend_op_array, last_var) - 92usize];
    ["Offset of field: _zend_op_array::last"]
        [::std::mem::offset_of!(_zend_op_array, last) - 96usize];
    ["Offset of field: _zend_op_array::opcodes"]
        [::std::mem::offset_of!(_zend_op_array, opcodes) - 104usize];
    ["Offset of field: _zend_op_array::static_variables_ptr__ptr"]
        [::std::mem::offset_of!(_zend_op_array, static_variables_ptr__ptr) - 112usize];
    ["Offset of field: _zend_op_array::static_variables"]
        [::std::mem::offset_of!(_zend_op_array, static_variables) - 120usize];
    ["Offset of field: _zend_op_array::vars"]
        [::std::mem::offset_of!(_zend_op_array, vars) - 128usize];
    ["Offset of field: _zend_op_array::refcount"]
        [::std::mem::offset_of!(_zend_op_array, refcount) - 136usize];
    ["Offset of field: _zend_op_array::last_live_range"]
        [::std::mem::offset_of!(_zend_op_array, last_live_range) - 144usize];
    ["Offset of field: _zend_op_array::last_try_catch"]
        [::std::mem::offset_of!(_zend_op_array, last_try_catch) - 148usize];
    ["Offset of field: _zend_op_array::live_range"]
        [::std::mem::offset_of!(_zend_op_array, live_range) - 152usize];
    ["Offset of field: _zend_op_array::try_catch_array"]
        [::std::mem::offset_of!(_zend_op_array, try_catch_array) - 160usize];
    ["Offset of field: _zend_op_array::filename"]
        [::std::mem::offset_of!(_zend_op_array, filename) - 168usize];
    ["Offset of field: _zend_op_array::line_start"]
        [::std::mem::offset_of!(_zend_op_array, line_start) - 176usize];
    ["Offset of field: _zend_op_array::line_end"]
        [::std::mem::offset_of!(_zend_op_array, line_end) - 180usize];
    ["Offset of field: _zend_op_array::last_literal"]
        [::std::mem::offset_of!(_zend_op_array, last_literal) - 184usize];
    ["Offset of field: _zend_op_array::num_dynamic_func_defs"]
        [::std::mem::offset_of!(_zend_op_array, num_dynamic_func_defs) - 188usize];
    ["Offset of field: _zend_op_array::literals"]
        [::std::mem::offset_of!(_zend_op_array, literals) - 192usize];
    ["Offset of field: _zend_op_array::dynamic_func_defs"]
        [::std::mem::offset_of!(_zend_op_array, dynamic_func_defs) - 200usize];
    ["Offset of field: _zend_op_array::reserved"]
        [::std::mem::offset_of!(_zend_op_array, reserved) - 208usize];
};
impl Default for _zend_op_array {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zif_handler = ::std::option::Option<
    unsafe extern "C" fn(execute_data: *mut zend_execute_data, return_value: *mut zval),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_internal_function {
    pub type_: u8,
    pub arg_flags: [u8; 3usize],
    pub fn_flags: u32,
    pub function_name: *mut zend_string,
    pub scope: *mut zend_class_entry,
    pub prototype: *mut zend_function,
    pub num_args: u32,
    pub required_num_args: u32,
    pub arg_info: *mut zend_internal_arg_info,
    pub attributes: *mut HashTable,
    pub run_time_cache__ptr: *mut *mut ::std::os::raw::c_void,
    pub doc_comment: *mut zend_string,
    pub T: u32,
    pub prop_info: *const zend_property_info,
    pub handler: zif_handler,
    pub module: *mut _zend_module_entry,
    pub frameless_function_infos: *const zend_frameless_function_info,
    pub reserved: [*mut ::std::os::raw::c_void; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_internal_function"]
        [::std::mem::size_of::<_zend_internal_function>() - 160usize];
    ["Alignment of _zend_internal_function"]
        [::std::mem::align_of::<_zend_internal_function>() - 8usize];
    ["Offset of field: _zend_internal_function::type_"]
        [::std::mem::offset_of!(_zend_internal_function, type_) - 0usize];
    ["Offset of field: _zend_internal_function::arg_flags"]
        [::std::mem::offset_of!(_zend_internal_function, arg_flags) - 1usize];
    ["Offset of field: _zend_internal_function::fn_flags"]
        [::std::mem::offset_of!(_zend_internal_function, fn_flags) - 4usize];
    ["Offset of field: _zend_internal_function::function_name"]
        [::std::mem::offset_of!(_zend_internal_function, function_name) - 8usize];
    ["Offset of field: _zend_internal_function::scope"]
        [::std::mem::offset_of!(_zend_internal_function, scope) - 16usize];
    ["Offset of field: _zend_internal_function::prototype"]
        [::std::mem::offset_of!(_zend_internal_function, prototype) - 24usize];
    ["Offset of field: _zend_internal_function::num_args"]
        [::std::mem::offset_of!(_zend_internal_function, num_args) - 32usize];
    ["Offset of field: _zend_internal_function::required_num_args"]
        [::std::mem::offset_of!(_zend_internal_function, required_num_args) - 36usize];
    ["Offset of field: _zend_internal_function::arg_info"]
        [::std::mem::offset_of!(_zend_internal_function, arg_info) - 40usize];
    ["Offset of field: _zend_internal_function::attributes"]
        [::std::mem::offset_of!(_zend_internal_function, attributes) - 48usize];
    ["Offset of field: _zend_internal_function::run_time_cache__ptr"]
        [::std::mem::offset_of!(_zend_internal_function, run_time_cache__ptr) - 56usize];
    ["Offset of field: _zend_internal_function::doc_comment"]
        [::std::mem::offset_of!(_zend_internal_function, doc_comment) - 64usize];
    ["Offset of field: _zend_internal_function::T"]
        [::std::mem::offset_of!(_zend_internal_function, T) - 72usize];
    ["Offset of field: _zend_internal_function::prop_info"]
        [::std::mem::offset_of!(_zend_internal_function, prop_info) - 80usize];
    ["Offset of field: _zend_internal_function::handler"]
        [::std::mem::offset_of!(_zend_internal_function, handler) - 88usize];
    ["Offset of field: _zend_internal_function::module"]
        [::std::mem::offset_of!(_zend_internal_function, module) - 96usize];
    ["Offset of field: _zend_internal_function::frameless_function_infos"]
        [::std::mem::offset_of!(_zend_internal_function, frameless_function_infos) - 104usize];
    ["Offset of field: _zend_internal_function::reserved"]
        [::std::mem::offset_of!(_zend_internal_function, reserved) - 112usize];
};
impl Default for _zend_internal_function {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_internal_function = _zend_internal_function;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_function {
    pub type_: u8,
    pub quick_arg_flags: u32,
    pub common: _zend_function__bindgen_ty_1,
    pub op_array: zend_op_array,
    pub internal_function: zend_internal_function,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_function__bindgen_ty_1 {
    pub type_: u8,
    pub arg_flags: [u8; 3usize],
    pub fn_flags: u32,
    pub function_name: *mut zend_string,
    pub scope: *mut zend_class_entry,
    pub prototype: *mut zend_function,
    pub num_args: u32,
    pub required_num_args: u32,
    pub arg_info: *mut zend_arg_info,
    pub attributes: *mut HashTable,
    pub run_time_cache__ptr: *mut *mut ::std::os::raw::c_void,
    pub doc_comment: *mut zend_string,
    pub T: u32,
    pub prop_info: *const zend_property_info,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_function__bindgen_ty_1"]
        [::std::mem::size_of::<_zend_function__bindgen_ty_1>() - 88usize];
    ["Alignment of _zend_function__bindgen_ty_1"]
        [::std::mem::align_of::<_zend_function__bindgen_ty_1>() - 8usize];
    ["Offset of field: _zend_function__bindgen_ty_1::type_"]
        [::std::mem::offset_of!(_zend_function__bindgen_ty_1, type_) - 0usize];
    ["Offset of field: _zend_function__bindgen_ty_1::arg_flags"]
        [::std::mem::offset_of!(_zend_function__bindgen_ty_1, arg_flags) - 1usize];
    ["Offset of field: _zend_function__bindgen_ty_1::fn_flags"]
        [::std::mem::offset_of!(_zend_function__bindgen_ty_1, fn_flags) - 4usize];
    ["Offset of field: _zend_function__bindgen_ty_1::function_name"]
        [::std::mem::offset_of!(_zend_function__bindgen_ty_1, function_name) - 8usize];
    ["Offset of field: _zend_function__bindgen_ty_1::scope"]
        [::std::mem::offset_of!(_zend_function__bindgen_ty_1, scope) - 16usize];
    ["Offset of field: _zend_function__bindgen_ty_1::prototype"]
        [::std::mem::offset_of!(_zend_function__bindgen_ty_1, prototype) - 24usize];
    ["Offset of field: _zend_function__bindgen_ty_1::num_args"]
        [::std::mem::offset_of!(_zend_function__bindgen_ty_1, num_args) - 32usize];
    ["Offset of field: _zend_function__bindgen_ty_1::required_num_args"]
        [::std::mem::offset_of!(_zend_function__bindgen_ty_1, required_num_args) - 36usize];
    ["Offset of field: _zend_function__bindgen_ty_1::arg_info"]
        [::std::mem::offset_of!(_zend_function__bindgen_ty_1, arg_info) - 40usize];
    ["Offset of field: _zend_function__bindgen_ty_1::attributes"]
        [::std::mem::offset_of!(_zend_function__bindgen_ty_1, attributes) - 48usize];
    ["Offset of field: _zend_function__bindgen_ty_1::run_time_cache__ptr"]
        [::std::mem::offset_of!(_zend_function__bindgen_ty_1, run_time_cache__ptr) - 56usize];
    ["Offset of field: _zend_function__bindgen_ty_1::doc_comment"]
        [::std::mem::offset_of!(_zend_function__bindgen_ty_1, doc_comment) - 64usize];
    ["Offset of field: _zend_function__bindgen_ty_1::T"]
        [::std::mem::offset_of!(_zend_function__bindgen_ty_1, T) - 72usize];
    ["Offset of field: _zend_function__bindgen_ty_1::prop_info"]
        [::std::mem::offset_of!(_zend_function__bindgen_ty_1, prop_info) - 80usize];
};
impl Default for _zend_function__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_function"][::std::mem::size_of::<_zend_function>() - 256usize];
    ["Alignment of _zend_function"][::std::mem::align_of::<_zend_function>() - 8usize];
    ["Offset of field: _zend_function::type_"]
        [::std::mem::offset_of!(_zend_function, type_) - 0usize];
    ["Offset of field: _zend_function::quick_arg_flags"]
        [::std::mem::offset_of!(_zend_function, quick_arg_flags) - 0usize];
    ["Offset of field: _zend_function::common"]
        [::std::mem::offset_of!(_zend_function, common) - 0usize];
    ["Offset of field: _zend_function::op_array"]
        [::std::mem::offset_of!(_zend_function, op_array) - 0usize];
    ["Offset of field: _zend_function::internal_function"]
        [::std::mem::offset_of!(_zend_function, internal_function) - 0usize];
};
impl Default for _zend_function {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_execute_data {
    pub opline: *const zend_op,
    pub call: *mut zend_execute_data,
    pub return_value: *mut zval,
    pub func: *mut zend_function,
    pub This: zval,
    pub prev_execute_data: *mut zend_execute_data,
    pub symbol_table: *mut zend_array,
    pub run_time_cache: *mut *mut ::std::os::raw::c_void,
    pub extra_named_params: *mut zend_array,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_execute_data"][::std::mem::size_of::<_zend_execute_data>() - 80usize];
    ["Alignment of _zend_execute_data"][::std::mem::align_of::<_zend_execute_data>() - 8usize];
    ["Offset of field: _zend_execute_data::opline"]
        [::std::mem::offset_of!(_zend_execute_data, opline) - 0usize];
    ["Offset of field: _zend_execute_data::call"]
        [::std::mem::offset_of!(_zend_execute_data, call) - 8usize];
    ["Offset of field: _zend_execute_data::return_value"]
        [::std::mem::offset_of!(_zend_execute_data, return_value) - 16usize];
    ["Offset of field: _zend_execute_data::func"]
        [::std::mem::offset_of!(_zend_execute_data, func) - 24usize];
    ["Offset of field: _zend_execute_data::This"]
        [::std::mem::offset_of!(_zend_execute_data, This) - 32usize];
    ["Offset of field: _zend_execute_data::prev_execute_data"]
        [::std::mem::offset_of!(_zend_execute_data, prev_execute_data) - 48usize];
    ["Offset of field: _zend_execute_data::symbol_table"]
        [::std::mem::offset_of!(_zend_execute_data, symbol_table) - 56usize];
    ["Offset of field: _zend_execute_data::run_time_cache"]
        [::std::mem::offset_of!(_zend_execute_data, run_time_cache) - 64usize];
    ["Offset of field: _zend_execute_data::extra_named_params"]
        [::std::mem::offset_of!(_zend_execute_data, extra_named_params) - 72usize];
};
impl Default for _zend_execute_data {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type sigjmp_buf = [::std::os::raw::c_int; 49usize];
pub type zend_compiler_globals = _zend_compiler_globals;
pub type zend_executor_globals = _zend_executor_globals;
pub type zend_php_scanner_globals = _zend_php_scanner_globals;
pub type zend_ini_scanner_globals = _zend_ini_scanner_globals;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_compiler_globals {
    pub loop_var_stack: zend_stack,
    pub active_class_entry: *mut zend_class_entry,
    pub compiled_filename: *mut zend_string,
    pub zend_lineno: ::std::os::raw::c_int,
    pub active_op_array: *mut zend_op_array,
    pub function_table: *mut HashTable,
    pub class_table: *mut HashTable,
    pub auto_globals: *mut HashTable,
    pub parse_error: u8,
    pub in_compilation: bool,
    pub short_tags: bool,
    pub unclean_shutdown: bool,
    pub ini_parser_unbuffered_errors: bool,
    pub open_files: zend_llist,
    pub ini_parser_param: *mut _zend_ini_parser_param,
    pub skip_shebang: bool,
    pub increment_lineno: bool,
    pub variable_width_locale: bool,
    pub ascii_compatible_locale: bool,
    pub doc_comment: *mut zend_string,
    pub extra_fn_flags: u32,
    pub compiler_options: u32,
    pub context: zend_oparray_context,
    pub file_context: zend_file_context,
    pub arena: *mut zend_arena,
    pub interned_strings: HashTable,
    pub script_encoding_list: *mut *const zend_encoding,
    pub script_encoding_list_size: usize,
    pub multibyte: bool,
    pub detect_unicode: bool,
    pub encoding_declared: bool,
    pub ast: *mut zend_ast,
    pub ast_arena: *mut zend_arena,
    pub delayed_oplines_stack: zend_stack,
    pub memoized_exprs: *mut HashTable,
    pub memoize_mode: zend_memoize_mode,
    pub map_ptr_real_base: *mut ::std::os::raw::c_void,
    pub map_ptr_base: *mut ::std::os::raw::c_void,
    pub map_ptr_size: usize,
    pub map_ptr_last: usize,
    pub delayed_variance_obligations: *mut HashTable,
    pub delayed_autoloads: *mut HashTable,
    pub unlinked_uses: *mut HashTable,
    pub current_linking_class: *mut zend_class_entry,
    pub rtd_key_counter: u32,
    pub internal_run_time_cache: *mut ::std::os::raw::c_void,
    pub internal_run_time_cache_size: u32,
    pub short_circuiting_opnums: zend_stack,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_compiler_globals"][::std::mem::size_of::<_zend_compiler_globals>() - 616usize];
    ["Alignment of _zend_compiler_globals"]
        [::std::mem::align_of::<_zend_compiler_globals>() - 8usize];
    ["Offset of field: _zend_compiler_globals::loop_var_stack"]
        [::std::mem::offset_of!(_zend_compiler_globals, loop_var_stack) - 0usize];
    ["Offset of field: _zend_compiler_globals::active_class_entry"]
        [::std::mem::offset_of!(_zend_compiler_globals, active_class_entry) - 24usize];
    ["Offset of field: _zend_compiler_globals::compiled_filename"]
        [::std::mem::offset_of!(_zend_compiler_globals, compiled_filename) - 32usize];
    ["Offset of field: _zend_compiler_globals::zend_lineno"]
        [::std::mem::offset_of!(_zend_compiler_globals, zend_lineno) - 40usize];
    ["Offset of field: _zend_compiler_globals::active_op_array"]
        [::std::mem::offset_of!(_zend_compiler_globals, active_op_array) - 48usize];
    ["Offset of field: _zend_compiler_globals::function_table"]
        [::std::mem::offset_of!(_zend_compiler_globals, function_table) - 56usize];
    ["Offset of field: _zend_compiler_globals::class_table"]
        [::std::mem::offset_of!(_zend_compiler_globals, class_table) - 64usize];
    ["Offset of field: _zend_compiler_globals::auto_globals"]
        [::std::mem::offset_of!(_zend_compiler_globals, auto_globals) - 72usize];
    ["Offset of field: _zend_compiler_globals::parse_error"]
        [::std::mem::offset_of!(_zend_compiler_globals, parse_error) - 80usize];
    ["Offset of field: _zend_compiler_globals::in_compilation"]
        [::std::mem::offset_of!(_zend_compiler_globals, in_compilation) - 81usize];
    ["Offset of field: _zend_compiler_globals::short_tags"]
        [::std::mem::offset_of!(_zend_compiler_globals, short_tags) - 82usize];
    ["Offset of field: _zend_compiler_globals::unclean_shutdown"]
        [::std::mem::offset_of!(_zend_compiler_globals, unclean_shutdown) - 83usize];
    ["Offset of field: _zend_compiler_globals::ini_parser_unbuffered_errors"]
        [::std::mem::offset_of!(_zend_compiler_globals, ini_parser_unbuffered_errors) - 84usize];
    ["Offset of field: _zend_compiler_globals::open_files"]
        [::std::mem::offset_of!(_zend_compiler_globals, open_files) - 88usize];
    ["Offset of field: _zend_compiler_globals::ini_parser_param"]
        [::std::mem::offset_of!(_zend_compiler_globals, ini_parser_param) - 144usize];
    ["Offset of field: _zend_compiler_globals::skip_shebang"]
        [::std::mem::offset_of!(_zend_compiler_globals, skip_shebang) - 152usize];
    ["Offset of field: _zend_compiler_globals::increment_lineno"]
        [::std::mem::offset_of!(_zend_compiler_globals, increment_lineno) - 153usize];
    ["Offset of field: _zend_compiler_globals::variable_width_locale"]
        [::std::mem::offset_of!(_zend_compiler_globals, variable_width_locale) - 154usize];
    ["Offset of field: _zend_compiler_globals::ascii_compatible_locale"]
        [::std::mem::offset_of!(_zend_compiler_globals, ascii_compatible_locale) - 155usize];
    ["Offset of field: _zend_compiler_globals::doc_comment"]
        [::std::mem::offset_of!(_zend_compiler_globals, doc_comment) - 160usize];
    ["Offset of field: _zend_compiler_globals::extra_fn_flags"]
        [::std::mem::offset_of!(_zend_compiler_globals, extra_fn_flags) - 168usize];
    ["Offset of field: _zend_compiler_globals::compiler_options"]
        [::std::mem::offset_of!(_zend_compiler_globals, compiler_options) - 172usize];
    ["Offset of field: _zend_compiler_globals::context"]
        [::std::mem::offset_of!(_zend_compiler_globals, context) - 176usize];
    ["Offset of field: _zend_compiler_globals::file_context"]
        [::std::mem::offset_of!(_zend_compiler_globals, file_context) - 256usize];
    ["Offset of field: _zend_compiler_globals::arena"]
        [::std::mem::offset_of!(_zend_compiler_globals, arena) - 360usize];
    ["Offset of field: _zend_compiler_globals::interned_strings"]
        [::std::mem::offset_of!(_zend_compiler_globals, interned_strings) - 368usize];
    ["Offset of field: _zend_compiler_globals::script_encoding_list"]
        [::std::mem::offset_of!(_zend_compiler_globals, script_encoding_list) - 424usize];
    ["Offset of field: _zend_compiler_globals::script_encoding_list_size"]
        [::std::mem::offset_of!(_zend_compiler_globals, script_encoding_list_size) - 432usize];
    ["Offset of field: _zend_compiler_globals::multibyte"]
        [::std::mem::offset_of!(_zend_compiler_globals, multibyte) - 440usize];
    ["Offset of field: _zend_compiler_globals::detect_unicode"]
        [::std::mem::offset_of!(_zend_compiler_globals, detect_unicode) - 441usize];
    ["Offset of field: _zend_compiler_globals::encoding_declared"]
        [::std::mem::offset_of!(_zend_compiler_globals, encoding_declared) - 442usize];
    ["Offset of field: _zend_compiler_globals::ast"]
        [::std::mem::offset_of!(_zend_compiler_globals, ast) - 448usize];
    ["Offset of field: _zend_compiler_globals::ast_arena"]
        [::std::mem::offset_of!(_zend_compiler_globals, ast_arena) - 456usize];
    ["Offset of field: _zend_compiler_globals::delayed_oplines_stack"]
        [::std::mem::offset_of!(_zend_compiler_globals, delayed_oplines_stack) - 464usize];
    ["Offset of field: _zend_compiler_globals::memoized_exprs"]
        [::std::mem::offset_of!(_zend_compiler_globals, memoized_exprs) - 488usize];
    ["Offset of field: _zend_compiler_globals::memoize_mode"]
        [::std::mem::offset_of!(_zend_compiler_globals, memoize_mode) - 496usize];
    ["Offset of field: _zend_compiler_globals::map_ptr_real_base"]
        [::std::mem::offset_of!(_zend_compiler_globals, map_ptr_real_base) - 504usize];
    ["Offset of field: _zend_compiler_globals::map_ptr_base"]
        [::std::mem::offset_of!(_zend_compiler_globals, map_ptr_base) - 512usize];
    ["Offset of field: _zend_compiler_globals::map_ptr_size"]
        [::std::mem::offset_of!(_zend_compiler_globals, map_ptr_size) - 520usize];
    ["Offset of field: _zend_compiler_globals::map_ptr_last"]
        [::std::mem::offset_of!(_zend_compiler_globals, map_ptr_last) - 528usize];
    ["Offset of field: _zend_compiler_globals::delayed_variance_obligations"]
        [::std::mem::offset_of!(_zend_compiler_globals, delayed_variance_obligations) - 536usize];
    ["Offset of field: _zend_compiler_globals::delayed_autoloads"]
        [::std::mem::offset_of!(_zend_compiler_globals, delayed_autoloads) - 544usize];
    ["Offset of field: _zend_compiler_globals::unlinked_uses"]
        [::std::mem::offset_of!(_zend_compiler_globals, unlinked_uses) - 552usize];
    ["Offset of field: _zend_compiler_globals::current_linking_class"]
        [::std::mem::offset_of!(_zend_compiler_globals, current_linking_class) - 560usize];
    ["Offset of field: _zend_compiler_globals::rtd_key_counter"]
        [::std::mem::offset_of!(_zend_compiler_globals, rtd_key_counter) - 568usize];
    ["Offset of field: _zend_compiler_globals::internal_run_time_cache"]
        [::std::mem::offset_of!(_zend_compiler_globals, internal_run_time_cache) - 576usize];
    ["Offset of field: _zend_compiler_globals::internal_run_time_cache_size"]
        [::std::mem::offset_of!(_zend_compiler_globals, internal_run_time_cache_size) - 584usize];
    ["Offset of field: _zend_compiler_globals::short_circuiting_opnums"]
        [::std::mem::offset_of!(_zend_compiler_globals, short_circuiting_opnums) - 592usize];
};
impl Default for _zend_compiler_globals {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub static mut compiler_globals: _zend_compiler_globals;
}
unsafe extern "C" {
    pub fn zendparse() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut executor_globals: zend_executor_globals;
}
unsafe extern "C" {
    pub static mut language_scanner_globals: zend_php_scanner_globals;
}
unsafe extern "C" {
    pub static mut ini_scanner_globals: zend_ini_scanner_globals;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct zend_atomic_bool_s {
    pub value: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of zend_atomic_bool_s"][::std::mem::size_of::<zend_atomic_bool_s>() - 1usize];
    ["Alignment of zend_atomic_bool_s"][::std::mem::align_of::<zend_atomic_bool_s>() - 1usize];
    ["Offset of field: zend_atomic_bool_s::value"]
        [::std::mem::offset_of!(zend_atomic_bool_s, value) - 0usize];
};
pub type zend_atomic_bool = zend_atomic_bool_s;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct zend_atomic_int_s {
    pub value: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of zend_atomic_int_s"][::std::mem::size_of::<zend_atomic_int_s>() - 4usize];
    ["Alignment of zend_atomic_int_s"][::std::mem::align_of::<zend_atomic_int_s>() - 4usize];
    ["Offset of field: zend_atomic_int_s::value"]
        [::std::mem::offset_of!(zend_atomic_int_s, value) - 0usize];
};
pub type zend_atomic_int = zend_atomic_int_s;
unsafe extern "C" {
    pub fn zend_atomic_bool_init(obj: *mut zend_atomic_bool, desired: bool);
}
unsafe extern "C" {
    pub fn zend_atomic_int_init(obj: *mut zend_atomic_int, desired: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn zend_atomic_bool_exchange(obj: *mut zend_atomic_bool, desired: bool) -> bool;
}
unsafe extern "C" {
    pub fn zend_atomic_int_exchange(
        obj: *mut zend_atomic_int,
        desired: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_atomic_bool_compare_exchange(
        obj: *mut zend_atomic_bool,
        expected: *mut bool,
        desired: bool,
    ) -> bool;
}
unsafe extern "C" {
    pub fn zend_atomic_int_compare_exchange(
        obj: *mut zend_atomic_int,
        expected: *mut ::std::os::raw::c_int,
        desired: ::std::os::raw::c_int,
    ) -> bool;
}
unsafe extern "C" {
    pub fn zend_atomic_bool_store(obj: *mut zend_atomic_bool, desired: bool);
}
unsafe extern "C" {
    pub fn zend_atomic_int_store(obj: *mut zend_atomic_int, desired: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn zend_atomic_bool_load(obj: *const zend_atomic_bool) -> bool;
}
unsafe extern "C" {
    pub fn zend_atomic_int_load(obj: *const zend_atomic_int) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_stack {
    pub size: ::std::os::raw::c_int,
    pub top: ::std::os::raw::c_int,
    pub max: ::std::os::raw::c_int,
    pub elements: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_stack"][::std::mem::size_of::<_zend_stack>() - 24usize];
    ["Alignment of _zend_stack"][::std::mem::align_of::<_zend_stack>() - 8usize];
    ["Offset of field: _zend_stack::size"][::std::mem::offset_of!(_zend_stack, size) - 0usize];
    ["Offset of field: _zend_stack::top"][::std::mem::offset_of!(_zend_stack, top) - 4usize];
    ["Offset of field: _zend_stack::max"][::std::mem::offset_of!(_zend_stack, max) - 8usize];
    ["Offset of field: _zend_stack::elements"]
        [::std::mem::offset_of!(_zend_stack, elements) - 16usize];
};
impl Default for _zend_stack {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_stack = _zend_stack;
pub const zend_stack_apply_direction_ZEND_STACK_APPLY_TOPDOWN: zend_stack_apply_direction = 0;
pub const zend_stack_apply_direction_ZEND_STACK_APPLY_BOTTOMUP: zend_stack_apply_direction = 1;
pub type zend_stack_apply_direction = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn zend_stack_init(stack: *mut zend_stack, size: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn zend_stack_push(
        stack: *mut zend_stack,
        element: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_stack_top(stack: *const zend_stack) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn zend_stack_del_top(stack: *mut zend_stack);
}
unsafe extern "C" {
    pub fn zend_stack_int_top(stack: *const zend_stack) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_stack_is_empty(stack: *const zend_stack) -> bool;
}
unsafe extern "C" {
    pub fn zend_stack_destroy(stack: *mut zend_stack);
}
unsafe extern "C" {
    pub fn zend_stack_base(stack: *const zend_stack) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn zend_stack_count(stack: *const zend_stack) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_stack_apply(
        stack: *mut zend_stack,
        type_: ::std::os::raw::c_int,
        apply_function: ::std::option::Option<
            unsafe extern "C" fn(element: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn zend_stack_apply_with_argument(
        stack: *mut zend_stack,
        type_: zend_stack_apply_direction,
        apply_function: ::std::option::Option<
            unsafe extern "C" fn(
                element: *mut ::std::os::raw::c_void,
                arg: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        arg: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn zend_stack_clean(
        stack: *mut zend_stack,
        func: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
        free_elements: bool,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_ptr_stack {
    pub top: ::std::os::raw::c_int,
    pub max: ::std::os::raw::c_int,
    pub elements: *mut *mut ::std::os::raw::c_void,
    pub top_element: *mut *mut ::std::os::raw::c_void,
    pub persistent: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_ptr_stack"][::std::mem::size_of::<_zend_ptr_stack>() - 32usize];
    ["Alignment of _zend_ptr_stack"][::std::mem::align_of::<_zend_ptr_stack>() - 8usize];
    ["Offset of field: _zend_ptr_stack::top"]
        [::std::mem::offset_of!(_zend_ptr_stack, top) - 0usize];
    ["Offset of field: _zend_ptr_stack::max"]
        [::std::mem::offset_of!(_zend_ptr_stack, max) - 4usize];
    ["Offset of field: _zend_ptr_stack::elements"]
        [::std::mem::offset_of!(_zend_ptr_stack, elements) - 8usize];
    ["Offset of field: _zend_ptr_stack::top_element"]
        [::std::mem::offset_of!(_zend_ptr_stack, top_element) - 16usize];
    ["Offset of field: _zend_ptr_stack::persistent"]
        [::std::mem::offset_of!(_zend_ptr_stack, persistent) - 24usize];
};
impl Default for _zend_ptr_stack {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_ptr_stack = _zend_ptr_stack;
unsafe extern "C" {
    pub fn zend_ptr_stack_init(stack: *mut zend_ptr_stack);
}
unsafe extern "C" {
    pub fn zend_ptr_stack_init_ex(stack: *mut zend_ptr_stack, persistent: bool);
}
unsafe extern "C" {
    pub fn zend_ptr_stack_n_push(stack: *mut zend_ptr_stack, count: ::std::os::raw::c_int, ...);
}
unsafe extern "C" {
    pub fn zend_ptr_stack_n_pop(stack: *mut zend_ptr_stack, count: ::std::os::raw::c_int, ...);
}
unsafe extern "C" {
    pub fn zend_ptr_stack_destroy(stack: *mut zend_ptr_stack);
}
unsafe extern "C" {
    pub fn zend_ptr_stack_apply(
        stack: *mut zend_ptr_stack,
        func: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    );
}
unsafe extern "C" {
    pub fn zend_ptr_stack_reverse_apply(
        stack: *mut zend_ptr_stack,
        func: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    );
}
unsafe extern "C" {
    pub fn zend_ptr_stack_clean(
        stack: *mut zend_ptr_stack,
        func: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
        free_elements: bool,
    );
}
unsafe extern "C" {
    pub fn zend_ptr_stack_num_elements(stack: *mut zend_ptr_stack) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_object_std_init(object: *mut zend_object, ce: *mut zend_class_entry);
}
unsafe extern "C" {
    pub fn zend_objects_new(ce: *mut zend_class_entry) -> *mut zend_object;
}
unsafe extern "C" {
    pub fn zend_objects_clone_members(new_object: *mut zend_object, old_object: *mut zend_object);
}
unsafe extern "C" {
    pub fn zend_object_std_dtor(object: *mut zend_object);
}
unsafe extern "C" {
    pub fn zend_objects_destroy_object(object: *mut zend_object);
}
unsafe extern "C" {
    pub fn zend_objects_clone_obj(object: *mut zend_object) -> *mut zend_object;
}
unsafe extern "C" {
    pub fn zend_object_dtor_dynamic_properties(object: *mut zend_object);
}
unsafe extern "C" {
    pub fn zend_object_dtor_property(object: *mut zend_object, p: *mut zval);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_objects_store {
    pub object_buckets: *mut *mut zend_object,
    pub top: u32,
    pub size: u32,
    pub free_list_head: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_objects_store"][::std::mem::size_of::<_zend_objects_store>() - 24usize];
    ["Alignment of _zend_objects_store"][::std::mem::align_of::<_zend_objects_store>() - 8usize];
    ["Offset of field: _zend_objects_store::object_buckets"]
        [::std::mem::offset_of!(_zend_objects_store, object_buckets) - 0usize];
    ["Offset of field: _zend_objects_store::top"]
        [::std::mem::offset_of!(_zend_objects_store, top) - 8usize];
    ["Offset of field: _zend_objects_store::size"]
        [::std::mem::offset_of!(_zend_objects_store, size) - 12usize];
    ["Offset of field: _zend_objects_store::free_list_head"]
        [::std::mem::offset_of!(_zend_objects_store, free_list_head) - 16usize];
};
impl Default for _zend_objects_store {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_objects_store = _zend_objects_store;
unsafe extern "C" {
    pub fn zend_objects_store_init(objects: *mut zend_objects_store, init_size: u32);
}
unsafe extern "C" {
    pub fn zend_objects_store_call_destructors(objects: *mut zend_objects_store);
}
unsafe extern "C" {
    pub fn zend_objects_store_mark_destructed(objects: *mut zend_objects_store);
}
unsafe extern "C" {
    pub fn zend_objects_store_free_object_storage(
        objects: *mut zend_objects_store,
        fast_shutdown: bool,
    );
}
unsafe extern "C" {
    pub fn zend_objects_store_destroy(objects: *mut zend_objects_store);
}
unsafe extern "C" {
    pub fn zend_objects_store_put(object: *mut zend_object);
}
unsafe extern "C" {
    pub fn zend_objects_store_del(object: *mut zend_object);
}
unsafe extern "C" {
    pub fn zend_get_property_info_for_slot_slow(
        obj: *mut zend_object,
        slot: *mut zval,
    ) -> *mut zend_property_info;
}
unsafe extern "C" {
    pub fn zend_init_fpu();
}
unsafe extern "C" {
    pub fn zend_shutdown_fpu();
}
unsafe extern "C" {
    pub fn zend_ensure_fpu_mode();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_encoding {
    _unused: [u8; 0],
}
pub type zend_encoding = _zend_encoding;
pub type zend_encoding_filter = ::std::option::Option<
    unsafe extern "C" fn(
        str_: *mut *mut ::std::os::raw::c_uchar,
        str_length: *mut usize,
        buf: *const ::std::os::raw::c_uchar,
        length: usize,
    ) -> usize,
>;
pub type zend_encoding_fetcher = ::std::option::Option<
    unsafe extern "C" fn(encoding_name: *const ::std::os::raw::c_char) -> *const zend_encoding,
>;
pub type zend_encoding_name_getter = ::std::option::Option<
    unsafe extern "C" fn(encoding: *const zend_encoding) -> *const ::std::os::raw::c_char,
>;
pub type zend_encoding_lexer_compatibility_checker =
    ::std::option::Option<unsafe extern "C" fn(encoding: *const zend_encoding) -> bool>;
pub type zend_encoding_detector = ::std::option::Option<
    unsafe extern "C" fn(
        string: *const ::std::os::raw::c_uchar,
        length: usize,
        list: *mut *const zend_encoding,
        list_size: usize,
    ) -> *const zend_encoding,
>;
pub type zend_encoding_converter = ::std::option::Option<
    unsafe extern "C" fn(
        to: *mut *mut ::std::os::raw::c_uchar,
        to_length: *mut usize,
        from: *const ::std::os::raw::c_uchar,
        from_length: usize,
        encoding_to: *const zend_encoding,
        encoding_from: *const zend_encoding,
    ) -> usize,
>;
pub type zend_encoding_list_parser = ::std::option::Option<
    unsafe extern "C" fn(
        encoding_list: *const ::std::os::raw::c_char,
        encoding_list_len: usize,
        return_list: *mut *mut *const zend_encoding,
        return_size: *mut usize,
        persistent: bool,
    ) -> zend_result,
>;
pub type zend_encoding_internal_encoding_getter =
    ::std::option::Option<unsafe extern "C" fn() -> *const zend_encoding>;
pub type zend_encoding_internal_encoding_setter =
    ::std::option::Option<unsafe extern "C" fn(encoding: *const zend_encoding) -> zend_result>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_multibyte_functions {
    pub provider_name: *const ::std::os::raw::c_char,
    pub encoding_fetcher: zend_encoding_fetcher,
    pub encoding_name_getter: zend_encoding_name_getter,
    pub lexer_compatibility_checker: zend_encoding_lexer_compatibility_checker,
    pub encoding_detector: zend_encoding_detector,
    pub encoding_converter: zend_encoding_converter,
    pub encoding_list_parser: zend_encoding_list_parser,
    pub internal_encoding_getter: zend_encoding_internal_encoding_getter,
    pub internal_encoding_setter: zend_encoding_internal_encoding_setter,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _zend_multibyte_functions"]
        [::std::mem::size_of::<_zend_multibyte_functions>() - 72usize];
    ["Alignment of _zend_multibyte_functions"]
        [::std::mem::align_of::<_zend_multibyte_functions>() - 8usize];
    ["Offset of field: _zend_multibyte_functions::provider_name"]
        [::std::mem::offset_of!(_zend_multibyte_functions, provider_name) - 0usize];
    ["Offset of field: _zend_multibyte_functions::encoding_fetcher"]
        [::std::mem::offset_of!(_zend_multibyte_functions, encoding_fetcher) - 8usize];
    ["Offset of field: _zend_multibyte_functions::encoding_name_getter"]
        [::std::mem::offset_of!(_zend_multibyte_functions, encoding_name_getter) - 16usize];
    ["Offset of field: _zend_multibyte_functions::lexer_compatibility_checker"]
        [::std::mem::offset_of!(_zend_multibyte_functions, lexer_compatibility_checker) - 24usize];
    ["Offset of field: _zend_multibyte_functions::encoding_detector"]
        [::std::mem::offset_of!(_zend_multibyte_functions, encoding_detector) - 32usize];
    ["Offset of field: _zend_multibyte_functions::encoding_converter"]
        [::std::mem::offset_of!(_zend_multibyte_functions, encoding_converter) - 40usize];
    ["Offset of field: _zend_multibyte_functions::encoding_list_parser"]
        [::std::mem::offset_of!(_zend_multibyte_functions, encoding_list_parser) - 48usize];
    ["Offset of field: _zend_multibyte_functions::internal_encoding_getter"]
        [::std::mem::offset_of!(_zend_multibyte_functions, internal_encoding_getter) - 56usize];
    ["Offset of field: _zend_multibyte_functions::internal_encoding_setter"]
        [::std::mem::offset_of!(_zend_multibyte_functions, internal_encoding_setter) - 64usize];
};
impl Default for _zend_multibyte_functions {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type zend_multibyte_functions = _zend_multibyte_functions;
unsafe extern "C" {
    pub static mut zend_multibyte_encoding_utf32be: *const zend_encoding;
}
unsafe extern "C" {
    pub static mut zend_multibyte_encoding_utf32le: *const zend_encoding;
}
unsafe extern "C" {
    pub static mut zend_multibyte_encoding_utf16be: *const zend_encoding;
}
unsafe extern "C" {
    pub static mut zend_multibyte_encoding_utf16le: *const zend_encoding;
}
unsafe extern "C" {
    pub static mut zend_multibyte_encoding_utf8: *const zend_encoding;
}
unsafe extern "C" {
    pub fn zend_multibyte_set_functions(functions: *const zend_multibyte_functions) -> zend_result;
}
unsafe extern "C" {
    pub fn zend_multibyte_restore_functions();
}
unsafe extern "C" {
    pub fn zend_multibyte_get_functions() -> *const zend_multibyte_functions;
}
unsafe extern "C" {
    pub fn zend_multibyte_fetch_encoding(
        name: *const ::std::os::raw::c_char,
    ) -> *const zend_encoding;
}
unsafe extern "C" {
    pub fn zend_multibyte_get_encoding_name(
        encoding: *const zend_encoding,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn zend_multibyte_check_lexer_compatibility(
        encoding: *const zend_encoding,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn zend_multibyte_encoding_detector(
        string: *const ::std::os::raw::c_uchar,
        length: usize,
        list: *mut *const zend_encoding,
        list_size: usize,
    ) -> *const zend_encoding;
}
unsafe extern "C" {
    pub fn zend_multibyte_encoding_converter(
        to: *mut *mut ::std::os::raw::c_uchar,
        to_length: *mut usize,
        from: *const ::std::os::raw::c_uchar,
        from_length: usize,
